{
    "creatures": [
        {
            "id": "1",
            "name": "Black Sea bottlenose dolphin",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F1.jpg?alt=media&token=dfb7c8cc-7006-4bff-b085-3e68a2ea2763",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F2.jpg?alt=media&token=a31f77d5-8bf1-4747-ba37-86ed0270429b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F3.jpg?alt=media&token=93997e1d-4f39-4292-9f1b-663342cc66ca",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F4.jpg?alt=media&token=aedf343f-e1a5-4d75-8247-d9b0758426b4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F5.jpg?alt=media&token=ed9917a4-cf88-48a0-8926-7c28e3b0256b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F6.jpg?alt=media&token=b389d522-fe1e-464f-9c3b-ac0583d24dce",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F7.jpg?alt=media&token=7523cdfc-7b7c-4f48-a7aa-beeaef7b3a96",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F8.jpg?alt=media&token=4b32deda-f4b9-4252-afc2-7fd67efb5963",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F9.jpg?alt=media&token=25830548-3f01-4eea-b2e3-1b13b49d33e4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F10.jpg?alt=media&token=9cfff74a-94cb-435f-9c91-10127aa8941a"
            ],
            "video": "https://www.youtube.com/embed/VjMn_dVCJyA?si=GHiTla-94R16yMAh",
            "text": "The Black Sea bottlenose dolphin (Tursiops truncatus ponticus) is a subspecies of the common bottlenose dolphin. Recent findings suggest that they differ from the common bottlenose dolphin based on slight differences in cranial activity and genetic composition. Bottlenose dolphins are aquatic mammals in the genus Tursiops. The bottlenose dolphin weighs an average of 300 kg (660 pounds), but can range from 150 to 650 kg (330 to 1,430 lb). It can reach a length of just over 4 meters (13 feet). Its color varies considerably, is usually dark gray on the back and lighter gray on the flanks, but it can be bluish-grey, brownish-grey, or even nearly black, and is often darker on the back from the rostrum to behind the dorsal fin. This is called countershading and is a form of camouflage. Older dolphins sometimes have a few spots.<br/> Bottlenose dolphins can live for more than 40 years. Females typically live 5-10 years longer than males, with some females exceeding 60 years. This extreme age is rare and less than 2% of all Bottlenose dolphins will live longer than 60 years. Bottlenose dolphins can jump to a height of 6 metres (20 feet) in the air.<br/> Their elongated upper and lower jaws form what is called a rostrum, or snout, which gives the animal its common name. The real, functional nose is the blowhole on top of its head; the nasal septum is visible when the blowhole is open.<br/> Bottlenose dolphins have 18 to 28 conical teeth on each side of each jaw.<br/> The flukes (lobes of the tail) and dorsal fin are formed of dense connective tissue and do not contain bone or muscle. The dorsal fin usually shows phenotypic variations that help discriminate among populations. The animal propels itself by moving the flukes up and down. The pectoral flippers (at the sides of the body) are for steering; they contain bones homologous to the forelimbs of land mammals.<br/> Bottlenose dolphins typically swim at 5 to 11 km/h (1.4 to 3.1 m/s), but are capable of bursts of up to 29 to 35 km/h (8.1 to 9.7 m/s). The higher speeds can only be sustained for a short time.<br/> The dolphin's search for food is aided by a form of sonar known as echolocation: it locates objects by producing sounds and listening for the echoes.<br/> Bottlenose dolphins communicate through burst pulsed sounds, whistles, and body language. Examples of body language include leaping out of the water, snapping jaws, slapping the tail on the surface and butting heads. Sounds and gestures help keep track of other dolphins in the group, and alert other dolphins to danger and nearby food. Lacking vocal cords, they produce sounds using six air sacs near their blow hole. Each animal has a uniquely identifying, frequency-modulated narrow-band signature vocalization (signature whistle).<br/> Cognitive abilities that have been investigated include concept formation, sensory skills, and mental representations. This includes: acoustic and behavioral mimicry, comprehension of novel sequences in an artificial language, memory, monitoring of self behavior, discrimination and matching, comprehension of symbols for various body parts, comprehension of pointing gestures and gaze, mirror self-recognition, and numerical values.<br/> Adult males live mostly alone or in groups of two to three, and join pods for short periods of time. Adult females and young dolphins normally live in groups of up to 15 animals.<br/> Fish is one of the main items in the dolphin diet. They also eat shrimps, squid, mollusks, and cuttlefish, and only swallow the soft parts. They eat 22 pounds of fish a day."
        },
        {
            "id": "2",
            "name": "Black Sea harbour porpoise",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F1.jpg?alt=media&token=a84382cf-2338-4ce3-ba3e-def002ff3df2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F2.jpg?alt=media&token=1319b34f-239c-4391-be11-c318a25d37a6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F3.jpg?alt=media&token=5f20a60e-a061-47ad-9049-4bf3c9b9d32d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F4.jpg?alt=media&token=8a599ae0-de5e-4cca-b7b9-8daf8253996a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F5.jpg?alt=media&token=be4864c1-4b4c-44ed-b29f-16f374558c0a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F6.jpg?alt=media&token=d880307e-9edc-45d3-993f-351d36f6cadf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F7.jpg?alt=media&token=ee0885ac-0ff1-415d-ac7f-205c51009026",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F8.jpg?alt=media&token=fa6b4a22-bbef-465c-be96-fe2f91e5aa01"
            ],
            "video": "https://www.youtube.com/embed/4GqIzNQOl6s?si=nR_hU0ijgPzQcfZE",
            "text": "The Black Sea harbour porpoise (Phocoena phocoena relicta) is only found in the Black Sea, Turkish Straits System and the northern Aegean Sea. Harbour porpoises inhabit mainly shallow waters over the continental shelf around the entire perimeter of the Black Sea. They are listed in the Red Book. Status: Critically Endangered CR.<br/> The Black Sea harbour porpoise is one of the smallest species of cetacean. It is about 67-85 cm (26.5-33.5 in) long at birth, weighing 6.4-10 kg. Adults grow to 1.4 to 1.9 m (4 ft 7 in to 6 ft 3 in). The females are heavier, with a maximum weight of around 76 kg (168 lb) compared with the males' 61 kg (134 lb). The body is robust, and the animal is at its maximum girth just in front of its triangular dorsal fin. The beak is poorly demarcated. The flippers, dorsal fin, tail fin and back are a dark grey. The sides are a slightly speckled, lighter grey. The underside is much whiter, though there are usually grey stripes running along the throat from the underside of the body.<br/> The vocalizations of the harbour porpoise is made up of short clicks from 0.5 to 5 milliseconds in bursts up to two seconds long. It used for echolocation and communication.<br/> Harbour porpoises feed mostly on small pelagic schooling fish. This species tends to feed close to the sea bottom, at least for waters less than 200 metres (110 fathoms) deep. Harbour porpoises tend to be solitary foragers, but they do sometimes hunt in packs (in groups of no more than five animals) and herd fish together. Young porpoises need to consume about 7% to 8% of their body weight each day to survive, which is approximately 15 pounds or 7 kilograms of fish.<br/> Some studies suggest porpoises are relatively sedentary and usually do not leave a certain area for long. Nevertheless, they have been recorded to move from onshore to offshore waters along coast. Dives of 220 metres (120 fathoms) by harbour porpoises have been recorded. Dives can last five minutes but typically last one minute.<br/> Their average life-span in the wild is 8-13 years, although exceptionally individuals have reached up to 20, and in captivity up to 28 years."  
        },
        {
            "id": "3",
            "name": "Black Sea spiny dogfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F1.jpg?alt=media&token=dcf94638-6dd9-4b68-9e32-d8c791fb904c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F2.jpg?alt=media&token=93c45df3-c3a6-4f22-961d-22e6fa926bfa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F3.jpg?alt=media&token=aa4bcac1-0be3-42a1-a0bd-47cc24ebeac9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F4.jpg?alt=media&token=9750f8a6-0e73-429f-9ab2-55680e4ca26e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F5.jpg?alt=media&token=844e7412-07b7-4bb2-80b5-b2cc8f6790d1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F6.jpg?alt=media&token=3f1dd9eb-fbd5-4e04-bb1e-6f7bdb5fa206",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F7.jpg?alt=media&token=ed7a9832-1deb-4a97-81f0-b7a065d980d0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F8.jpg?alt=media&token=6f010211-a8d0-4721-a77d-c99f1f853af2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F9.jpg?alt=media&token=03af25ce-d185-4d20-9b14-18cb6fa171d2"
            ],
            "video": "https://www.youtube.com/embed/6rhzfOjhIZM?si=f6uHWBncjxZF910G",
            "text": "The Black Sea spiny dogfish (Squalus acanthias ponticus) is a cartilaginous fish, a subspecies of the spiny dogfish species (Squalus acanthias) of the dogfish sharks family (squalidae).<br/> Max length : 160 cm (male), 122 cm (female); common length: 100 cm; max. published weight: 9.1 kg. Life span estimates based on analysis of vertebral centra and annuli in the dorsal spines range from 35 to 54 years. Max. reported age - 75 years. The species name 'acanthias' refers to the shark's two dorsal-fin spines. These are used defensively. If captured, the shark can arch its back to pierce its captor with spines near the dorsal fins that secrete a mild venom into its predator. The spiny dogfish is distinguished from other species by the following main set of characters: very slender body; narrow head; mouth width 1.7-2.2 times its horizontal prenarial length; moderately long snout, preoral length 2.2-2.5 times horizontal prenarial length; single-lobed anterior nasal flap; small dorsal fins, raked; origin of first dorsal-fin located just posterior to pectoral-fin free rear tips; exposed bases of dorsal-fin spines relatively narrow; pale caudal fin with poorly demarcated, whitish margin, blackish caudal blotch at the apex of upper lobe, anterior margins of both lobes whitish in juveniles; dark caudal bar absent; dorsal and lateral surfaces of body bluish grey with an irregular array of moderately-large white spots; whitish ventrally; flank denticles tricuspid.<br/> This shark is known to hunt in packs that can range up into the thousands. They are aggressive hunters and have a sizable diet that can range from squid, fish, crab, jellyfish, shrimp and other invertebrates.<br/> Dogfish sharks experience one of the longest gestation periods of any organism, which can last from around 18 to 24 months. During spawning season, which occurs during the colder months of winter, females can lay anywhere from 2 to 12 eggs, which develop ovoviviparously and the pups are birthed as live young, with about 5 to 6 in each litter of pups, mainly depending on the size of the female. Size at birth 18-30 cm."
        },
        {
            "id": "4",
            "name": "Thornback ray",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F1.jpg?alt=media&token=45462418-e8e7-44fc-ae5b-a04ffbe4abfa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F2.jpg?alt=media&token=babfecd6-e782-49f3-a29b-2f58af92dffd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F3.jpg?alt=media&token=3b28f377-73c1-4a93-af35-20e87bb1dcec",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F4.jpg?alt=media&token=43cd6c06-4c8c-446c-8ba8-a092a030d4c4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F5.jpg?alt=media&token=f0c858be-2508-40b9-93c9-aae96e4ca21e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F6.jpg?alt=media&token=b12a94c0-2f30-4877-8de3-3978d3774abf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F7.jpg?alt=media&token=0bfda18a-8637-47f5-a64c-ba75e767c5ac",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F8.jpg?alt=media&token=5ffe5d4c-5148-4743-be18-9057a0acc91f"
            ],
            "video": "https://www.youtube.com/embed/8tcCzogT2jU?si=NE9vyo70U8ud8_gy",
            "text": "The thornback ray (Raja clavata), or spiny ray, or thornback skate is a cartilaginous fish, a species of ray fish in the family Rajidae. Like all rays, the thornback ray has a flattened body with broad, wing-like pectoral fins. The body is kite-shaped with a long, thorny tail. The back is covered in numerous thorny spines, as is the underside in older females. Adult fish can grow to 1 metre (3.3 ft) in length (max length: 105 cm (male); 139 cm (female)), although most are less than 85 centimetres (33 in). Max. weight: 18 kg. This ray can weigh from 4.5 to 8.75 lb (2 to 4 kg). Their colours vary from light brown to grey with darker blotches and numerous small darker spots and yellow patches. Sometimes the yellow patches are surrounded by small dark spots. The underside is creamy-white with a greyish margin. When threatened they can appear black. In adult fish (particularly females), some of the spines are thickened with button-like bases (known as bucklers).<br/> Thornback rays have pectoral fins with clear angles on lateral side; triangular pelvic fins. 30-50 thorns form a median row from the nape to the first dorsal fin; additional large 'buckler' thorns with swollen bases scattered on upper surface of disc in adults. Large females also prickly throughout their ventral surface; young and large males prickly along the borders of their discs and the underside of their snout.<br/> The thornback ray is usually found on sedimentary seabeds such as mud, sand or gravel at depths between 10-60m. Juvenile fish feed on small crustaceans, particularly amphipods and bottom-living shrimps; adults feed on crabs, shrimps and small fish.<br/> Thornback rays lay eggs on shallow sand, mud, pebble or gravel bottoms. Up to 170 egg cases can be laid by a single female in a year, average fecundity around 48-74 eggs. Egg cases are oblong capsules with stiff pointed horns at the corners, each containing one embryo. Capsules are 5.0-9.0 cm long without the horns and 3.4-6.8 cm wide. Egg cases are anchored with an adhesive film. Embryos feed solely on yolk. Egg cases hatch after about 4-5 months and pups are about 11-13 cm."
        },
        {
            "id": "5",
            "name": "Common stingray",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F1.jpg?alt=media&token=77c74f5d-6646-454c-b873-fee0c4d3d0ad",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F2.jpg?alt=media&token=c3eeefc4-1475-4ff2-af58-68e88c7e3a05",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F3.jpg?alt=media&token=0305c341-8e80-4f0e-97d4-13eaeb773387",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F4.jpg?alt=media&token=3d419535-449f-41b2-b07f-327046769fb5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F5.jpg?alt=media&token=65899e97-0494-49d2-b760-59668f14de3a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F6.jpg?alt=media&token=76e4a7d9-3728-4208-b39e-46825132f149",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F7.jpg?alt=media&token=ff6d0eb3-d042-43f2-9c3f-9bfb06f23149"
            ],
            "video": "https://www.youtube.com/embed/D8opAWwOCJE?si=tG4Nk7uG5Z8Wcviw",
            "text": "The common stingray (Dasyatis pastinaca) is a cartilaginous fish, a species of stingray in the family Dasyatidae. It typically inhabits sandy or muddy habitats in coastal waters shallower than 60 m (200 ft), often burying itself in sediment. The common stingray has a diamond-shaped pectoral fin disc slightly wider than long, and a whip-like tail with upper and lower fin folds. The common stingray has been reported to reach a width of 1.4 m (4.6 ft) and a length of 2.5 m (8.2 ft), though a width of 45 cm (18 in) is more typical. It can be identified by its plain coloration and mostly smooth skin, except for a row of tubercles along the midline of the back in the largest individuals. The leading margins of the disc are almost straight and converge on a pointed, slightly protruding snout; the trailing margins of the disc are convex. The eyes are smaller than the spiracles (paired respiratory openings), which are placed closely behind. There are 28-38 upper tooth rows and 28-43 lower tooth rows; the teeth are small and blunt, and arranged into flattened surfaces. This species is a solid gray, brown, reddish, or olive-green above, and whitish below with dark fin margins. Young rays may have white spots. A stinging spine with strong serrations is equipped with a venom gland at its base, which is positioned about a third of the distance along the tail. A second or even third spine may also be present, as the spines are regularly replaced and new spines grow in before existing ones have been shed. So, the common stingray can inflict a painful, though rarely life-threatening.<br/> The predominant prey of the common stingray are bottom-dwelling crustaceans, though it also takes molluscs, polychaete worms, and small bony fishes. It is aplacental viviparous: the embryos are nourished by yolk and later histotroph ('uterine milk') produced by the mother. Females bear 4-9 young twice per year in shallow water, after a gestation period of four months. Birth usually occurs in summer. Newborns measure about 8 cm (3.1 in) across and 20 cm (7.9 in) long.<br/> The oldest known individual from the wild was ten years of age, but the species has lived up to 21 years in captivity."
        },
        {
            "id": "6",
            "name": "Black scorpionfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F1.jpg?alt=media&token=2f02ecb6-3bab-4d64-a10b-ebb1329ce2aa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F2.jpg?alt=media&token=d44244ce-cb9a-41fe-b183-1c3c61f4833b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F3.jpg?alt=media&token=79f92e1d-c4f6-4a14-9736-e993a9ea5ce2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F4.jpg?alt=media&token=26bb096d-1fe4-4be0-a814-b8d1f10071ac",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F5.jpg?alt=media&token=8aaf2832-a001-44e3-9dd0-2e3d9072fe08",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F6.jpg?alt=media&token=f02d6450-9c20-4393-af16-feb61424b156",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F7.jpg?alt=media&token=f2f3ab85-3c67-4f76-bc86-ffa1cc1f4dc5"
            ],
            "video": "https://www.youtube.com/embed/2ykZRyIlbAA?si=YnqVGilkWvA5hUSt",
            "text": "The black scorpionfish (Scorpaena porcus), also known as the European scorpionfish or small-scaled scorpionfish, is a venomous scorpionfish. The black scorpionfish has a maximum length of about 40 cm (15 in) but a more normal adult length is around 15 cm (6 in). Max. weight: 870 g. The head is broad with a short snout and upwardly angled mouth. Its eyes are large and its mouth is wide, oblique, and terminal, with small, fine teeth. There is a short tentacle just above the eye and various other shorter tentacles, spines and flaps of skin decorating the head. Unlike other species, it does not have a skin flap on its lower jaw. The dorsal fin has twelve spines and nine soft rays and the anal fin has two spines and six soft rays. The pectoral fins are large and oval and have sixteen to eighteen rays. As a defence mechanism it has poisonous needles located on the dorsal, anal, ventral fins and on the operculum. The colour of this fish is generally brownish and there is a dark pigmented spot between the eighth and ninth dorsal spines. The fins are mottled with brown and the caudal fin has three vertical brown stripes. It is a master of mimicry and can camouflage itself so well that it becomes practically invisible to escape its predators and surprise its pray, lying in wait on the bottom. It is basically active at nightfall.<br/> The black scorpionfish is found throughout the Black Sea down to depths of about 800 m (2,625 ft). It is a benthic species and is usually found resting among seaweed and on rocks. It is usually solitary and sedentary, and it feeds on small fishes such as blennies and gobies, crustaceans and other bottom-dwelling invertebrates.<br/> Its reproduction is oviparous. The female lays her eggs and encloses them in a transparent, mucous mass between July and August."
        },
        {
            "id": "7",
            "name": "Tub gurnard",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F1.jpg?alt=media&token=a82f02d3-e5a2-4cc8-bb9c-b088ab48baf7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F2.jpg?alt=media&token=cc30b3e8-57e4-4a54-a145-3682d67ec95f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F3.jpg?alt=media&token=39947e77-995f-4c1e-93a8-dd43fbc543a4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F4.jpg?alt=media&token=77be16a7-a6fc-46f5-b9a0-3753f355b788",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F5.jpg?alt=media&token=07b8e9d2-82fa-4565-a6e2-c81d56a6ece6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F6.jpg?alt=media&token=b5b66a55-6e6f-4856-aab7-738e669191f7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F7.jpg?alt=media&token=7709dd7a-cd37-4a39-baa1-bc486d195da6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F8.jpg?alt=media&token=6915452b-64ec-432f-bfe3-45526e178ab6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F9.jpg?alt=media&token=0b14fcde-13ec-45b3-a96d-34f1b87ea25a"
            ],
            "video": "https://www.youtube.com/embed/DLyuKj0SUSU?si=Hi2FyzngoKCO5TlJ",
            "text": "The tub gurnard (Chelidonichthys lucerna), also known as the sapphirine gurnard, tube-fish, tubfish or yellow gurnard, is a species of marine ray-finned fish belonging to the Triglidae family, the gurnards and sea robins.<br/> The tub gurnard has a large, bony, triangular shaped head which bears many ridges and spines but which does not have an occipital groove. There are two spiny lobes on the tip of the snout and the eyes are relatively small. The large mouth is set low on the head and the jaws and vomer are covered by densely set rows of teeth. There are two dorsal fins, the first contains 8 to 10 spines and the second 16 or 17 soft rays. The anal fin has between 14 and 16 soft rays. The cleithral spine is short and is located over the pectoral fin and extends just to the first quarter of the pectoral fin. The pectoral fins, typically for gurnards are large with the innermost three rays free from the membrane, thickened and finger-like, used for locomotion and to detect prey. There are no scales present on the breast and front section of the belly, the body has small, well embedded scales while the scales on the lateral line are small and tubular. The caudal fin is slightly emarginate. This species reaches a maximum total length of 75.1 cm (29.6 in), the largest species in the family Triglidae, although 30 cm (12 in) is more typical. The heaviest published specimen weighed 6 kg (13 lb). The overall colour is deep reddish brown to pinkish red, with a pinkish lower body. The blue pectoral fins are spotted green in the centres and red on the margins.<br/> This species is found on sand, mud-sand or gravel substrates at depths between 20 and 300 m (66 and 984 ft). During the summer the tub gurnard may spend more time closer to the surface in water as shallow as 10 m (33 ft) and the juveniles can be found in brackish water in lagoons and estuaries.<br/> The tub gurnard is an opportunistic predatory species which feeds on benthic prey, particularly crustaceans and smaller fishes. Crustaceans were a more important part of the diet in the summer and fishes gained importance during the winter. They are also known to take molluscs and polychaetes. Prey hiding in the substrate may be detected using the sensory organs on the long separate rays of the pectoral fins.<br/> The tub gurnard spawns between May and July in the northern parts of its range. The eggs are pelagic and in the larvae and post larvae all of the pectoral fin rays are contained within the fin membrane.<br/> Tub gurnards make grunting or growling sounds, using the muscles associated with the swim bladder, these sounds are thought to be used to keep the schools together."
        },
        {
            "id": "8",
            "name": "Yellow round crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F1.jpg?alt=media&token=55901ab4-d1e1-47c2-982b-67016fea5c4c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F2.jpg?alt=media&token=c06498c3-7365-4688-a4bf-67af03446eaf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F3.jpg?alt=media&token=359d327a-b5a8-4059-97c8-cbeef692d5ba",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F4.jpg?alt=media&token=c200f149-6fd9-451e-891f-7e652c04ea64",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F5.jpg?alt=media&token=1e24478a-e582-4a9c-8e90-bd838d63b837",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F6.jpg?alt=media&token=98709047-fcbc-4528-b6ad-d68087a0b8b2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F7.jpg?alt=media&token=999184dc-395f-4577-89cd-f664e88c3306"
            ],
            "video": "https://www.youtube.com/embed/F372BBSZaRM?si=tzPM7NqstOgFxw8u",
            "text": "The yellow round crab (Eriphia verrucosa), sometimes called the warty crab, belonging to the family of crabs (Eriphiidae). It has decreased in numbers in the Black Sea since the 1980s and is now listed in the Ukrainian Red Data Book of endangered species.<br/> Yellow round crab may reach a width of 9 centimetres (3.5 in) and a length of 7 cm (2.8 in). The carapace is thick and smooth, ranging in colour from brownish-red to brownish-green, with yellow spots; its front margin is armed with seven 'teeth' on either side, and five or six between the eyes. The claws are strong and have black fingers; one claw is generally larger than the other and is armed with rounded tubercles while the smaller claw bears sharper projections, arranged in lines. In the springtime, Yellow round crab migrates to shallow water, less than 1 metre (3 ft 3 in) deep, and reproduction begins in May or June; the species is highly fecund. There are four larval stages, from zoea to megalopa.<br/> The yellow round crab lives among stones and seaweeds in shallow water along rocky coastlines up to a depth of 15 metres (49 ft). It is reported to feed on bivalves, gastropods and hermit crabs, or on molluscs and polychaetes. In the Black Sea yellow round crab is the only native species capable of breaking into the shells of the invasive snail Rapana venosa, although it is unlikely that it will present an effective biological control of the invader. The species is threatened by eutrophication and pollution."
        },
        {
            "id": "9",
            "name": "So-iuy mullet",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F1.jpg?alt=media&token=5606e5fa-089b-4f85-83f0-a243d96267b6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F2.jpg?alt=media&token=5bf8d15c-a8fe-4a74-b1ff-8bfb4b724fd9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F3.jpg?alt=media&token=a2406661-78df-4b9f-a741-77e7a0c23e23",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F4.jpg?alt=media&token=29449ab0-78c7-4172-a54c-49b0d5f0765b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F5.jpg?alt=media&token=8957906d-99c0-4679-b4a3-8ab1a23e37f7"
            ],
            "video": "https://www.youtube.com/embed/LO7VZEorZz4?si=edpOGSjWzcmeB3lj",
            "text": "The so-iuy mullet (Planiliza haematocheilus) is a species of fish in the mullet family (Mugiridae). Common length: 80-85 cm. Max. length: 150 cm. Common weight of adult fish: 6-8 kg. Max. weight: 12 kg. Body rather elongate. Head depressed, hyomandibular region bulging. Upper lip with an outer row of very small, close-set unicuspid teeth and 1 or 2 irregular, inner rows of smaller, ciliiform teeth. Lower lip directed forwards with 1 row of fine ciliiform teeth present or absent. Adipose eyefold moderately developed, covering up the irises. The irises have a reddish or orange tint, distinguishing the so-iuy mullet from other mullets. Origin of first dorsal fin midway between tip of snout and base of caudal fin, or just closer to latter; anal fin with 3 spines and 9 soft rays; caudal fin emarginate. Body dark greenish dorsally, brownish over head, white ventrally; first dorsal fin greyish; second dorsal fin yellowish grey, with dusky margin; anal fin also with dusky margin; caudal fin bluish with black margin; pectoral fins yellowish.<br/> The so-iuy mullet live in flocks at a depth of 2-4 meters. It feeds mainly on periphyton, detritus, and various small benthic invertebrates. It also actively consumes dead fish."
        }
    ]
}