{
    "creatures": [
        {
            "id": 1,
            "class": "Mammals",
            "name": "Black Sea bottlenose dolphin",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F1.jpg?alt=media&token=dfb7c8cc-7006-4bff-b085-3e68a2ea2763",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F2.jpg?alt=media&token=a31f77d5-8bf1-4747-ba37-86ed0270429b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F3.jpg?alt=media&token=93997e1d-4f39-4292-9f1b-663342cc66ca",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F4.jpg?alt=media&token=aedf343f-e1a5-4d75-8247-d9b0758426b4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F5.jpg?alt=media&token=ed9917a4-cf88-48a0-8926-7c28e3b0256b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F6.jpg?alt=media&token=b389d522-fe1e-464f-9c3b-ac0583d24dce",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F7.jpg?alt=media&token=7523cdfc-7b7c-4f48-a7aa-beeaef7b3a96",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F8.jpg?alt=media&token=4b32deda-f4b9-4252-afc2-7fd67efb5963",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F9.jpg?alt=media&token=25830548-3f01-4eea-b2e3-1b13b49d33e4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bottlenose_dolphin_afalina%2F10.jpg?alt=media&token=9cfff74a-94cb-435f-9c91-10127aa8941a"
            ],
            "video": "https://www.youtube.com/embed/VjMn_dVCJyA?si=GHiTla-94R16yMAh",
            "text": "The Black Sea bottlenose dolphin (Tursiops truncatus ponticus) is a subspecies of the common bottlenose dolphin. Recent findings suggest that they differ from the common bottlenose dolphin based on slight differences in cranial activity and genetic composition. Bottlenose dolphins are aquatic mammals in the genus Tursiops. The bottlenose dolphin weighs an average of 300 kg (660 pounds), but can range from 150 to 650 kg (330 to 1,430 lb). It can reach a length of just over 4 meters (13 feet). Its color varies considerably, is usually dark gray on the back and lighter gray on the flanks, but it can be bluish-grey, brownish-grey, or even nearly black, and is often darker on the back from the rostrum to behind the dorsal fin. This is called countershading and is a form of camouflage. Older dolphins sometimes have a few spots.<br/> Bottlenose dolphins can live for more than 40 years. Females typically live 5-10 years longer than males, with some females exceeding 60 years. This extreme age is rare and less than 2% of all Bottlenose dolphins will live longer than 60 years. Bottlenose dolphins can jump to a height of 6 metres (20 feet) in the air.<br/> Their elongated upper and lower jaws form what is called a rostrum, or snout, which gives the animal its common name. The real, functional nose is the blowhole on top of its head; the nasal septum is visible when the blowhole is open.<br/> Bottlenose dolphins have 18 to 28 conical teeth on each side of each jaw.<br/> The flukes (lobes of the tail) and dorsal fin are formed of dense connective tissue and do not contain bone or muscle. The dorsal fin usually shows phenotypic variations that help discriminate among populations. The animal propels itself by moving the flukes up and down. The pectoral flippers (at the sides of the body) are for steering; they contain bones homologous to the forelimbs of land mammals.<br/> Bottlenose dolphins typically swim at 5 to 11 km/h (1.4 to 3.1 m/s), but are capable of bursts of up to 29 to 35 km/h (8.1 to 9.7 m/s). The higher speeds can only be sustained for a short time.<br/> The dolphin's search for food is aided by a form of sonar known as echolocation: it locates objects by producing sounds and listening for the echoes.<br/> Bottlenose dolphins communicate through burst pulsed sounds, whistles, and body language. Examples of body language include leaping out of the water, snapping jaws, slapping the tail on the surface and butting heads. Sounds and gestures help keep track of other dolphins in the group, and alert other dolphins to danger and nearby food. Lacking vocal cords, they produce sounds using six air sacs near their blow hole. Each animal has a uniquely identifying, frequency-modulated narrow-band signature vocalization (signature whistle).<br/> Cognitive abilities that have been investigated include concept formation, sensory skills, and mental representations. This includes: acoustic and behavioral mimicry, comprehension of novel sequences in an artificial language, memory, monitoring of self behavior, discrimination and matching, comprehension of symbols for various body parts, comprehension of pointing gestures and gaze, mirror self-recognition, and numerical values.<br/> Adult males live mostly alone or in groups of two to three, and join pods for short periods of time. Adult females and young dolphins normally live in groups of up to 15 animals.<br/> Fish is one of the main items in the dolphin diet. They also eat shrimps, squid, mollusks, and cuttlefish, and only swallow the soft parts. They eat 22 pounds of fish a day."
        },
        {
            "id": 2,
            "class": "Mammals",
            "name": "Black Sea harbour porpoise",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F1.jpg?alt=media&token=a84382cf-2338-4ce3-ba3e-def002ff3df2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F2.jpg?alt=media&token=1319b34f-239c-4391-be11-c318a25d37a6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F3.jpg?alt=media&token=5f20a60e-a061-47ad-9049-4bf3c9b9d32d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F4.jpg?alt=media&token=8a599ae0-de5e-4cca-b7b9-8daf8253996a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F5.jpg?alt=media&token=be4864c1-4b4c-44ed-b29f-16f374558c0a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F6.jpg?alt=media&token=d880307e-9edc-45d3-993f-351d36f6cadf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F7.jpg?alt=media&token=ee0885ac-0ff1-415d-ac7f-205c51009026",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/harbour_porpoise_azovka%2F8.jpg?alt=media&token=fa6b4a22-bbef-465c-be96-fe2f91e5aa01"
            ],
            "video": "https://www.youtube.com/embed/4GqIzNQOl6s?si=nR_hU0ijgPzQcfZE",
            "text": "The Black Sea harbour porpoise (Phocoena phocoena relicta) is only found in the Black Sea, Turkish Straits System and the northern Aegean Sea. Harbour porpoises inhabit mainly shallow waters over the continental shelf around the entire perimeter of the Black Sea. They are listed in the Red Book. Status: Critically Endangered CR.<br/> The Black Sea harbour porpoise is one of the smallest species of cetacean. It is about 67-85 cm (26.5-33.5 in) long at birth, weighing 6.4-10 kg. Adults grow to 1.4 to 1.9 m (4 ft 7 in to 6 ft 3 in). The females are heavier, with a maximum weight of around 76 kg (168 lb) compared with the males' 61 kg (134 lb). The body is robust, and the animal is at its maximum girth just in front of its triangular dorsal fin. The beak is poorly demarcated. The flippers, dorsal fin, tail fin and back are a dark grey. The sides are a slightly speckled, lighter grey. The underside is much whiter, though there are usually grey stripes running along the throat from the underside of the body.<br/> The vocalizations of the harbour porpoise is made up of short clicks from 0.5 to 5 milliseconds in bursts up to two seconds long. It used for echolocation and communication.<br/> Harbour porpoises feed mostly on small pelagic schooling fish. This species tends to feed close to the sea bottom, at least for waters less than 200 metres (110 fathoms) deep. Harbour porpoises tend to be solitary foragers, but they do sometimes hunt in packs (in groups of no more than five animals) and herd fish together. Young porpoises need to consume about 7% to 8% of their body weight each day to survive, which is approximately 15 pounds or 7 kilograms of fish.<br/> Some studies suggest porpoises are relatively sedentary and usually do not leave a certain area for long. Nevertheless, they have been recorded to move from onshore to offshore waters along coast. Dives of 220 metres (120 fathoms) by harbour porpoises have been recorded. Dives can last five minutes but typically last one minute.<br/> Their average life-span in the wild is 8-13 years, although exceptionally individuals have reached up to 20, and in captivity up to 28 years."  
        },
        {
            "id": 3,
            "class": "Cartilaginous fishes",
            "name": "Black Sea spiny dogfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F1.jpg?alt=media&token=dcf94638-6dd9-4b68-9e32-d8c791fb904c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F2.jpg?alt=media&token=93c45df3-c3a6-4f22-961d-22e6fa926bfa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F3.jpg?alt=media&token=aa4bcac1-0be3-42a1-a0bd-47cc24ebeac9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F4.jpg?alt=media&token=9750f8a6-0e73-429f-9ab2-55680e4ca26e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F5.jpg?alt=media&token=844e7412-07b7-4bb2-80b5-b2cc8f6790d1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F6.jpg?alt=media&token=3f1dd9eb-fbd5-4e04-bb1e-6f7bdb5fa206",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F7.jpg?alt=media&token=ed7a9832-1deb-4a97-81f0-b7a065d980d0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F8.jpg?alt=media&token=6f010211-a8d0-4721-a77d-c99f1f853af2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/spiny_dogfish_katran%2F9.jpg?alt=media&token=03af25ce-d185-4d20-9b14-18cb6fa171d2"
            ],
            "video": "https://www.youtube.com/embed/6rhzfOjhIZM?si=f6uHWBncjxZF910G",
            "text": "The Black Sea spiny dogfish (Squalus acanthias ponticus) is a cartilaginous fish, a subspecies of the spiny dogfish species (Squalus acanthias) of the dogfish sharks family (squalidae).<br/> Max length : 160 cm (male), 122 cm (female); common length: 100 cm; max. published weight: 9.1 kg. Life span estimates based on analysis of vertebral centra and annuli in the dorsal spines range from 35 to 54 years. Max. reported age - 75 years. The species name 'acanthias' refers to the shark's two dorsal-fin spines. These are used defensively. If captured, the shark can arch its back to pierce its captor with spines near the dorsal fins that secrete a mild venom into its predator. The spiny dogfish is distinguished from other species by the following main set of characters: very slender body; narrow head; mouth width 1.7-2.2 times its horizontal prenarial length; moderately long snout, preoral length 2.2-2.5 times horizontal prenarial length; single-lobed anterior nasal flap; small dorsal fins, raked; origin of first dorsal-fin located just posterior to pectoral-fin free rear tips; exposed bases of dorsal-fin spines relatively narrow; pale caudal fin with poorly demarcated, whitish margin, blackish caudal blotch at the apex of upper lobe, anterior margins of both lobes whitish in juveniles; dark caudal bar absent; dorsal and lateral surfaces of body bluish grey with an irregular array of moderately-large white spots; whitish ventrally; flank denticles tricuspid.<br/> This shark is known to hunt in packs that can range up into the thousands. They are aggressive hunters and have a sizable diet that can range from squid, fish, crab, jellyfish, shrimp and other invertebrates.<br/> Dogfish sharks experience one of the longest gestation periods of any organism, which can last from around 18 to 24 months. During spawning season, which occurs during the colder months of winter, females can lay anywhere from 2 to 12 eggs, which develop ovoviviparously and the pups are birthed as live young, with about 5 to 6 in each litter of pups, mainly depending on the size of the female. Size at birth 18-30 cm."
        },
        {
            "id": 4,
            "class": "Cartilaginous fishes",
            "name": "Thornback ray",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F1.jpg?alt=media&token=45462418-e8e7-44fc-ae5b-a04ffbe4abfa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F2.jpg?alt=media&token=babfecd6-e782-49f3-a29b-2f58af92dffd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F3.jpg?alt=media&token=3b28f377-73c1-4a93-af35-20e87bb1dcec",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F4.jpg?alt=media&token=43cd6c06-4c8c-446c-8ba8-a092a030d4c4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F5.jpg?alt=media&token=f0c858be-2508-40b9-93c9-aae96e4ca21e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F6.jpg?alt=media&token=b12a94c0-2f30-4877-8de3-3978d3774abf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F7.jpg?alt=media&token=0bfda18a-8637-47f5-a64c-ba75e767c5ac",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thornback_ray_skate%2F8.jpg?alt=media&token=5ffe5d4c-5148-4743-be18-9057a0acc91f"
            ],
            "video": "https://www.youtube.com/embed/8tcCzogT2jU?si=NE9vyo70U8ud8_gy",
            "text": "The thornback ray (Raja clavata), or spiny ray, or thornback skate is a cartilaginous fish, a species of ray fish in the family Rajidae. Like all rays, the thornback ray has a flattened body with broad, wing-like pectoral fins. The body is kite-shaped with a long, thorny tail. The back is covered in numerous thorny spines, as is the underside in older females. Adult fish can grow to 1 metre (3.3 ft) in length (max length: 105 cm (male); 139 cm (female)), although most are less than 85 centimetres (33 in). Max. weight: 18 kg. This ray can weigh from 4.5 to 8.75 lb (2 to 4 kg). Their colours vary from light brown to grey with darker blotches and numerous small darker spots and yellow patches. Sometimes the yellow patches are surrounded by small dark spots. The underside is creamy-white with a greyish margin. When threatened they can appear black. In adult fish (particularly females), some of the spines are thickened with button-like bases (known as bucklers).<br/> Thornback rays have pectoral fins with clear angles on lateral side; triangular pelvic fins. 30-50 thorns form a median row from the nape to the first dorsal fin; additional large 'buckler' thorns with swollen bases scattered on upper surface of disc in adults. Large females also prickly throughout their ventral surface; young and large males prickly along the borders of their discs and the underside of their snout.<br/> The thornback ray is usually found on sedimentary seabeds such as mud, sand or gravel at depths between 10-60m. Juvenile fish feed on small crustaceans, particularly amphipods and bottom-living shrimps; adults feed on crabs, shrimps and small fish.<br/> Thornback rays lay eggs on shallow sand, mud, pebble or gravel bottoms. Up to 170 egg cases can be laid by a single female in a year, average fecundity around 48-74 eggs. Egg cases are oblong capsules with stiff pointed horns at the corners, each containing one embryo. Capsules are 5.0-9.0 cm long without the horns and 3.4-6.8 cm wide. Egg cases are anchored with an adhesive film. Embryos feed solely on yolk. Egg cases hatch after about 4-5 months and pups are about 11-13 cm."
        },
        {
            "id": 5,
            "class": "Cartilaginous fishes",
            "name": "Common stingray",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F1.jpg?alt=media&token=77c74f5d-6646-454c-b873-fee0c4d3d0ad",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F2.jpg?alt=media&token=c3eeefc4-1475-4ff2-af58-68e88c7e3a05",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F3.jpg?alt=media&token=0305c341-8e80-4f0e-97d4-13eaeb773387",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F4.jpg?alt=media&token=3d419535-449f-41b2-b07f-327046769fb5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F5.jpg?alt=media&token=65899e97-0494-49d2-b760-59668f14de3a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F6.jpg?alt=media&token=76e4a7d9-3728-4208-b39e-46825132f149",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_stingray_skate%2F7.jpg?alt=media&token=ff6d0eb3-d042-43f2-9c3f-9bfb06f23149"
            ],
            "video": "https://www.youtube.com/embed/D8opAWwOCJE?si=tG4Nk7uG5Z8Wcviw",
            "text": "The common stingray (Dasyatis pastinaca) is a cartilaginous fish, a species of stingray in the family Dasyatidae. It typically inhabits sandy or muddy habitats in coastal waters shallower than 60 m (200 ft), often burying itself in sediment. The common stingray has a diamond-shaped pectoral fin disc slightly wider than long, and a whip-like tail with upper and lower fin folds. The common stingray has been reported to reach a width of 1.4 m (4.6 ft) and a length of 2.5 m (8.2 ft), though a width of 45 cm (18 in) is more typical. It can be identified by its plain coloration and mostly smooth skin, except for a row of tubercles along the midline of the back in the largest individuals. The leading margins of the disc are almost straight and converge on a pointed, slightly protruding snout; the trailing margins of the disc are convex. The eyes are smaller than the spiracles (paired respiratory openings), which are placed closely behind. There are 28-38 upper tooth rows and 28-43 lower tooth rows; the teeth are small and blunt, and arranged into flattened surfaces. This species is a solid gray, brown, reddish, or olive-green above, and whitish below with dark fin margins. Young rays may have white spots. A stinging spine with strong serrations is equipped with a venom gland at its base, which is positioned about a third of the distance along the tail. A second or even third spine may also be present, as the spines are regularly replaced and new spines grow in before existing ones have been shed. So, the common stingray can inflict a painful, though rarely life-threatening.<br/> The predominant prey of the common stingray are bottom-dwelling crustaceans, though it also takes molluscs, polychaete worms, and small bony fishes. It is aplacental viviparous: the embryos are nourished by yolk and later histotroph ('uterine milk') produced by the mother. Females bear 4-9 young twice per year in shallow water, after a gestation period of four months. Birth usually occurs in summer. Newborns measure about 8 cm (3.1 in) across and 20 cm (7.9 in) long.<br/> The oldest known individual from the wild was ten years of age, but the species has lived up to 21 years in captivity."
        },
        {
            "id": 6,
            "class": "Ray-finned fishes",
            "name": "Black scorpionfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F1.jpg?alt=media&token=2f02ecb6-3bab-4d64-a10b-ebb1329ce2aa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F2.jpg?alt=media&token=d44244ce-cb9a-41fe-b183-1c3c61f4833b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F3.jpg?alt=media&token=79f92e1d-c4f6-4a14-9736-e993a9ea5ce2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F4.jpg?alt=media&token=26bb096d-1fe4-4be0-a814-b8d1f10071ac",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F5.jpg?alt=media&token=8aaf2832-a001-44e3-9dd0-2e3d9072fe08",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F6.jpg?alt=media&token=f02d6450-9c20-4393-af16-feb61424b156",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_scorpionfish_scorpena%2F7.jpg?alt=media&token=f2f3ab85-3c67-4f76-bc86-ffa1cc1f4dc5"
            ],
            "video": "https://www.youtube.com/embed/2ykZRyIlbAA?si=YnqVGilkWvA5hUSt",
            "text": "The black scorpionfish (Scorpaena porcus), also known as the European scorpionfish or small-scaled scorpionfish, is a venomous scorpionfish. The black scorpionfish has a maximum length of about 40 cm (15 in) but a more normal adult length is around 15 cm (6 in). Max. weight: 870 g. The head is broad with a short snout and upwardly angled mouth. Its eyes are large and its mouth is wide, oblique, and terminal, with small, fine teeth. There is a short tentacle just above the eye and various other shorter tentacles, spines and flaps of skin decorating the head. Unlike other species, it does not have a skin flap on its lower jaw. The dorsal fin has twelve spines and nine soft rays and the anal fin has two spines and six soft rays. The pectoral fins are large and oval and have sixteen to eighteen rays. As a defence mechanism it has poisonous needles located on the dorsal, anal, ventral fins and on the operculum. The colour of this fish is generally brownish and there is a dark pigmented spot between the eighth and ninth dorsal spines. The fins are mottled with brown and the caudal fin has three vertical brown stripes. It is a master of mimicry and can camouflage itself so well that it becomes practically invisible to escape its predators and surprise its pray, lying in wait on the bottom. It is basically active at nightfall.<br/> The black scorpionfish is found throughout the Black Sea down to depths of about 800 m (2,625 ft). It is a benthic species and is usually found resting among seaweed and on rocks. It is usually solitary and sedentary, and it feeds on small fishes such as blennies and gobies, crustaceans and other bottom-dwelling invertebrates.<br/> Its reproduction is oviparous. The female lays her eggs and encloses them in a transparent, mucous mass between July and August."
        },
        {
            "id": 7,
            "class": "Ray-finned fishes",
            "name": "Tub gurnard",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F1.jpg?alt=media&token=a82f02d3-e5a2-4cc8-bb9c-b088ab48baf7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F2.jpg?alt=media&token=cc30b3e8-57e4-4a54-a145-3682d67ec95f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F3.jpg?alt=media&token=39947e77-995f-4c1e-93a8-dd43fbc543a4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F4.jpg?alt=media&token=77be16a7-a6fc-46f5-b9a0-3753f355b788",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F5.jpg?alt=media&token=07b8e9d2-82fa-4565-a6e2-c81d56a6ece6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F6.jpg?alt=media&token=b5b66a55-6e6f-4856-aab7-738e669191f7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F7.jpg?alt=media&token=7709dd7a-cd37-4a39-baa1-bc486d195da6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F8.jpg?alt=media&token=6915452b-64ec-432f-bfe3-45526e178ab6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tub_gurnard_petuh%2F9.jpg?alt=media&token=0b14fcde-13ec-45b3-a96d-34f1b87ea25a"
            ],
            "video": "https://www.youtube.com/embed/DLyuKj0SUSU?si=Hi2FyzngoKCO5TlJ",
            "text": "The tub gurnard (Chelidonichthys lucerna), also known as the sapphirine gurnard, tube-fish, tubfish or yellow gurnard, is a species of marine ray-finned fish belonging to the Triglidae family, the gurnards and sea robins.<br/> The tub gurnard has a large, bony, triangular shaped head which bears many ridges and spines but which does not have an occipital groove. There are two spiny lobes on the tip of the snout and the eyes are relatively small. The large mouth is set low on the head and the jaws and vomer are covered by densely set rows of teeth. There are two dorsal fins, the first contains 8 to 10 spines and the second 16 or 17 soft rays. The anal fin has between 14 and 16 soft rays. The cleithral spine is short and is located over the pectoral fin and extends just to the first quarter of the pectoral fin. The pectoral fins, typically for gurnards are large with the innermost three rays free from the membrane, thickened and finger-like, used for locomotion and to detect prey. There are no scales present on the breast and front section of the belly, the body has small, well embedded scales while the scales on the lateral line are small and tubular. The caudal fin is slightly emarginate. This species reaches a maximum total length of 75.1 cm (29.6 in), the largest species in the family Triglidae, although 30 cm (12 in) is more typical. The heaviest published specimen weighed 6 kg (13 lb). The overall colour is deep reddish brown to pinkish red, with a pinkish lower body. The blue pectoral fins are spotted green in the centres and red on the margins.<br/> This species is found on sand, mud-sand or gravel substrates at depths between 20 and 300 m (66 and 984 ft). During the summer the tub gurnard may spend more time closer to the surface in water as shallow as 10 m (33 ft) and the juveniles can be found in brackish water in lagoons and estuaries.<br/> The tub gurnard is an opportunistic predatory species which feeds on benthic prey, particularly crustaceans and smaller fishes. Crustaceans were a more important part of the diet in the summer and fishes gained importance during the winter. They are also known to take molluscs and polychaetes. Prey hiding in the substrate may be detected using the sensory organs on the long separate rays of the pectoral fins.<br/> The tub gurnard spawns between May and July in the northern parts of its range. The eggs are pelagic and in the larvae and post larvae all of the pectoral fin rays are contained within the fin membrane.<br/> Tub gurnards make grunting or growling sounds, using the muscles associated with the swim bladder, these sounds are thought to be used to keep the schools together."
        },
        {
            "id": 8,
            "class": "Malacostracans",
            "name": "European lobster",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F1.jpg?alt=media&token=4bf0bd1e-3834-416c-881e-862432295980",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F2.jpg?alt=media&token=eb7cd5d5-5d3c-4178-a256-cf6e2476ef54",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F3.jpg?alt=media&token=82ec51b4-445c-4186-9d1b-c6532f4180d4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F4.jpg?alt=media&token=7a6ed18f-e721-4497-b351-0a63763ab562",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F5.jpeg?alt=media&token=417a8c89-ab65-4d65-8890-9d2b4a273df1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F6.jpg?alt=media&token=2dfd4737-e0a6-43b5-947c-def6b4cece4e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F7.jpg?alt=media&token=9f6b4343-bf48-4578-92a5-7abe41142dd9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_lobster_omar_evropejskij%2F8.jpg?alt=media&token=b87a1da7-935c-4ac0-9cd2-3eba0d38283e"
            ],
            "video": "https://www.youtube.com/embed/8Y5Nov7_LO0?si=aYYcd6kPfQoM35Za",
            "text": "The european lobster or common lobster (Homarus gammarus) is a species of clawed lobster in the family Nephropidae. It may grow to a length of 60 cm (24 in) and a mass of 6 kilograms (13 lb). The common length is usually 23-38 cm (9-15 in) and the common weight is 0.7-2.2 kg (1.5-4.9 lb). Like other crustaceans, lobsters have a hard exoskeleton which they must shed in order to grow, in a process called ecdysis (molting). This may occur several times a year for young lobsters, but decreases to once every 1-2 years for larger animals. The first pair of pereiopods is armed with a large, asymmetrical pair of claws. The larger one is the 'crusher', and has rounded nodules used for crushing prey; the other is the 'cutter', which has sharp inner edges, and is used for holding or tearing the prey. Usually, the left claw is the crusher, and the right is the cutter. The exoskeleton is generally blue above, with spots that coalesce, and yellow below. The spines on the claws are white or white-tipped. The underside of the claw is creamy white or very pale red.<br/> The female carries the eggs attached to her pleopods for up to 12 months, depending on the temperature. The eggs hatch at night, and the larvae swim to the water surface where they drift with the ocean currents, preying on zooplankton. This stage involves three moults and lasts for 15-35 days. After the third moult, the juvenile takes on a form closer to the adult, and adopts a benthic lifestyle. Juveniles usually dig extensive burrows. It is estimated that only 1 larva in every 20,000 survives to the benthic phase. When they reach a carapace length of 15 mm (0.59 in), the juveniles leave their burrows and start their adult lives.<br/> Adult european lobsters live on the continental shelf at depths of 0-150 metres (0-492 ft), although usually not deeper than 50 m (160 ft). They prefer hard substrates, such as rocks or hard mud, and live in holes or crevices, emerging at night to feed. The diet of european lobsters mostly consists of other benthic invertebrates. These include crabs, molluscs and polychaete worms. In the Black Sea, lobsters are rare: only near the coasts of Turkey and Bulgaria."
        },
        {
            "id": 9,
            "class": "Ray-finned fishes",
            "name": "So-iuy mullet",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F1.jpg?alt=media&token=5606e5fa-089b-4f85-83f0-a243d96267b6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F2.jpg?alt=media&token=5bf8d15c-a8fe-4a74-b1ff-8bfb4b724fd9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F3.jpg?alt=media&token=a2406661-78df-4b9f-a741-77e7a0c23e23",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F4.jpg?alt=media&token=29449ab0-78c7-4172-a54c-49b0d5f0765b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/so-iuy_mullet_pelengas%2F5.jpg?alt=media&token=8957906d-99c0-4679-b4a3-8ab1a23e37f7"
            ],
            "video": "https://www.youtube.com/embed/LO7VZEorZz4?si=edpOGSjWzcmeB3lj",
            "text": "The so-iuy mullet (Planiliza haematocheilus) is a species of fish in the mullet family (Mugilidae). Common length: 80-85 cm. Max. length: 150 cm. Common weight of adult fish: 6-8 kg. Max. weight: 12 kg. Body rather elongate. Head depressed, hyomandibular region bulging. Upper lip with an outer row of very small, close-set unicuspid teeth and 1 or 2 irregular, inner rows of smaller, ciliiform teeth. Lower lip directed forwards with 1 row of fine ciliiform teeth present or absent. Adipose eyefold moderately developed, covering up the irises. The irises have a reddish or orange tint, distinguishing the so-iuy mullet from other mullets. Origin of first dorsal fin midway between tip of snout and base of caudal fin, or just closer to latter; anal fin with 3 spines and 9 soft rays; caudal fin emarginate. Body dark greenish dorsally, brownish over head, white ventrally; first dorsal fin greyish; second dorsal fin yellowish grey, with dusky margin; anal fin also with dusky margin; caudal fin bluish with black margin; pectoral fins yellowish.<br/> The so-iuy mullet live in flocks at a depth of 2-4 meters. It feeds mainly on periphyton, detritus, and various small benthic invertebrates. It also actively consumes dead fish."
        },
        {
            "id": 10,
            "class": "Ray-finned fishes",
            "name": "Flathead grey mullet",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F1.jpg?alt=media&token=ce9f78d2-f379-4f6c-b728-c19de261cf06",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F2.jpg?alt=media&token=90813bfc-f341-45cd-af2a-c5a71fcbd9d1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F3.jpg?alt=media&token=76d79ed4-1005-486d-b0e0-3a54ec6ba14d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F4.jpg?alt=media&token=3cb3fe90-3d8e-46a2-b1ca-581bbe3d7afe",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F5.jpg?alt=media&token=89fc9f52-cd50-4041-80f6-fc56256304de",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F6.jpg?alt=media&token=413a1c04-a629-4421-aff6-3c37849e8718",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F7.jpg?alt=media&token=beb16a27-6973-48f0-8982-025b2435abcf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flathead_grey_mullet_kefal%2F8.jpg?alt=media&token=3d78a2cd-7b76-443f-8f9e-ad6607c2951a"
            ],
            "video": "https://www.youtube.com/embed/ZdE8srd8UVI?si=mv3G-psvt5KZY8qM",
            "text": "The flathead grey mullet (Mugil cephalus) is a species of fish in the mullet family (Mugilidae). It is known with numerous English names, including the flathead mullet, black mullet, bully mullet, common mullet, grey mullet, sea mullet, among others.<br/> The back of the fish is olive-green, sides are silvery and shade to white towards the belly. These fish have horizontal spots that give the illusion of horizontal stripes that run across its body. They have thin lips and a broad head. Their adipose eyelids are well developed. The mullet has no lateral line. A common length is about 50 centimetres (20 in), and its maximum length is 100 centimetres (39 in). It can reach a maximum weight of eight kilograms (18 lb). Female flathead grey mullet are slightly bigger than the male as they mature. The oldest fish of this species lived up to 16 years old.<br/> The flathead grey mullet lives in depths ranging between 0-120 metres (0-394 ft) and with temperatures between 8-24 °C (46-75 °F). This fish species like to gather in schools when feeding on aquatic vegetation along the bottom of the water. Juvenile flathead grey mullet consume zooplankton, but as they age, they begin to eat invertebrates such as crustaceans and worms. They also like to feed on dead plants and detritus. The species is euryhaline, meaning that the fish can acclimate to different levels of salinity."
        },
        {
            "id": 11,
            "class": "Malacostracans",
            "name": "Yellow round crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F1.jpg?alt=media&token=55901ab4-d1e1-47c2-982b-67016fea5c4c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F2.jpg?alt=media&token=c06498c3-7365-4688-a4bf-67af03446eaf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F3.jpg?alt=media&token=359d327a-b5a8-4059-97c8-cbeef692d5ba",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F4.jpg?alt=media&token=c200f149-6fd9-451e-891f-7e652c04ea64",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F5.jpg?alt=media&token=1e24478a-e582-4a9c-8e90-bd838d63b837",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F6.jpg?alt=media&token=98709047-fcbc-4528-b6ad-d68087a0b8b2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/yellow_round_crab_kamennyj%2F7.jpg?alt=media&token=999184dc-395f-4577-89cd-f664e88c3306"
            ],
            "video": "https://www.youtube.com/embed/F372BBSZaRM?si=tzPM7NqstOgFxw8u",
            "text": "The yellow round crab (Eriphia verrucosa), sometimes called the warty crab, belonging to the family of crabs (Eriphiidae). It has decreased in numbers in the Black Sea since the 1980s and is now listed in the Ukrainian Red Data Book of endangered species.<br/> Yellow round crab usually may reach a width of 9 centimetres (3.5 in) and a length of 7 cm (2.8 in). Max. size: 10x8 cm. The carapace is thick and smooth, ranging in colour from brownish-red to brownish-green, with yellow spots; its front margin is armed with seven 'teeth' on either side, and five or six between the eyes. The claws are strong and have black fingers; one claw is generally larger than the other and is armed with rounded tubercles while the smaller claw bears sharper projections, arranged in lines. In the springtime, Yellow round crab migrates to shallow water, less than 1 metre (3 ft 3 in) deep, and reproduction begins in May or June; the species is highly fecund. There are four larval stages, from zoea to megalopa.<br/> The yellow round crab lives among stones and seaweeds in shallow water along rocky coastlines up to a depth of 15 metres (49 ft). It is reported to feed on bivalves, gastropods and hermit crabs, or on molluscs and polychaetes. In the Black Sea yellow round crab is the only native species capable of breaking into the shells of the invasive snail Rapana venosa, although it is unlikely that it will present an effective biological control of the invader. The species is threatened by eutrophication and pollution."
        },
        {
            "id": 12,
            "class": "Malacostracans",
            "name": "Marbled rock crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/marbled_rock_crab_mramornyj%2F1.jpg?alt=media&token=55144354-74fe-4c14-9f5f-caadd52292c5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/marbled_rock_crab_mramornyj%2F2.jpg?alt=media&token=eead5d60-3590-401a-87e6-cc465d8f2635",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/marbled_rock_crab_mramornyj%2F3.jpg?alt=media&token=cc4b9c18-2989-4ec7-a9f8-3801eb82a2b6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/marbled_rock_crab_mramornyj%2F4.jpg?alt=media&token=e64d9489-1786-4af4-af8e-f62002e70eea"
            ],
            "video": "https://www.youtube.com/embed/YHNizPG2jBo?si=aiJD3OHyN0-onsOK",
            "text": "The marbled rock crab or marbled crab (Pachygrapsus marmoratus) is a species of Grapsidae family. It has a square carapace 22-36 millimetres (0.87-1.42 in) long, which is dark violet brown with marbling in yellowish brown. It can be distinguished from related species of Pachygrapsus by the presence of three teeth on each side of the carapace. The carapace is almost square and slightly broader than long, with distinct diagonal ridges visible. The chelipeds are large and slightly unequal in size. The male chelipeds are more robust than those of the female. The closest segment to the carapace (merus) on the walking legs are prominent, and the last segment (dactyl) has small spines. The marbled rock crab is capable of very rapid movements, and it uses this ability to dart into crevices, making it difficult to catch.<br/> The marbled rock crab is a semiterrestrial omnivore, but is not an opportunist. It consumes similar proportions of algae and animals however abundant they are in the habitat. The favoured animals in the diet of marbled rock crab are mussels, limpets, barnacles and its own species.<br/> The larvae of marbled rock crab are planktonic and may survive for up to 31 days. This results in high levels of gene flow between populations, and allows the species to rapidly colonise new areas."
        },
        {
            "id": 13,
            "class": "Malacostracans",
            "name": "Mediterranean green crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_green_crab_travianoj%2F1.jpg?alt=media&token=54fa4c0d-d2d5-48cb-bc89-fd71cb9508ff",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_green_crab_travianoj%2F2.jpg?alt=media&token=8e81fff3-384d-42cb-81ed-a0df526f11b0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_green_crab_travianoj%2F3.jpg?alt=media&token=1da0d704-7d5a-44ab-b61a-88a4a1010336",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_green_crab_travianoj%2F4.jpg?alt=media&token=039d0a83-f2e0-4ad3-88ba-c76d5f19c079",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_green_crab_travianoj%2F5.jpg?alt=media&token=a386ca42-2e15-435f-8f11-c289b32ac281"
            ],
            "video": "https://www.youtube.com/embed/rs5cI_IHZ9c?si=6OLPHA8H1Pnz7zuE",
            "text": "The mediterranean green crab (Carcinus aestuarii or Carcinus maenas) is a littoral crab in the Carcinidae family. Males were generally bigger than females. The average values of the carapace width for males and females are 45 ± 7 mm and 29 ± 7 mm, respectively. Max. length: 7 cm. Common weight: 7-14 g. Max. land speed: 1 m/s. The carapace is quite convex. The edge of carapace is toothed. Five spines on each side of carapace, with three rounded lobes between eyes. Top often mottled brown to dark green, yellow flecks. Underneath green, orange, or red.<br/> The mediterranean green crab is a generalist species that shows a great tolerance to environmental changes and can subsist on a large spectrum of food items. It is an omnivorous predator of small bivalves with soft shells, small crustaceans, annelids as well as being a scavenger of dead aquatic animals. Algae is also part of the diet. Eating habits can change throughout its lifespan and seasonally in relation with available food in its habitat. Thrives on a variety of substrates, from soft mud and sand to rocks and aquatic vegetation. Reproduces well in a wide range of temperatures and salinities. It is active at night and burrows into sand and silt during the day."
        },
        {
            "id": 14,
            "class": "Malacostracans",
            "name": "Flying crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F1.jpg?alt=media&token=cf620b6a-5a8e-419c-b463-579674348db0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F2.jpg?alt=media&token=91200848-3028-438a-a120-e9372f8eb049",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F3.jpg?alt=media&token=1e538b53-f73e-43bd-8bcc-2d1b25054cfd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F4.jpg?alt=media&token=1d76cd58-56b8-4d24-aa06-bf50ffa1697f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F5.jpg?alt=media&token=756512f9-0703-4737-8b51-ef8dd6480f78",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F6.jpg?alt=media&token=c9c069b8-91a9-48f4-92cf-2f85de0f1aae",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/flying_crab_plaunez%2F7.jpg?alt=media&token=774ca181-7474-4d6e-90e9-94a50ecfd91e"
            ],
            "video": "https://www.youtube.com/embed/c7s57axaAYg?si=USxBBeYXwRjxNNxZ",
            "text": "The flying crab or swimming crab (Liocarcinus holsatus or Macropipus holsatus) is a species of swimming crab (Portunidae family). It has a carapace reaching a lengt of 30 mm and a width of 38 mm. The identifying features of the flying crab are: lacking in transverse crenulations on carapace; three similar sized lobes on frontal margin, central one sometimes shortest; chelipeds equal, slender, with a sharp tooth on the outer edge of the carpus. It is very light build and actually a good swimmer. The body is more or less smooth, without bristles. Brownish grey, tinged with green is a common color. Young individuals seem to often have light blotches.<br/> It can be found on any depths from the tidal zone to almost 300 meters. Found in rock pools, in the shallow sublittoral and offshore, on sand, gravel, mixed and hard substrata. The diet of flying crab comprises crustaceans, especially juvenile crangon and shrimps, molluscs such as Spisula elliptica, little fishes, worms, algae and zoobenthos. The flying crab often becomes overgrown with algae and invertebrates, which in turn cause itching. Sometimes it hosts the parasitic barnacle Sacculina."
        },
        {
            "id": 15,
            "class": "Malacostracans",
            "name": "Sandy swimming crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F1.jpg?alt=media&token=a90bc747-d502-43bf-a13b-57d527ea9fba",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F2.jpg?alt=media&token=ab2bee06-7c26-44b5-aa95-8f031c77202f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F3.jpg?alt=media&token=39ca18c1-e2b6-4f8c-a642-7863f1fc52ed",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F4.jpg?alt=media&token=0ed87a3f-8824-4bba-aef8-e52d854b2699",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F5.jpg?alt=media&token=df3a435a-514f-4ce9-a054-57e86caebf5b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F6.jpg?alt=media&token=dfaa503c-a008-40a3-ab90-cbc69eecd01f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F7.jpg?alt=media&token=49d28af6-caf0-43f1-9362-b6046ffa9b43",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F8.jpg?alt=media&token=3e77e561-9628-4441-a539-eb90b37876da",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F9.jpg?alt=media&token=e06e75c9-6c7e-4c3f-b08d-cf5c8fa31cd1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sandy_swimming_crab_peschanyj_plavunez%2F10.jpg?alt=media&token=2da56b59-412b-46f5-8e64-f7e1632d028d"
            ],
            "video": "https://www.youtube.com/embed/2naszByyw2s?si=V98XwQDYFrGLfNya",
            "text": "The sandy swimming crab or harbour crab (Liocarcinus depurator or Macropipus depurator)  is a species of crab in the family Polybiidae. It grows up to 51 millimetres (2.0 in) in width and 44 mm (1.6 in) long, and can be distinguished from other crab by the curved rows of white spots on its carapace. The carapace is relatively flat. The antero-lateral margins of the carapace have 5 pointed teeth. Front of carapace with a median lobe slightly more prominent than two similar flanking lobes. This crab has wide orbits and three similar-sized rounded lobes between eyes. The chelipeds are equal and stout. Also it can be recognised by the violet-tinted paddle of the fifth leg in larger crabs. The rest of the body is pale reddish-brown with transverse rows of hairs on the carapace, most conspicuous towards the rear.<br/> The sandy swimming crab found on the lower shore and sublittoral on clean/muddy sand and muddy gravel. Depth range: up to 300 metres. This crabs may exploit a wide range of dietary items including algae, sponges and many small invertebrates and may be considered omnivorous. However, Liocarcinus depurator is typically a scavenger and a carnivore. Reproductive frequency: once a year (100,000-1,000,000 eggs each). Age at maturity: 1 year. The moult takes place between May and July."
        },
        {
            "id": 16,
            "class": "Malacostracans",
            "name": "Jaguar round crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F1.jpg?alt=media&token=570b15f9-6d4b-4d4a-ab70-eb22b5236571",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F2.jpg?alt=media&token=7c1d6939-0f08-472c-aa97-7b68ddd120d4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F3.jpg?alt=media&token=d84992db-845d-447b-94c8-0a4c984a04f9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F4.jpg?alt=media&token=a42de6c3-88cb-4b60-9f78-364c37a62c7b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F5.jpg?alt=media&token=c565c873-9ab0-4505-95f1-f8fdcf67f75a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F6.jpg?alt=media&token=7f1b959e-a477-4eb5-84d2-8df85359d6d1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F7.jpg?alt=media&token=33d1a9b4-fe82-470e-a1a7-d0a541b7ddb7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/jaguar_round_crab_vodolub%2F8.jpg?alt=media&token=cc2ed628-dd61-4cad-88e0-31427c1f374c"
            ],
            "video": "https://www.youtube.com/embed/P6nlPgvNOac?si=c-C-ABWee3-21QxG",
            "text": "The jaguar round crab (Xantho poressa) is a species of crab (Xanthidae family). The juveniles are cryptically coloured with a variable carapace colour, which can be yellowish, reddish, brown, or dark grey with patches of another colour, usually white. The pereiopods are usually banded with dark brown or black bands alternating with white or translucent stripes or spots, although the fifth pereiopod is brighter and often unmarked. The adults are uniformly dark grey in colour and they leave the seagrass beds for more open, rocky substrates. Length: up to 4 cm (1.57 in). Food: Algae, Diatoms, Herbivorous.<br/> The larvae of jaguar round crab go through four zoeal and one megalopal stages, which are typical of most of the related species of crabs in the subfamily Xanthinae. The duration of each zoeal stage is 2-4 days and the megalopa stage lasts an average of 10 days, with the first juvenile crab stage being reached after 23 days. Juveniles live in algae until their last moult, when they migrate to the nearest rocky substrate. In the Black Sea jaguar round crab is common near the shoreline at depths less than 1 m; it is mainly found stones on substrates of pebble and crushed rock; it is rare on the other substrates and may occur down to 15 m in depth."
        },
        {
            "id": 17,
            "class": "Malacostracans",
            "name": "Bristly crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F1.jpg?alt=media&token=37f83e4c-b835-4b98-8e52-bdf4d230d6ea",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F2.jpg?alt=media&token=a7250c45-5205-4869-af59-e259a36a6b3e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F3.jpg?alt=media&token=6b96f643-af68-44d4-a21e-abd3382ca699",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F4.jpg?alt=media&token=793e17c0-3cc8-427e-854f-ca2e911e8055",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F5.jpg?alt=media&token=e892a7d2-eef6-48c4-be16-71e9f99326ad",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F6.jpg?alt=media&token=7e01dda8-cb03-430b-9b19-d66a1b2d36ae",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bristly_crab_volosatyj%2F7.jpg?alt=media&token=0ff0f28a-6cec-42de-8594-4b10a232d5bb"
            ],
            "video": "https://www.youtube.com/embed/cgaRUv5OqsA?si=fLzIjn9be4Lj0g-4",
            "text": "The bristly crab or hairy crab (Pilumnus hirtellus) is a species of European crab (Pilumnidaefamily). It is a small crab, with a carapace up to 28 millimetres (1.1 in) wide and 20 millimetres (0.79 in) long. The carapace and legs are reddish brown or purple, with the inner surfaces of the legs orange or paler. Both the carapace and the walking legs have a dense covering of setae. The first pair of legs bear large chelae (claws), of which one, usually the right claw, is larger than the other, and the fingers of both claws are brown. The claws are smaller and less hairy in females. Young crabs are less than 5 millimetres (0.20 in) in size, and are chalky white all over. The front edge of the carapace has five teeth on either side, with the first two being smaller than the others.<br/> The bristly crab lives at depths of up to 80 metres (260 ft), preferring areas shallower than 10 metres (33 ft). It can be found on various substrates, including muddy, sandy and rocky bottoms, under stones and even among the holdfasts of seaweeds. In the Black Sea, this species prefers stony areas with abundant algae and mussels. The diet consists mainly of carrion. Between April and August females may carry up to 4000 eggs. These are released between May and September, as planktonic zoea larvae, which develop into megalopa larvae before maturing into the adult form."
        },
        {
            "id": 18,
            "class": "Malacostracans",
            "name": "Arch-fronted swimming crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F1.jpg?alt=media&token=e9934081-5799-4ab2-bc2c-6bcb661b8195",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F2.jpg?alt=media&token=cab18182-28fb-4340-a151-40f8b7a6e0fb",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F3.jpg?alt=media&token=24b5d905-d153-4acc-87fc-064ee695c3d9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F4.jpeg?alt=media&token=41ca52ec-ce51-43bd-ba32-ee079bf525dd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F5.jpg?alt=media&token=e6b79a3c-d8a1-4dd3-a071-2c83c5f19296",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F6.jpg?alt=media&token=175713da-f9fc-4ba7-82a1-883e5e2d1f24",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/arch-fronted_swimming_crab_arkovyj%2F7.jpeg?alt=media&token=7d040953-a031-4a4d-a469-2d47f54da517"
            ],
            "video": "https://www.youtube.com/embed/8PkavF_zCMA?si=TfSNj32LyWtsY8Za",
            "text": "The arch-fronted swimming crab (Liocarcinus navigator or Liocarcinus arcuatus or Macropipus arcuatus) is a species of crab in the family Portunidae. It has a dark brown carapace with lighter pereiopods. This is a small crab, the brown carapace does not exceed a length of 30 mm and width of 33 mm. The frontal margin of the carapace, between the eyes, has a fringe of hair but no spines. It has five sharp teeth posterior to the eyes on each side. This teeth are very unequal: the 3rd and 5th are larger than the others. The carapace is gently convex with minute transverse ridges. The dactyls of the 5th walking legs are sharply pointed and fringed with hairs on both sides.<br/> The Arch-fronted swimming crab found on mixed sandy substrata from the shallow sublittoral to offshore among seagrass and algae. Depth range: 2 - 108 m. Most frequent found at a depth of 5-10 m. They feed on algae, zoobenthos and detritus."
        },
        {
            "id": 19,
            "class": "Malacostracans",
            "name": "Mediterranean rock crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F1.jpg?alt=media&token=62b39f5c-480b-40d8-98e2-d8a7d733dc08",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F2.jpg?alt=media&token=8514563e-d054-49fa-87d3-17b003810709",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F3.jpg?alt=media&token=82936241-4aec-4efb-a78b-bf9e12d64001",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F4.jpg?alt=media&token=f7a26004-ef30-47d9-a625-e5d74182290a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F5.jpg?alt=media&token=b1d7d6ec-31af-41c3-8990-194e11b9d386",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F6.jpg?alt=media&token=cc2140fb-e88a-4d7c-b9fe-ca1fe08b664c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rock_crab_shestizubyj%2F7.jpg?alt=media&token=7e80fa01-515d-4d0f-9865-852eb4424fe0"
            ],
            "video": "https://www.youtube.com/embed/bLpA7P523wE?si=fHCs58vYFxxt6n_d",
            "text": "The mediterranean rock crab (Brachynotus sexdentatus) is a species of crab in the family Varunidae. It is a small crab, reaching a maximum carapace width of 20 millimetres (0.79 in) and length of 17 millimetres (0.67 in). Typically width is 10 mm (0.39 in) or even less. The front of the carapace has two lobes and three lateral teeth on each side, each ending in a sharp point. The whole animal is olive green, with speckling in black, with the legs slightly paler or greyer. The claws are of similar side on either side of the body, but are much larger in males than in females.<br/> The mediterranean rock crab lives in shallow water on muddy bottoms, at depths of up to 90 metres (300 ft). The eggs of this crab are 0.25-0.30 mm (0.010-0.012 in) in diameter, and dark brown in colour. They are produced between February and October. After hatching, the larvae pass through five zoeal stages (instars that use appendages of the thorax for movement). This process takes at least 12 days at a temperature of 23 °C (73 °F), during which time the larvae grow from around 1.35 millimetres (0.053 in) from the tip of the rostrum to the tip of the dorsal spine, to 3.35 mm (0.132 in) long (1.17 mm or 0.046 in carapace length). After a further five days, the larva moults into the megalopa phase (instar that uses the appendages of the abdomen for movement), and after five more days, moults into the first crab-like phase, at a carapace length of around 1.55 mm (0.061 in)."
        },
        {
            "id": 20,
            "class": "Malacostracans",
            "name": "Zuiderzee crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zuiderzee_crab_gollandskij%2F1.jpg?alt=media&token=7192f06b-fa1c-46fa-9f6e-629315ade28d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zuiderzee_crab_gollandskij%2F2.jpg?alt=media&token=2a57939f-1b49-41ee-a648-fefcbfa99bc1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zuiderzee_crab_gollandskij%2F3.jpg?alt=media&token=3d0e34df-cebc-43e6-ad88-ce3dc28cdeff",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zuiderzee_crab_gollandskij%2F4.jpg?alt=media&token=063b4dec-b704-43eb-9214-8eee0bd3c6b7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zuiderzee_crab_gollandskij%2F5.jpg?alt=media&token=0fd117df-4a0f-4c70-974b-6a4d5443e7a6"
            ],
            "video": "https://www.youtube.com/embed/GIqMLRm-_Ck?si=VpZz10bFPMWRC368",
            "text": "The zuiderzee crab or dwarf crab or Harris mud crab (Rhithropanopeus harrisii tridentata) is a small omnivorous crab in the family Panopeidae. The crab can reach a maximum size of 23 millimetres (0.9 in). The frontal edge of the carapace is almost straight. There are four teeth on the anterolateral margin. The eye orbit is surrounded by small, blunt teeth. The movable finger of the claw is strongly curved. There are blunt teeth on the inner surface of the claws. It has an olive-green-brownish color, sometimes with dark spots on its carapace.<br/> The zuiderzee crab likes to live on stones and in oyster beds. It feeds on detritus and dead fish. Due to low mobility, the carapace is overgrown with balanuses and hydroids."
        },
        {
            "id": 21,
            "class": "Malacostracans",
            "name": "Small hermit crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F1.jpg?alt=media&token=41e51a17-ecf5-4d6c-aa97-55c1da5159c1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F2.jpg?alt=media&token=62a58f53-4314-4f33-808c-40c5cfac8fc2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F3.jpg?alt=media&token=0e5d5cb5-be14-48e5-a379-19ec53b7dfd3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F4.jpg?alt=media&token=14dd36eb-0533-47d7-b0ad-1bdfae41d92e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F5.webp?alt=media&token=69124e53-0eb9-400c-ae6c-42fab76c2dbb",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F6.jpg?alt=media&token=d23b9710-9695-4b1f-867c-90bb4bdea206",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F7.jpg?alt=media&token=63e9e27e-8e00-46f4-aac3-af4f8cf64d02",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F8.jpg?alt=media&token=0f7c5f26-86a5-4763-b997-67e25e267f27",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F9.jpeg?alt=media&token=f5e34447-2b9b-4364-9442-57c0c2cbdcc5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/small_hermit_crab_diogen%2F10.jpg?alt=media&token=7f324561-c75f-443b-afed-850471403daa"
            ],
            "video": "https://www.youtube.com/embed/mM2tCm9mKV8?si=I1dyRg-ReyGbxqWS",
            "text": "The small hermit crab or south-claw hermit crab (Diogenes pugilator) is a species of hermit crab in the family Diogenidae. It conceals its soft abdomen inside an empty gastropod mollusc shell; the abdomen is twisted to fit the contours of the shell. The carapace protects the anterior part of the crab and can be up to 11 mm (0.43 in) long; it is squarish in shape, has triangular projections along the front edge, and is clad with hairs on the front two corners. The eyes are on stalks which are about half as long as the width of the carapace. The left chela (claw) is very much larger than the right one, and both claws are covered with short hairs. The chelae and other legs can be contracted into the entrance of the shell.<br/> The small hermit crab is found on soft substrates from the shallow sub-tidal to a depths of 1,800 m (5,906 ft), but is most common in shallow water (up to 42 m from the shore). It tends to occupy shells of the netted dog whelk Tritia reticulata. These crabs are often present on flattish beaches composed of medium to fine grained sand where the waves sweep up the shore. When exposed, they rapidly bury themselves in the sand, using the enlarged left chela to stabilise themselves in the wet sand and limit the extent to which they are rolled about by the waves. It feeds on dead animals and plant debris. It may be used as food by the predatory Sandy swimming crab (Liocarcinus depurator)."
        },
        {
            "id": 22,
            "class": "Malacostracans",
            "name": "Mediterranean rocky shore hermit crab",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F1.jpg?alt=media&token=463486c9-a096-4eb9-aed7-461b0f8fa330",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F2.jpg?alt=media&token=eada1f93-b041-4cf2-b3c0-1ba94bc5d789",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F3.jpg?alt=media&token=820109eb-6292-4bbc-94e7-102084c5ea55",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F4.jpg?alt=media&token=48eb8409-3308-4a44-bbd7-91c50c026574",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F5.jpg?alt=media&token=a2b4f368-42bd-49e5-aed5-b627231b7716",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F6.jpg?alt=media&token=20d5ac7f-b973-4d94-80a7-f0a128e5c5ba",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F7.jpg?alt=media&token=fbeec708-c73a-407e-b228-f281002e4f71",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_rocky_shore_hermit_crab_klibanarij%2F8.jpg?alt=media&token=09d984dd-2d71-4a07-9c51-949271a978b4"
            ],
            "video": "https://www.youtube.com/embed/sKrqrPjIyGw?si=_72DLZezSgexH455",
            "text": "The mediterranean rocky shore hermit crab or mediterranean intertidal hermit crab (Clibanarius erythropus) is a species of hermit crab in the family Diogenidae. Individuals may grow up to a carapace length of 15 millimetres (0.6 in). Identifying features: rostrum small, acute, and slightly protruding; chelae with thick fingers bearing thick horny, black tips and covered by wide, blunt tubercles and hair; eyes extend slightly beyond antennal peduncles. A variety of different gastropod shells are used by this hermit crab, the most frequent being Littorina striata, Mitra, Nassarius incrassatus, Stramonita haemastoma, Cerithium, Alvania montagui and Pisania maculosa.<br/> The mediterranean rocky shore hermit crabs live in intertidal pools and on sand, gravel and algae in the shallow sublittoral to 40 m. They select substrates where they can cover large distances, and that globose shells allow them greater mobility than elongate ones. Like other hermit crabs, this crab feeds on organic debris, decayed and fresh macro-algae with associated fauna and epiphytic algal flora, small invertebrates, and macroscopic pieces of dead and live animal tissues."
        },
        {
            "id": 23,
            "class": "Malacostracans",
            "name": "Common prawn",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F1.jpg?alt=media&token=ba797352-2c11-4eea-901e-344d069b0fbf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F2.jpg?alt=media&token=8ca91a62-154d-4dd2-b434-af5683be4566",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F3.jpg?alt=media&token=579a4ac2-3177-4466-9d79-29b517645a0d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F4.jpg?alt=media&token=c6dc6004-43f3-43d9-8181-7a05f1e7e235",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F5.webp?alt=media&token=dc7aa2a1-7db3-453e-816e-92bf3a182978",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F6.jpg?alt=media&token=5793eec6-ba03-4fdb-a62a-bdf2b02f3add",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F7.jpg?alt=media&token=87914df5-3e8b-4b4b-94ef-27c11d70db10",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F8.jpg?alt=media&token=988f987a-22ca-4497-9f1d-44aa452f56b2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_prawn_pilchataya_krevetka%2F9.jpg?alt=media&token=3112b956-43c4-4c3b-bf62-13c1908ef438"
            ],
            "video": "https://www.youtube.com/embed/znuZfpylGhU?si=Jiy2kaD44_zn1Qkx",
            "text": "The common prawn (Palaemon serratus) is a species of shrimp in the family Palaemonidae. It may be distinguished from other species of shrimp by the rostrum, which curves upwards, is bifurcated at the tip and has 6-7 along its upper edge, and 4-5 teeth on the lower edge. It is pinkish brown, with reddish patterns, and is typically 100 millimetres (3.9 in) long. Max. length: 11 cm (4.3 in).<br/> Individuals live for 3-5 years in groups in rocky crevices at depths of up to 40 metres (130 ft). Females grow faster than males, and the population is highly seasonal, with a pronounced peak in the autumn. They are preyed upon by a variety of fish, including species of Mullidae, Mugilidae, Moronidae and Batrachoididae. The common prawn can sometimes be found with a prominent bulge in its carapace over its gills. This is caused by the presence of an isopod parasite, such as Bopyrus squillarum."
        },
        {
            "id": 24,
            "class": "Malacostracans",
            "name": "Rockpool shrimp",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F1.jpg?alt=media&token=d9b3f4e4-8997-4b52-beaa-080e0f446914",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F2.jpg?alt=media&token=93ba1d00-fe7d-4761-977c-c67f1205f402",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F3.jpg?alt=media&token=c736a3ab-9743-4ed5-b104-b038157c92ce",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F4.jpg?alt=media&token=820b3ffb-dc8b-456f-8baa-087746b29814",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F5.jpg?alt=media&token=9ec317c6-4a23-42fe-ac05-b3dc7938c716",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F6.jpg?alt=media&token=25602ff9-802e-4682-a05c-d0c3fda6ff31",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F7.jpg?alt=media&token=f107b613-afb1-46c4-aa80-d296585a98d5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rockpool_shrimp_kamennaya_krevetka%2F8.jpg?alt=media&token=a24b7a3c-5bc2-4553-a6f2-c9e025ae2719"
            ],
            "video": "https://www.youtube.com/embed/Jc7l8woIRmI?si=2u8cFdvGjw8TS8A4",
            "text": "The rockpool shrimp (Palaemon elegans) is a species of shrimp of the family Palaemonidae. The maximum length is 63 mm. Its rostrum is strongly expanded ventrally, straight or very slightly upwardly curved with seven to nine dorsal teeth and with two to four (most often three) ventral teeth. The tip of the rostrum is often bifid. Three or rarely two dorsal teeth are placed behind the posterior edge of the orbit. Ventral side of the rostrum with a single row of setae. Sixth abdominal segment with a protuberance just above the posterolateral marginal spine. Carapace and abdomen usually with a black colour transverse striped pattern. Legs with yellow and blue bands. However, the colouration may differ depending on the habitat - in turbid waters the pattern is likely to fade away almost completely.<br/> This euryhaline marine species inhabits vegetated areas and is widely distributed in coastal waters. It occurs in shallow littoral zone, on muddy or sandy bottom where it is primarily associated with vegated areas, such as Zostera meadows or stony and rocky places overgrown with algae. The species forms communities with other palaemonid shrimp species living in the same habitat types. It is omnivorous, feeding predominantly on algae, small crustaceans and foraminiferans. They are preyed upon by a variety of fish, including species of Mullidae, Mugilidae, Moronidae and Batrachoididae."
        },
        {
            "id": 25,
            "class": "Malacostracans",
            "name": "Baltic prawn",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F1.jpg?alt=media&token=6aa067bf-ebe2-41d6-847e-aea85e2c198a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F2.jpg?alt=media&token=8c5dd768-c0ee-49f3-b113-b2e8375fe02b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F3.jpg?alt=media&token=15726c79-ab2c-4be0-888a-22f1e76bcd36",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F4.jpg?alt=media&token=c7ea8e16-348d-400e-b8ad-c79232cc6595",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F5.jpg?alt=media&token=9637783c-d81d-4ff2-902e-c23844795648",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F6.jpg?alt=media&token=5f1b4bf4-dc04-418b-9a7e-1ecd5d7b6468",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F7.jpg?alt=media&token=cd46bdde-434c-4aeb-85c7-88f051687166",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/baltic_prawn_travianaya_krevetka%2F8.jpg?alt=media&token=a023de98-de0b-4b5c-9acf-5a9af26661d6"
            ],
            "video": "https://www.youtube.com/embed/nO3cF5g9IQs?si=4iy6gB8f92AMqdoj",
            "text": "The baltic prawn (Palaemon adspersus) is a species of shrimp in the family Palaemonidae. Females tend to be larger than males, reaching 60-80 mm length vs. 60-62 mm for males. It has a distinct, well-developed rostrum, with 5-7 dorsal teeth (one dorsal tooth lying posteriorly to the orbit), and usually three (sometimes two or four) ventral teeth. The rostrum has a weak ventral expansion. The carapace bears antennal and branchiostegal spines. The antennules are triramous. The shorter ramus of the outer antennule exceeds the length of its peduncle and is fused for about 1/3 of its length to the longer flagellum. Both legs of the first pair are chelate (with claws). The palp of the mandible has three segments. The overall color is yellowish-gray, but the ventral side of the rostrum is marked with dark red spots. The long flagella and the peduncle of the antennules are also red.<br/> The baltic prawn inhabits shallow sandy areas in algal and eelgrass beds, often in brackish water. It is closely associated with Zostera (eelgrass) beds. They may migrate into deeper water in winter, because of a reduced ability to regulate body fluids at low temperatures. They fed on benthic crustaceans, mollusks and green algae. They are preyed upon by a variety of fish, including species of Mullidae, Mugilidae, Moronidae and Batrachoididae. Lifespan is estimated at about 2.5-3 years."
        },
        {
            "id": 26,
            "class": "Malacostracans",
            "name": "Common shrimp",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_shrimp_k.obyknovennaya%2F1.jpg?alt=media&token=a6137c50-7689-4738-a7e9-2ce6a27c62a8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_shrimp_k.obyknovennaya%2F2.jpg?alt=media&token=8affb196-c3b0-4145-b180-c5339377d111",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_shrimp_k.obyknovennaya%2F3.jpg?alt=media&token=2d58ae79-4daf-43e4-bfc7-b18557445841",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_shrimp_k.obyknovennaya%2F4.jpg?alt=media&token=0e3fcc3d-0ab4-4558-985f-8979c606053f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_shrimp_k.obyknovennaya%2F5.jpg?alt=media&token=4416c34a-c5a3-4f00-a34c-b960deb41df1"
            ],
            "video": "https://www.youtube.com/embed/ByMi5azWKIM?si=HXXWHooeUuXMDinH",
            "text": "The common shrimp or brown shrimp (Crangon crangon) is a species of caridean shrimp in the family Crangonidae. Adults are typically 30-50 mm (1.2-2.0 in) long, although individuals up to 90 mm (3.5 in) have been recorded. The carapace is almost smooth, without longitudinal rows of teeth and is armed with only three spines - one dorsal and two lateral, located at the same level. The rostrum is short, only slightly longer than the scales that limit the orbit below; rounded at the end; with a groove on top. The animals have cryptic colouration, being a sandy brown colour, which can be changed to match the environment.<br/> The common shrimp lives in shallow water, which can also be slightly brackish, and feed nocturnally. During the day, they remain buried in the sand to escape predatory birds and fish, with only their antennae protruding. The young hatch from their eggs into planktonic larvae. These pass through five moults before reaching the postlarval stage, when they settle to the sea-floor. Relatively immobile micro- and meiobenthic animals form the primary food source for common shrimp. These include harpacticoids, spat, and veligers of bivalve mollusks, small nematodes and amphipods (or their offspring), juvenile gastropods and polychaetes, or very small species, as well as the corpses of some other small invertebrates."
        },
        {
            "id": 27,
            "class": "Malacostracans",
            "name": "Bloody-red mysid",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F1.jpg?alt=media&token=164d0e8b-f52a-4e03-af8d-87105089ae9f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F2.jpg?alt=media&token=7d05bfe2-a5cd-42a5-9824-b7ca81e90833",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F3.jpg?alt=media&token=e12ff9fd-f051-46ad-ac95-8574638b4d65",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F4.jpg?alt=media&token=9973937f-37ea-4f3d-889d-90a01f8403c0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F5.jpg?alt=media&token=fc0ead88-f043-4141-af7f-425397f6ecec",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F6.jpg?alt=media&token=30dc2705-10ba-4f14-a72a-3cf156f52d11",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F7.jpg?alt=media&token=45091454-a79d-4ebb-b195-f2bd3d9320f0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F8.jpg?alt=media&token=ca2ecfe7-e3cb-46dd-ab22-9710c6d32dd2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bloody-red_mysid_mizida_anomalnaya%2F9.jpg?alt=media&token=48cd9e8a-0b5b-47bb-b0c2-e5abf21c7798"
            ],
            "video": "https://www.youtube.com/embed/-saD8U9N3C0?si=joPsbfYecOtF2H-4",
            "text": "The bloody-red mysid (Hemimysis anomala) is a shrimp-like crustacean in the Mysida order (Mysidae family). Mature individuals reach 6-13 millimetres (0.24-0.51 in) in length; females are slightly larger than males. The species can be ivory-yellow in colour or translucent, but exhibits pigmented red chromatophores in the carapace and telson. The intensity of colouration, believed to be associated with the species' crepuscular behaviour, varies with contraction or expansion of the chromatophores in response to light and temperature conditions; in shaded areas, individuals tend to have a deeper red colour. Juveniles are more translucent than adults. Preserved individuals lose their colour, becoming opaque. The bloody-red mysid is distinguishable from other mysid species by its truncated telson with a long spine at both corners.<br/> The bloody-red mysid favours hard bottom surfaces, including rocks and shells and avoids soft bottoms and areas of dense vegetation or high siltation. In its native range, the species is found in water depths ranging from 0.5 to 50 metres (1.6 to 164.0 ft), although they generally inhabit depths of 6-10 m (20-33 ft). It tolerates salinity concentrations of 0-19 ppt and prefers water temperatures of 9-20 °C (48-68 °F). Populations may survive temperatures of 0 °C (32 °F) over winter, but not without substantial mortality. The bloody-red mysid is an opportunistic omnivore that feeds primarily on zooplankton, particularly cladocerans, but also consumes detritus, phytoplankton (particularly green algae and diatoms), and insect larvae, and is occasionally cannibalistic. Younger individuals feed mainly on phytoplankton. The proportion of zooplankton consumed in the mysid's diet increases with its body size. A bloody-red mysid feeds using its thoracic limbs, either by capturing prey with its endopods or by removing food particles from its body that are filtered from incoming currents by its exopods."
        },
        {
            "id": 28,
            "class": "Ray-finned fishes",
            "name": "Sargo",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sargo_belyj_sarg%2F1.jpg?alt=media&token=d3d50545-88d1-4c9d-8122-29f84e3a87c7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sargo_belyj_sarg%2F2.jpg?alt=media&token=7cb90dd7-ef13-4504-90f3-3895042f8dae",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sargo_belyj_sarg%2F3.jpg?alt=media&token=90311cb7-e183-4d86-a98e-dcbd0bcd205d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sargo_belyj_sarg%2F4.jpg?alt=media&token=406446e6-45e1-4f8c-9f24-dfa07ffc811e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sargo_belyj_sarg%2F5.jpg?alt=media&token=df181616-df35-4def-b7ef-adda5a9b6c54"
            ],
            "video": "https://www.youtube.com/embed/ntiJcFFSX5E?si=E_EBN1jP3kPYbAoU",
            "text": "The sargo or white seabream (Diplodus sargus) is a species of seabream in the family Sparidae. Typical oval and flattened, as suits a bream, it reaches the 45 cm exceeding the kilo. But in the locations were it is regularly fished, it has not the time for growing and usually measures 25-30 cm, with a weight of 400-600 g. The mouth is of modest size, with 8 incisors on each jaw followed by three rows of molars above and two rows below. But in some cases, on a side, even the jaw has three rows of molars. The dorsal fin, one only, has 11-12 spiny rays and 12-15 soft; the anal 3 spiny and 13-14 soft; and the ventral ones do have only one spine with 5 soft rays. The pectoral are long and falciform, the caudal is forked. The sargo shows 7-8 vertical bands through its silvery body.<br/> The sargo likes the posidonias prairies and the rocky coasts, also because, when feeling in danger, it needs a den. Euryhaline species, it spends good part of the summer in the brackish waters of the lagoons, and goes back to the sea by early autumn, when it gets cold. It can reach the 50 m of depth, but it also found in one metre of water in the ports and along the piers which offer shelters. It may live 10 years. It nourishes of molluscs, limpets, bivalves or gastropods it finds among the seaweeds on the rocks, echinoderms and crustaceans."
        },
        {
            "id": 29,
            "class": "Ray-finned fishes",
            "name": "Annular seabream",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F1.webp?alt=media&token=ab6bc097-d3dd-4fe7-b926-3f8f2d721b56",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F2.jpg?alt=media&token=ca0fb627-abfc-4849-a7fe-5f5ee06d9596",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F3.webp?alt=media&token=6f58644c-9a69-4b92-819e-c92ad1335ba4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F4.jpg?alt=media&token=1ed2292f-612b-48d8-b6e4-12b0ebf96d7f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F5.jpg?alt=media&token=38019056-49ae-4c1b-85a8-03fe643cf980",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F6.jpg?alt=media&token=2f964d4d-d419-46e3-9748-e4c353eabeca",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/annular_seabream_laskir%2F7.jpg?alt=media&token=d7e78fc7-a96c-4404-b459-e2f6adb7b027"
            ],
            "video": "https://www.youtube.com/embed/SvmH1IYOBBM?si=LV-TPQe-Utqobhpt",
            "text": "The annular seabream (Diplodus annularis) is a species of seabream belonging to the family Sparidae. It can reach a length of about 28 centimetres (11 in), but usually it is approximately 13 cm long. The body is generally grey-silver and yellowish, with a dark band on the caudal peduncle. Max. published weight: 330.00 g. The mouth, relatively ample and protractile, has symmetrical jaws with 8 incisors followed by several rows of molars, for removing and chewing the small creatures living on the submerged rocks. The dorsal fin is unique, formed by 11 spiny rays and 12-13 soft; the anal, about half long, contents of 3 spiny rays and 12-13 unarmed; the small ventral ones have one spine and the pectoral are long and pointed. The tail is forked.<br/> The annular seabream inhabits rocky, sandy bottoms and seagrass beds. It lives along the coasts exploring the intertidal zone, but also swims in small schools or with other sparids in the grasslands of Posidonia. It almost never ventures down in deep waters. The old individuals might reach a depth of 90 m. In spring, it often visits the brackish waters of lagoons. It feeds on crustaceans, molluscs, small echinoderms and worms. The lifespan of an annular seabream is of 7 years. Max. reported age: 17 years."
        },
        {
            "id": 30,
            "class": "Ray-finned fishes",
            "name": "Long-snouted seahorse",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F1.jpg?alt=media&token=8d7ddac5-fdde-4939-bb9b-7c03da83d20e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F2.jpg?alt=media&token=ab2d633c-cba9-4308-aaeb-fe52acfc630a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F3.jpg?alt=media&token=726abb58-e8bb-4f06-b122-72a1ed150df9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F4.jpg?alt=media&token=90de82e6-0253-411c-af8f-dcf9d3f6f0c7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F5.jpg?alt=media&token=e0851845-d99f-412d-87df-ccb87bd1bf1c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F6.jpg?alt=media&token=4e29fa4b-0a21-4c18-bebf-2cfd96e71d10",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F7.webp?alt=media&token=241a005d-211c-4e3e-84dc-819eaae3b6de",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/long-snouted_seahorse_dlinnorylyj_koniok%2F8.webp?alt=media&token=edf22255-879a-440c-b509-e2aabdb5af92"
            ],
            "video": "https://www.youtube.com/embed/i4gSgJ-aUuw?si=YUoXe_IWxC4E4oWd",
            "text": "The long-snouted seahorse (Hippocampus guttulatus) is a marine fish belonging to the family Syngnathidae. It is a small-sized fish that can reach a maximum length of 21.5 cm (8.5 in), but the average size is more or less 12 cm (5 in). The body is slender, the snout is long and the tail is prehensile. Its head and dorsal ridge have often some more or less long and numerous dermal filaments which can be simple or bifid. Its color ranges from dark green to different variants of brown to yellow, and the body is often speckled with small white dots.<br/> The long-snouted seahorse likes shallow coastal waters from 1 to 20 m (3 to 66 ft) deep. It occurs close by Posidonia and eelgrass meadows or in mixed habitat with sandy bottom and rocks with algae. It has a carnivorous diet and feeds on small crustaceans, larvae, fish eggs and other planktonic organisms. It is ovoviviparous and it is the male who broods the eggs in its ventral brood pouch. An interesting aspect of seahorse coloration is the ability to rapidly transform color patterns to blend with their immediate surroundings. They swim upright and avoid predators by mimicking the colour of underwater plants."
        },
        {
            "id": 31,
            "class": "Ray-finned fishes",
            "name": "Greater pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F1.jpg?alt=media&token=67fcbf8f-27b2-43a9-b25d-4f05032d4ac6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F2.jpg?alt=media&token=94731b3d-f5bb-442a-a222-b95dbfbe67f5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F3.jpg?alt=media&token=3b575fa4-80ff-4ca4-be22-eb56de421691",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F4.jpg?alt=media&token=d19135e6-3803-465b-8247-6546152b6716",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F5.jpg?alt=media&token=8580efde-0e01-458e-87ba-756a043c1db6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F6.jpg?alt=media&token=72f6a505-7106-4a0e-9764-879d7845b47e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F7.jpg?alt=media&token=92367820-fd92-490e-98cf-bed495c6ac01",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F8.jpg?alt=media&token=56858bc9-9a07-4e00-9a6c-c801f4e9f252",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F9.jpg?alt=media&token=6e59970e-9de3-4251-b18b-c06dfdc8106a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F10.jpg?alt=media&token=79123034-1b30-4a18-ae84-f0faa9d2c0a1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_pipefish_obyknovennaya_mor._igla%2F11.jpg?alt=media&token=980be851-3aab-4158-9ccd-ce4dfff54659"
            ],
            "video": "https://www.youtube.com/embed/aNMFNx22cA8?si=_yAiz_M0FZv5tQ4_",
            "text": "The greater pipefish (Syngnathus acus) is a pipefish of the family Syngnathidae. The fish is generally 33 cm to 35 cm in length with a reported maximum length of 47 cm. The greater pipefish has a long segmented armoured body, angular in cross section. It is almost square in each segment of the body, and known to feel rigid when handled. Its customized by a long snout with mouth on end and a slight hump on the top of the body just behind the eyes. It ranges a color brown to green in with broad alternating light and dark hue along it. The greater pipefish has distinctive body rings which are a sandy brown with darker bars covering his body in between. The top third of the females belly is deep (when egg bound), twice the breadth of the lower two thirds below the vent. The male is the 'tailing' with the twin folds below the vent. The folds of the skin make the middle third and during the 'brooding' of the young they swell in size until the young are released from the pouch (at a size of 22 mm to 35 mm).<br/> These fishes are common on southerly and westerly coasts in a variety of habitats, often amongst seaweeds and seagrass. They feed on live mysids and small prawns. They are ovoviviparous and reproduce usually three times each year."
        },
        {
            "id": 32,
            "class": "Ray-finned fishes",
            "name": "Broadnosed pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F1.jpg?alt=media&token=4b0205c9-e77f-4ac8-a62a-48a881663afa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F2.jpg?alt=media&token=22811559-f66c-43b3-becf-c6f719e5ba53",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F3.jpg?alt=media&token=37181569-77ba-4baa-a59e-ce1cfb6eafe5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F4.jpg?alt=media&token=69e90800-9b84-4980-a982-0dcb786d2ec9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F5.jpg?alt=media&token=45ef0545-c6cc-4318-9d40-7a78e2fcf2f5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F6.jpg?alt=media&token=ee1a22ae-94cd-427d-83ed-dc54aec22950",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/broadnosed_pipefish_dlinnorylaya_igla%2F7.jpg?alt=media&token=54382d69-a2d8-4393-821a-f4abe2e868ae"
            ],
            "video": "https://www.youtube.com/embed/s2A_VysI1pA?si=T0-PIAgOseEtpyI8",
            "text": "The broadnosed pipefish or deepnosed pipefish (Syngnathus typhle) is a fish of the family Syngnathidae (seahorses and pipefishes). The broadnosed pipefish is a slender, elongated fish with a hexagonal cross-section. The body surface is covered by small bony plates. The head resembles that of a seahorse with a long, laterally flattened snout and obliquely sloping mouth. Unlike the straightnose pipefish, it has a fan-shaped caudal fin. The general colour is greenish, often with various darker mottling, and the belly is yellow. The average size is about 15 to 20 cm (6 to 8 in) with a maximum of 25 cm (10 in).<br/> The broadnosed pipefish is common in the coastal shallow waters, usually on reefs with seagrasses. It is found at depths to about 20 m (66 ft). It tends to rest in a vertical position among the fronds of seaweed and feeds on plankton such as copepods which it sucks in through its mouth. This fish breeds in the summer. The male has a brood pouch into which several females deposit clutches of about twenty eggs. The fry hatch after about four weeks and are expelled into the open water. Even after this the male continues to provide some parental care as the fry can retreat into the brood pouch in case of danger."
        },
        {
            "id": 33,
            "class": "Ray-finned fishes",
            "name": "Thickly snouted pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thickly_snouted_pipefish_tolstorylaya_igla%2F1.jpg?alt=media&token=ce6d219d-7758-40ed-a572-8e19d0dd322a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thickly_snouted_pipefish_tolstorylaya_igla%2F2.jpg?alt=media&token=671ce647-e18f-453b-999a-4dd6cf0d20c3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thickly_snouted_pipefish_tolstorylaya_igla%2F3.jpg?alt=media&token=ee6d0388-6c83-4f29-b67f-61c2e0e7491a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thickly_snouted_pipefish_tolstorylaya_igla%2F4.jpg?alt=media&token=1207fa00-b7a4-46fe-bd66-610e64a70dd9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/thickly_snouted_pipefish_tolstorylaya_igla%2F5.jpg?alt=media&token=0728f066-f83e-45ea-88c2-0297ed892e03"
            ],
            "video": "https://www.youtube.com/embed/1VigHx8YCjs?si=-bH7ItuLrgRv4G73",
            "text": "Thickly snouted pipefish (Syngnathus variegatus) is a fish of the family Syngnathidae (seahorses and pipefishes) which inhabits the Black Sea and Sea of Azov. Maximum length is 36 cm, weight 30 g. The body is very long, low, not laterally compressed, rough, with well-defined edges. There are dorsal, pectoral and anal fins. Both halves of the pectoral girdle are motionless, fused together below. The snout is relatively long, massive and high. Coloring is variable. The general background ranges from light brown, gray, almost marbled to reddish or dark brown. The belly is grayish or milky white. On the back and sides there are dark spots of irregular shape and dots, as well as transverse brown stripes, the alternation of which together with light intervals creates a striped color. The dorsal fin has three (sometimes more) oblique longitudinal grayish-brown stripes formed by dark dots and spots. The caudal fin usually has a transverse dark stripe.<br/> Thickly snouted pipefish is a marine, demersal, ovoviviparous fish. It lives among or near thickets of underwater vegetation, among rocks and piles of stones covered with algae, where it lives alone or in groups of 2-3 individuals at depths of more than 2.5 m (up to 15 m or more) in the bottom layers or in the water column. It feeds on invertebrates (crustaceans, insect larvae, etc.), as well as eggs and juvenile fish and small fish."
        },
        {
            "id": 34,
            "class": "Ray-finned fishes",
            "name": "Straightnosed pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F1.jpg?alt=media&token=f7e1a052-9ff8-4a1b-8be7-6ed45f19e627",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F2.jpg?alt=media&token=9949300e-c140-43e4-94cc-30978b904501",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F3.jpg?alt=media&token=14d1d879-6ca8-4a03-8121-ef4680be695e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F4.jpg?alt=media&token=3553af08-a177-4f06-a260-3b32a51669f5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F5.jpg?alt=media&token=81da9378-ce8a-4244-ba98-2e28f8c0d019",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F6.jpg?alt=media&token=b21fd11f-027d-4570-901c-dbe61736c200",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/straightnosed_pipefish_zmeevidnaya_igla%2F7.jpg?alt=media&token=d53c26a9-9278-4a5b-9ae7-82c40ded6e63"
            ],
            "video": "https://www.youtube.com/embed/52HMikhaYBg?si=bMKFXpWydLXCR6Ub",
            "text": "The straightnosed pipefish (Nerophis ophidion) is a fish of the family Syngnathidae (seahorses and pipefishes). The average size is about 15 to 20 cm (6 to 8 in) with a maximum of 30 cm (12 in). The straightnose pipefish initially gives the impression of being a worm. The head is tiny and resembles that of a seahorse, to which this fish is closely related. The body is round in cross-section and the fins are tiny. The only fish with which it might be confused is the broadnosed pipefish (Syngnathus typhle) but that is more robust and has a hexagonal cross-section. The general colour of the straightnosed pipefish is green with a yellowish belly. The female has pale blue markings on the head and body.<br/> The straightnosed pipefish inhabits sandy bottoms and is part of the fouling community, at depths from 2 to 15 m (6 ft 7 in to 49 ft 3 in). It lives among eelgrass and seaweed with its tail wrapped around the vegetation and its head elevated. It is well-camouflaged, and feeds on zooplankton and copepods by sucking them in."
        },
        {
            "id": 35,
            "class": "Ray-finned fishes",
            "name": "Narrow-snouted pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F1.jpg?alt=media&token=1d332aa3-1888-4d5f-b353-47be7924c154",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F2.jpg?alt=media&token=d237dfb5-b445-46c7-8d6b-ee8a47863265",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F3.jpg?alt=media&token=b678aacb-8c85-4aa2-b331-1933a083af59",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F4.jpg?alt=media&token=8c807f3f-d35b-4d0d-bd26-eb5701b665fc",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F5.jpg?alt=media&token=d1183179-c520-4a12-b7e7-8aee1e55cdc2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F6.jpg?alt=media&token=d4c2e997-19cc-48db-ae25-e17e4c575ccf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F7.jpg?alt=media&token=3ab8665c-bdfa-4d7e-b8c1-06ebdab64672",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F8.jpg?alt=media&token=7f7bc641-fe74-4204-adc9-2be23eb34e7d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F9.jpg?alt=media&token=540f4b9d-f702-46b3-8788-772dc770b7d0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/narrow-snouted_pipefish_tonkorylaya_igla%2F10.jpg?alt=media&token=2e1a33f4-ce94-4742-a391-4a81fa24f154"
            ],
            "video": "https://www.youtube.com/embed/7Um56evC0wQ?si=RAyKR2KloE-vc_qt",
            "text": "Narrow-snouted pipefish (Syngnathus tenuirostris) is a fish of the family Syngnathidae (seahorses and pipefishes). Maximum length 41 cm. Weight 35 g. The body is very long, low, not laterally compressed, rough, with well-defined edges. There are dorsal, pectoral and anal fins. Both halves of the pectoral girdle are motionless, fused together. The snout is long, thin, low, laterally compressed, mainly in its anterior third. The eyes are small, their diameter noticeably greater than the height of the snout. Coloring is variable. The general background is from light or dark gray, brown or red-brown to light brown, almost yellowish. On the body and tail there are quite wide, irregularly shaped, sometimes blurred, transverse stripes, which are light against a general dark background, and dark against a light background. The lower half of the gill covers is grayish, sometimes silvery. Dorsal fin with black or brownish spots along the rays. The pectoral and caudal fins are plain, painted as the general background. Caudal fin with light outer edge. The belly is gray or whitish.<br/> Narrow-snouted pipefish is a marine demersal fish with an ovoviviparous breeding pattern. It lives in coastal areas with clean, well-aerated water. It lives among or near thickets of underwater vegetation, among rocks and accumulations of stones covered with algae, usually in the bottom layers or in the water column. They live alone or in groups of 2-3 individuals, at depths of 3-15 m or more. They feed on plankton such as copepods which they suck in through their mouths."
        },
        {
            "id": 36,
            "class": "Ray-finned fishes",
            "name": "Black-striped pipefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F1.jpg?alt=media&token=54fd6f93-146d-4622-9223-f1876d91d7b4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F2.jpg?alt=media&token=de63347d-2466-48c4-96e3-8966c843c136",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F3.jpg?alt=media&token=28a043f3-37bf-4afa-88d1-bf3dd903b7df",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F4.jpg?alt=media&token=1e65d5d2-6367-4edd-b89b-d3e42ac7a79b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F5.jpg?alt=media&token=9935dc91-32b9-4182-b285-fb30f16437cf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F6.jpg?alt=media&token=c3ee86e6-beb7-4d9f-aa3f-02faa256fe0e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F7.jpg?alt=media&token=a69d86e0-586f-4372-ad05-88cb29c6a178",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F8.jpg?alt=media&token=8c40ff05-9c47-4100-9b79-c2f20cf92fb5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black-striped_pipefish_igla_puhloshiokaya%2F9.jpg?alt=media&token=ad6f5517-75e7-4d8e-94b9-a836035fd8c3"
            ],
            "video": "https://www.youtube.com/embed/fJ9bE-UglOk?si=RPDg6QUnY8pnLaeL",
            "text": "The black-striped pipefish (Syngnathus abaster) is a species of fish in the family Syngnathidae. Maximum length 23 cm. Their long, narrow bodies have an external skeleton made of bony plates, and their mouths are very small and pipe-shaped. These plates are a protective armour and serve as camouflage. Even though pipefish have these bony plates, their bodies are very flexible. They swim using a side to side wiggling motion that is similar to the movement of a snake or by undulation of their dorsal fin.<br/> The black-striped pipefish is a marine species living in shallow-water seagrass. It`s diet consists mostly of newborn fish and small crustaceans. As the pipefish does not chew its food, the prey needs to be small enough to fit in the mouth and be swallowed whole. The long pipe-like mouth of the pipefish is used as a sucking tool when it eats. The pipefish wraps its tail around sea grass, using it as an anchor. It patiently waits until its prey swims close, and then sucks it up, puffing out its cheeks in the process. The tube is dilated which creates a small, strong current in the water near the fish's mouth. The current is accompanied by a sucking noise, much like a small vacuum cleaner. This particular species of pipefish has no real defense against predators aside from camouflage and swimming away, making it an easy target."
        },
        {
            "id": 37,
            "class": "Ray-finned fishes",
            "name": "Atlantic stargazer",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F1.jpg?alt=media&token=bf2a8ac4-6278-4792-a985-0694213add0c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F2.jpg?alt=media&token=650cfffa-158c-4277-86f6-e8a946be1c77",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F3.jpg?alt=media&token=27fe46b6-af7e-4b67-816b-bb2da5e86ff1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F4.jpg?alt=media&token=36de62fd-72a7-4d91-bbeb-5d3fc0563cc6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F5.jpg?alt=media&token=27f6939b-f2b2-4d84-a8c3-43f90c555502",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F6.jpg?alt=media&token=e5072f4a-4f8b-4586-813a-56aa7b64f445",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F7.jpg?alt=media&token=599fbf17-3029-4615-bd62-70de6e0e32cd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F8.jpg?alt=media&token=0964ba74-2c0f-4dea-b7b4-1203c92145d8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F9.jpg?alt=media&token=f9149f6e-2ce5-4c9c-952a-76dd7588a7e6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_stargazer_evropejskij_zvezdochet%2F10.jpg?alt=media&token=4fa30eae-7d8e-44a2-b8fc-9f907cd5b4d9"
            ],
            "video": "https://www.youtube.com/embed/t-F5XB9jH44?si=y3rzD7hk09MP-bqr",
            "text": "The atlantic stargazer (Uranoscopus scaber) is a marine fish of family Uranoscopidae. Typical of stargazers, its body is somewhat dorso-ventrally flattened, lacks a swimbladder, and has been found as large as 35 centimeters in length, but is usually between 20 and 30 cm. Females are larger in size than males. Its head and jaws are rotated upward, and has very large eyes and mouth. Its body is brown in color and can have numerous small light spots, with a lighter belly. Its body is suited for living on the sea floor, and is one of few fish capable of bioelectrogenesis, or the ability to generate an electric charge. It produces pulse-type electric organ discharges while feeding and when it is disturbed. This electric organ derives from sonic muscles.<br/> The atlantic stargazer is a demersal fish, which lives in sandy or muddy sand sediments along the upper slope of the continental shelf, between depths of 14-400 meters. Like other stargazers, it is an ambush predator which lies buried under sand with only its eyes showing. It has a large mouth, with a small strip of skin protruding from its lower jaw, which it moves in and out rapidly to act as a lure for prey. When a prey item comes near, the fish lunges toward the prey using a specially adapted vertebral column to generate the force by bending 60°, which takes less than 30 milliseconds to engulf the prey. It feeds primarily on fish larvae and smaller fishes, such as gobies, picarels, and small crustaceans, but has also been known to eat molluscs, echinoderms, annelids, algae and plant material.<br/> They can spawn between April and September, depending on the region, and produce pelagic eggs, about 2 millimeters in diameter. After hatching, the larvae, post-larvae, and juveniles remain pelagic."
        },
        {
            "id": 38,
            "class": "Ray-finned fishes",
            "name": "Shore rockling",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shore_rockling_sredizemnomorskij_trehusyj_nalim%2F1.jpg?alt=media&token=a85f4241-1fc8-4883-9dea-00b191db21bf",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shore_rockling_sredizemnomorskij_trehusyj_nalim%2F2.jpg?alt=media&token=bbd900f4-9223-4e65-a8d5-df1af5a400e0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shore_rockling_sredizemnomorskij_trehusyj_nalim%2F3.jpg?alt=media&token=02b437f3-84fb-4685-b27a-8ceeaba14980",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shore_rockling_sredizemnomorskij_trehusyj_nalim%2F4.jpg?alt=media&token=fd57524a-569a-4aeb-a508-ee624721ca0b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shore_rockling_sredizemnomorskij_trehusyj_nalim%2F5.jpg?alt=media&token=d2c644c4-5288-4258-a2b3-1441be0da218"
            ],
            "video": "https://www.youtube.com/embed/vh6Tff9fsyY?si=K-z_usUw2WtB1U6r",
            "text": "The shore rockling (Gaidropsarus mediterraneus) is a marine fish of family Lotidae. It is small elongated and slender fish with smooth, scaleless skin. Average body length is 25-28 cm. Average weight is 150-200 g. The maximum recorded length is 50 cm. Weight reaches 450 g. Lifespan is about 5-6 years. This eel-like fish has three barbels on its head (one barbel on the lower jaw and one above each nostril), with the second dorsal fin and the anal fin running the length of most of its body. These fins may be viewed moving in a continuous wave motion. First dorsal-fin ray followed by a few small fleshy filament. The corners of the mouth barely extend past the eyes. Colour varies, brown sometimes reddish and with a vermiculated or mottled pattern dorsally. Paler ventrally.<br/> The shore rockling lives generally at shallow depths near the shores on rocky bottom with aquatic vegetation to 60 m depth. Max. depth: 450 m. Feeds on fish, crustaceans, worms and algae."
        },
        {
            "id": 39,
            "class": "Ray-finned fishes",
            "name": "European hake",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_hake_merluza%2F1.jpg?alt=media&token=0601b1ba-f1d5-43e7-83b3-73d4f76be96e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_hake_merluza%2F2.jpg?alt=media&token=a93b632b-5f40-407b-aac0-c6b53fc59062",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_hake_merluza%2F3.jpg?alt=media&token=ab079d60-e28b-4a72-9106-79fdc9a9971c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_hake_merluza%2F4.jpg?alt=media&token=e6dbc87a-184c-4fa6-82e7-10f2aa67ee77",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_hake_merluza%2F5.jpg?alt=media&token=5d57593b-43eb-482d-9289-9cf68e210d1b"
            ],
            "video": "https://www.youtube.com/embed/gstyJ99tHro?si=QblszI9IyW3yrjfJ",
            "text": "The european hake (Merluccius merluccius) is a merluccid hake of the family Merlucciidae. It is a slim-bodied fish with a large head and large jaws on which are set a number of large curved teeth, the lower jaw has two rows of teeth and the upper jaw has one row. The inside of the mouth and the branchial cavity are black. The body is at its widest just behind its head. It has two dorsal fins; the first is triangular in shape, high with a short base, while the second is long, nearly the same length as the anal fin, and both the second dorsal fin and the anal fin have a slightly convex profile. The first dorsal fin has a single spine and 7 to 10 fin rays; the second dorsal fin has 36 to 40 fin rays and the anal fin has 36 to 40 fin rays. The tips of the pectoral fins extend to the level of the origin of the anal fin in young fish which are less than 20 cm (7.9 in) in standard length but does not do so in adults. The caudal fin is well-developed and has a truncate margin. The lateral line is straight and darker than the background colour. It is blue-grey on the back, silvery on the flanks and whitish on the underside. They grow to 180 cm (71 in) but this is rare and a more common larger size is 100 cm (39 in).<br/> The european hake is normally found at depths of between 70 m (230 ft) and 370 m (1,210 ft), although it may also occur within a wider range of depths, being found from inshore waters as shallow as 30 m (98 ft) down to 1,000 m (3,300 ft). During the day it stays close to the bottom and at night it becomes more active and uses more of the water column. Individual hake may be seen foraging alone near the seabed but higher in the water column they tend to feed in shoals. Small european hake up to 16 cm (6.3 in) long, those less than a year old, feed mostly on crustaceans such as krill, mysids and amphipods. It is at this stage of their lives that they prefer deeper water. As they grow and become more piscivorous they migrate to shallower areas where they start to feed on fish (such as european pilchard, Black Sea sprat, european anchovy, atlantic mackerel, atlantic horse mackerel). Hake with total lengths of between 16 cm (6.3 in) and 35.9 cm (14.1 in) have diets dominated by european pilchard and european anchovy. With a length of 36 cm (14 in) the fish shifts to an entirely piscivorous diet and the favoured prey changes to fish of the family Sparidae. Decapods were also used. They can also be cannibalistic. The rate of cannibalism recorded increased with increasing size with the larger fish having a diet consisting of up to 71% smaller conspecifics."
        },
        {
            "id": 40,
            "class": "Ray-finned fishes",
            "name": "Picarel",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F1.jpg?alt=media&token=b1f02e7e-44ad-4ae4-85d3-73a3c0db7a88",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F2.jpg?alt=media&token=79bab95f-441f-43c4-82fa-0f99e42d5746",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F3.jpg?alt=media&token=cce5bc65-c783-47ac-a4d0-f6348ab7aab7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F4.jpg?alt=media&token=283b2377-382d-4a51-82d8-4a5e289e5f83",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F5.jpeg?alt=media&token=6709c7cf-67f6-46c3-b78d-c70f0e751970",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F6.jpg?alt=media&token=a0a15dc7-c256-438f-8a47-86b4d492e71d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F7.jpg?alt=media&token=0360bcf8-270b-4068-ba4e-08e3352a1ae0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/picarel_obyknovennaya_smarida%2F8.jpeg?alt=media&token=39a8ab4f-a4ed-4626-9a82-cb0bb3a27990"
            ],
            "video": "https://www.youtube.com/embed/M3K5yNkywLQ?si=F1RJfrstoVWe4o_5",
            "text": "The picarel (Spicara smaris) is a species of ray-finned fish of the family Sparidae. It grows to a maximum length of 20 cm (8 in) but a more common size is 15 cm (6 in). It is a more slender fish than the closely related blotched picarel (Spicara maena) and can be distinguished from that species by having 75-81 scales along the lateral line rather than 68-70. Its back is grey-brown and it has silvery flanks with a large black spot located above the tip of the pectoral fin. Male fish are usually larger than females and have small blue spots scattered across the dorsal and anal fins.<br/> The picarel is usually found in seagrass meadows and over sandy and muddy seabeds. Its depth range is generally 15 to 170 m (49 to 558 ft). It is a sociable fish, forming large groups with others of its species. The diet is based on small coastal benthic invertebrates (crustaceans, mollusks, polychaetes)."
        },
        {
            "id": 41,
            "class": "Ray-finned fishes",
            "name": "Blotched picarel",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F1.jpg?alt=media&token=d34cfdcb-6db8-4c6c-b63f-ad0739a4f4e7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F2.jpg?alt=media&token=492856d4-12b7-48cc-bf35-0a0ca7926284",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F3.jpg?alt=media&token=c79e8366-cfd8-4233-a1ce-28f7a582e52b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F4.jpg?alt=media&token=a1fb010d-9ffa-494f-8c60-aa3d89b0b933",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F5.jpg?alt=media&token=15a019f3-7f3e-4a89-aac1-4b5a1c6d6072",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F6.jpg?alt=media&token=581a009f-c6e0-4f10-9ae7-9a0c8f3974ec",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F7.jpg?alt=media&token=d4f2ddac-dbb8-4526-ad2b-62fcea2b17e5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F8.jpg?alt=media&token=32dbbd43-c108-4a0f-8e5d-ab8cf58e119c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blotched_picarel_sredizemnomorskaya_smarida%2F9.jpg?alt=media&token=83a15e2f-8851-4adc-99c0-f42b73c0bb63"
            ],
            "video": "https://www.youtube.com/embed/8_AcaHfhdZs?si=ZdQOAvEDxBfPf_WV",
            "text": "The blotched picarel (Spicara maena) is a species of ray-finned fish of the family Sparidae. It is a fairly deep-bodied fish, with males reaching a maximum length of about 25 cm (10 in) and females 21 cm (8 in). The upper jaw is protrusible and the mouth contains several rows of small teeth. The single dorsal fin has eleven spines and twelve soft rays and the anal fin has three spines and nine or ten soft rays. There are sixty-eight to seventy scales on the lateral line. This fish is blue-grey above with silvery sides and a scattering of small dark spots. There is usually one large dark blotch above the tip of the pectoral fin.<br/> The depth range of blotched picarel is about 30 to 90 m (98 to 295 ft). It lives near the seabed over sandy and muddy bottoms and in seagrass meadows. Spicara maena is a gregarious fish that moves in schools and feeds on small benthic invertebrates and zooplankton."
        },
        {
            "id": 42,
            "class": "Ray-finned fishes",
            "name": "Damselfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/damselfish_lastochka%2F1.jpg?alt=media&token=1a06bb58-7bbf-418a-918a-7c9552c923a3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/damselfish_lastochka%2F2.jpg?alt=media&token=ba841f89-e095-4ae8-83f0-4878af628bad",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/damselfish_lastochka%2F3.jpg?alt=media&token=33de6505-107e-4405-b080-faced89def4b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/damselfish_lastochka%2F4.jpg?alt=media&token=011b9f06-348f-4349-9d50-e80b05946f46",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/damselfish_lastochka%2F5.jpg?alt=media&token=0faa9223-0a13-4077-a173-8c4e2ca71732"
            ],
            "video": "https://www.youtube.com/embed/SfJbwUzPFCM?si=4LFZ7LlApP5Fk6x2",
            "text": "The damselfish (Chromis chromis) is a small species of ray-finned fish of the family Pomacentridae. It can grow up to a size of 25 centimetres (9.8 in) in length, with a common length of 13 centimetres (5.1 in). It has an oval and laterally compressed body with an noticeably large eye. Its mouth is strongly protractile, reaching to below the centre of the eye, with small canine-like teeth set in 3 rows on the jaws. The preoperculum is not serrated and the anterior gill arch has 30 slender gill rakers. There are 13-14 spines and 10-11 soft rays in the dorsal fin and in the anal fin has 11 spines and 10-12 soft rays. Its body is covered in large scales, including the head, and there are 24-30 scales along the lateral line. The youngest fish are a brilliant iridescent blue in colour; older juveniles have blue stripes with the dorsal and anal fins outlined in blue while the adults are dark brown with the centres of each scale a paler golden brown or grey-brown and with the edge of the caudal fin lacking any colour, especially in the centre of the fork. The males become a vivid pale violet. There is a single pair of nostrils.<br/> The damselfish inhabits littoral, mainly in rocky areas from 2 to 40 metres (6.6 to 131.2 ft) in depth, in small shoals in midwater above or near rocky reefs and above sea-grass meadows. It feeds on small zooplankton and benthic algae. Its main food components are copepods, appendicularia, cladocera, gastropod larvae, bivalve larvae, fish eggs and fish larvae."
        },
        {
            "id": 43,
            "class": "Ray-finned fishes",
            "name": "Shi drum",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shi_drum_svetlaya_umbrina%2F1.webp?alt=media&token=db0aacde-4aa8-418e-b4e7-1e09fcdaea2d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shi_drum_svetlaya_umbrina%2F2.webp?alt=media&token=11db9213-bb97-4d3b-a897-227cf44bee04",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shi_drum_svetlaya_umbrina%2F3.webp?alt=media&token=0b5bce59-4f92-4c87-83cb-9ed2c5defbea",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shi_drum_svetlaya_umbrina%2F4.webp?alt=media&token=9577610b-1f8c-42e1-87b4-8d39fed30736",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/shi_drum_svetlaya_umbrina%2F5.jpg?alt=media&token=9f796af2-492c-45ee-a63c-ddcddb08498e"
            ],
            "video": "https://www.youtube.com/embed/O0AAfRcx518?si=CTDwwDsFRmJ_mkCn",
            "text": "The shi drum or gurbell (Umbrina cirrosa) is a species of marine fish of the family Sciaenidae. The maximum length recorded is 73 cm total length, although the average is 40 cm. It has a moderately elongated body which is deep and laterally compressed. Its small mouth has an inferior setting and contains villiform teeth while on its chin there is a short and rigid barbel which is perforated by a pore at its tip. Its scales are mainly ctenoid in form except for those on the breast, snout and sub-orbital region, where they are predominantly cycloid. It is greyish-silver to brownish in colour, with a metallic sheen and is marked with longitudinal dark lines on the dorsal regions; the membranes on hind margin of gill cover are jet black in colour while the fins are dusky.<br/> Shi drum is a demersal species which is found in inshore waters, over both rock and sandy sea beds. The prey taken by this species includes sardines, anchovies, mackerels, molluscs and worms, but the main prey are benthic invertebrates."
        },
        {
            "id": 44,
            "class": "Ray-finned fishes",
            "name": "Brown meagre",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F1.jpg?alt=media&token=9f636d68-ddf6-4009-85be-a4419c778018",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F2.jpg?alt=media&token=36db31a3-6ce1-4009-a8d2-32bd2b089c1d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F3.jpg?alt=media&token=3a1b42b9-2d4c-4ed8-b757-b4906c3a35d9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F4.jpg?alt=media&token=b9ec89ad-6893-412d-b6ad-6269e3dde380",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F5.jpg?alt=media&token=db441c21-dac0-4773-a14c-67768ca987c8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F6.webp?alt=media&token=e6678d6b-1cff-4720-a7c9-13240bf05ad5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F7.jpg?alt=media&token=519108f5-4367-4cec-826d-0b8a1dfe6a51",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F8.jpg?alt=media&token=35961440-8a52-47bb-a089-53c256d62521",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/brown_meagre_gorbyl_tiomnyj%2F9.jpg?alt=media&token=af287bfc-a208-4293-930c-c5be4c41a7d0"
            ],
            "video": "https://www.youtube.com/embed/jI702xLq-Ww?si=pATZEriSUWV5186g",
            "text": "The brown meagre or corb (Sciaena umbra) is a species of marine ray-finned fish belonging to the family Sciaenidae, the drums and croakers. It is between 30 and 40 cm in length but can grow to 60 cm. It has a flat belly and its strongly arched back which give it an easily recognisable shape, the body is laterally compressed and the large, horizontal mouth reaches the level of the eye and contains villiform teeth. The anal and pelvic fins are black with an anterior white border. Both dorsal fins and the truncate caudal fin, are yellow with a black border. The body is grey with flashes of gold and silver. The scales are ctenoid on the nape and the body while the head scales are cycloid.<br/> The brown meagre is found at depths between 5m and 200m, mainly over rocky and sandy substrates. It is a rather nocturnal fish but it can occasionally be found during the day among beds of sea grass and on rocky bottoms in the vicinity of caves or large crevices where it can shelter. This species is social and lives in small groups. It feeds off the small fishes and crustaceans. They are capable of creating sound using some muscles under their well developed swim bladder. This is their way of communication since they have a very good hearing ability. They can manage their buoyancy perfectly."
        },
        {
            "id": 45,
            "class": "Ray-finned fishes",
            "name": "European pilchard",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F1.jpg?alt=media&token=35ed2092-10f4-407c-8c39-d3a43b320c53",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F2.jpg?alt=media&token=80defe35-4c1e-47a5-81bb-113538662db2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F3.jpg?alt=media&token=c33a7878-5513-4045-b782-19e3089d9e1a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F4.jpg?alt=media&token=6abc521c-50e7-4420-8621-e118b0bced6e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F5.jpg?alt=media&token=c835b86e-ad55-4910-aec7-e8f26f7a6c57",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F6.jpg?alt=media&token=da68f80c-f12f-40ad-b50e-7dba7d23d684",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F7.jpg?alt=media&token=0d1ca43e-2ab5-4af9-939c-9af9b4daccd0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_pilchard_evropejskaya_sardina%2F8.jpg?alt=media&token=6bab9e6d-6cc7-444f-83e8-387bf3fc9dec"
            ],
            "video": "https://www.youtube.com/embed/fcbeUd-MTmM?si=V5WTDIQgUlM_8_d2",
            "text": "The european pilchard (Sardina pilchardus) is a species of ray-finned fish belonging to the family Alosidae. The young of the species are among the many fish that are sometimes called sardines. It reaches up to 27.5 cm (10.8 in) in length. It is somewhat elongated, herring-like fish. The origin of the pelvic fins is well behind that of the dorsal fin, and the last two soft rays on the anal fin are larger than the remainder. The upper parts are green or olive, the flanks are golden and the belly is silvery.<br/> The european pilchard is a migratory, gregarious species, primarily coastal, but occasionally reaching sea depths of up to 100 km (62 mi). During the day it is mostly in the depth range 25 to 55 m (80 to 180 ft) but can go as deep as 100 m (330 ft). At night it is generally from 10 to 35 m (33 to 115 ft) beneath the surface. The diet consists of both zooplankton and phytoplankton. The zooplankton is largely copepods and their larvae, which make daily vertical migrations to feed near the surface at night, and this is when the adult pilchards feed on them; juveniles feed during the day as well."
        },
        {
            "id": 46,
            "class": "Ray-finned fishes",
            "name": "European anchovy",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F1.jpg?alt=media&token=b84d5a8d-f8d7-45ad-a56b-3317a0e4864f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F2.jpg?alt=media&token=ae47443d-466d-434f-879a-00a7b4ed8864",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F3.jpg?alt=media&token=c269df09-0623-44de-9d55-a59b80e04976",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F4.jpg?alt=media&token=e458b7f0-9124-4975-8b8b-5e153ac1081d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F5.jpg?alt=media&token=1f3cd66a-9d8e-4e60-86ff-e7fad44dae82",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F6.jpg?alt=media&token=78d87e86-ed7e-4232-8d96-36af25fb6502",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F7.jpg?alt=media&token=8a6317c9-0089-46f3-b373-dec1e8c9bb68",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_anchovy_evropejskij_anchous%2F8.jpg?alt=media&token=28ec83a7-d7fa-4c2d-a8bd-7e86042217df"
            ],
            "video": "https://www.youtube.com/embed/B1lKlN5bdks?si=mT-I8Rd9c3QgTLXS",
            "text": "The european anchovy (Engraulis encrasicolus) is a forage fish belonging to the family Engraulidae. It is easily distinguished by its deeply cleft mouth, the angle of the gape being behind the eyes. The pointed snout extends beyond the lower jaw. The fish resembles a sprat in having a forked tail and a single dorsal fin, but the body is round and slender. The record weight for a single fish is 49 g. The maximum recorded length is 21 cm (8.1 in). 13.5 cm is a more typical length. It has a silver underbelly and blue, green or grey back and sides. A silver stripe along the side fades away with age.<br/> The european anchovy is a coastal pelagic species; in summer, it usually lives in water less than 50 m deep, and it may go as deep as 400 m. It can live in waters with a wide range of salinity levels. European anchovies eat plankton, mostly copepods and the eggs and larvae of fish, molluscs, and cirripedes. They are migratory, often travelling northwards in summer and south in winter. They form large schools, and may form bait balls when threatened. European anchovies are eaten by many species of fish, birds and marine mammals."
        },
        {
            "id": 47,
            "class": "Ray-finned fishes",
            "name": "Atlantic mackerel",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_mackerel_atlanticheskaya_skumbriya%2F1.jpg?alt=media&token=d5dd8d92-9908-4620-b50f-3cbc1e33e63d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_mackerel_atlanticheskaya_skumbriya%2F2.jpg?alt=media&token=c27924ff-93bc-47bf-9681-c9215a7b0f3f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_mackerel_atlanticheskaya_skumbriya%2F3.jpg?alt=media&token=ea411b7b-dab4-4dae-b80a-226c683504ef",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_mackerel_atlanticheskaya_skumbriya%2F4.jpg?alt=media&token=2ba57d25-abbc-4c6e-bf59-0cf54d19325f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_mackerel_atlanticheskaya_skumbriya%2F5.jpg?alt=media&token=eb24cdeb-40fd-455b-a622-3d33da180339"
            ],
            "video": "https://www.youtube.com/embed/HY3Eg38K9yo?si=vcyuQc1qRhLs6zVF",
            "text": "The atlantic mackerel (Scomber scombrus) is a fish belonging to the family Scombridae. It can reach sizes of up to 60 cm (24 in) and has a common length of 30 cm (12 in). Its maximum published weight is 3.4 kg (7.5 lb). It has an elongate, fusiform body with a long, pointed snout. The eyes are large and covered by an adipose eyelid, while the teeth are small, sharp, and conical. Scales are also small, with the exceptions of those immediately posterior to the head and around the pectoral fins. These small scales give the atlantic mackerel a velvet-like feel. The two dorsal fins are large and spaced far apart. The second dorsal fin is typically followed by 5 dorsal finlets, though it can have 4 or 6. The anal fin, which originates slightly behind the second dorsal fin, is similar to it in size and shape and is also succeeded by 5 finlets. The fish's body tapers to a slim caudal peduncle, the end of the fish to which the short but broad tail fin is attached. Its body is steel-blue dorsally with wavy black lines running perpendicular to the fish's length. The rest of its body is silvery-white to yellow and may have darker splotches.<br/> The atlantic mackerel's common depth range extends from the surface to 200 m (660 ft), but individuals can be found as deep as 1,000 m (3,300 ft). It is a migratory fish, spending the spring and summer closer to shore about 32-161 km (20-100 mi) out, with juveniles moving closer in to shore than adults. Sometimes the fish even enter harbors, and they are usually juveniles. In autumn and winter they move further and further south to the warmer waters on the edge of the continental shelf.<br/> The atlantic mackerel is an active, fast-moving fish that must keep in constant motion to bring in enough oxygen to survive. It swims using short movements of the rear of its body and the caudal fin. Unlike other mackerel, atlantic mackerel do not leap out of the water unless attempting to escape a predator. They form large schools, consisting of individuals of the same relative size, near the ocean surface during all seasons but winter. When feeding on larger prey, schools tend to break down into shoals and individuals find food on their own. When consuming plankton, however, atlantic mackerel form tight aggregations, open their mouths as wide as possible, and extend their operculums, swimming in a tightly packed school that acts like a series of miniature tow nets. Spaced only about the diameter of a single fish's mouth apart, this formation greatly reduces the ability of plankton to evade capture, as a plankton darting out of the way of one fish is likely to end up in the jaws of another. Copepods make up the majority of the atlantic mackerel's diet."
        },
        {
            "id": 48,
            "class": "Ray-finned fishes",
            "name": "Garfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F1.jpg?alt=media&token=ee0d2ba4-7da0-4a06-9ec5-f857a7f07874",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F2.jpg?alt=media&token=36b3723f-88ce-4dc8-92f1-81c8d15e7747",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F3.jpg?alt=media&token=45e58b56-973c-431d-954c-3580915ac19b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F4.jpg?alt=media&token=3c783de3-4019-4438-be40-c44d8690884f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F5.jpg?alt=media&token=aecc3ba7-2d40-46e5-93a1-5d32f436b8c6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F6.jpg?alt=media&token=639c58bd-1c4b-4273-a03f-6d4e0d300a33",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F7.jpg?alt=media&token=528c5431-1d74-4de1-9326-ced5267f6fa2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/garfish_evropejskij_sargan%2F8.jpg?alt=media&token=028af745-d70a-426b-b070-d569e20755f4"
            ],
            "video": "https://www.youtube.com/embed/K9T2zOGHQE4?si=agd-XPdLZdhYY62d",
            "text": "The garfish (Belone belone), also known as the garpike or sea needle, is a pelagic needlefish belonging to the family Belonidae. The garfish is a long and slender fish with a laterally compressed body, and grows to about 50 to 75 cm (20 to 30 in) in length. The jaws are elongated and armed with sharp teeth. The pectoral, dorsal, and anal fins are situated well back on the body and the latter two are similar in appearance. Positioning the fins so far back gives greater flexibility to the body. The lateral line is set low on the flanks. The colour of the body is bluish green with a silvery grey belly and the bones are green.<br/> Garfish live close to the water surface. They have a migratory pattern similar to that of the mackerel. They move into shallow waters in April and May and spawn in areas with eelgrass in May and June. In the autumn, they return to the open sea. Garfish are oviparous and the eggs are often found attached to objects in the water by tendrils on the egg's surface. Spawning occurs in May and June among seagrass beds with the long sticky tendrils on the chorion adhering to the blades of the sea grasses. The garfish is a predator which hunts in the open sea seeking out shoals of small fish. It also feeds on free-swimming crustaceans. It often forages close to shore and hunts in and around natural or man-made features that interrupt tidal flows."
        },
        {
            "id": 49,
            "class": "Ray-finned fishes",
            "name": "Black Sea sprat",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_sprat_chernomorsko-kaspijskaya_tulka%2F1.jpg?alt=media&token=0d9f0e41-e149-4d5b-93cd-8094883cb9b7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_sprat_chernomorsko-kaspijskaya_tulka%2F2.jpg?alt=media&token=284a964d-6394-4b83-913d-fb6f17cc4e0d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_sprat_chernomorsko-kaspijskaya_tulka%2F3.jpg?alt=media&token=aac905e5-8333-4eac-9ccc-a89393c7f51d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_sprat_chernomorsko-kaspijskaya_tulka%2F4.jpg?alt=media&token=f8a35f1b-7c97-47af-b03a-a073ae28777d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_sprat_chernomorsko-kaspijskaya_tulka%2F5.jpg?alt=media&token=6fd508e9-9ac4-4a0e-a46b-2a2c606beaf7"
            ],
            "video": "https://www.youtube.com/embed/DlJ4vb7Xd1E?si=mcd_aIaqINlMAV6w",
            "text": "The Black Sea sprat (Clupeonella cultriventris) is a small fish of the herring family Clupeidae. A typical size is 10 cm (maximum 15 cm). The body is strongly compressed laterally; the ventral keel is well developed; the head is elongated and wide. The upper jaw of the small mouth extends beyond the vertical line of the anterior edge of the eye. The dorsal fin has 14-17 rays, and the anal fin has 17-21. It has 41-43 vertebrae, including 23-26 caudal vertebrae. The color of the dorsal surface is from gray-greenish to bluish-green, the ventral surface is silvery-white or golden-yellow.<br/> The life span is of up to 5 years. Black Sea sprat is a schooling pelagic fish. Feeds on small zooplankton (copepods, cladocerans and mysids). The peak of its spawning is in April-May at water temperatures from 15 to 18°C and it can be found in enormous shoals in sea-shores, filled all-round coastal shallows, moving quickly back into the sea at a depth of 6-30 metres."
        },
        {
            "id": 50,
            "class": "Ray-finned fishes",
            "name": "East Atlantic peacock wrasse",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F1.jpg?alt=media&token=4f666d93-6f89-4e64-a698-b9f29683f019",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F2.jpg?alt=media&token=d1afddce-ea79-40bc-bcd6-51fdbf76eb87",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F3.jpg?alt=media&token=da7f17ef-775c-468a-ae56-c943c87f7227",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F4.jpg?alt=media&token=7a95da89-4b05-437d-99e0-d448871a3eef",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F5.jpg?alt=media&token=5f36a33b-754a-4459-a555-7904e8c403da",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F6.jpg?alt=media&token=72229c1f-9a36-4b70-b4a0-113ff1e61290",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F7.jpg?alt=media&token=10add700-36f9-40c4-81ff-8f706808cfa9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/east_atlantic_peacock_wrasse_zelenushka%2F8.jpg?alt=media&token=4bc47d86-d687-4bca-8cb2-17a5541b111b"
            ],
            "video": "https://www.youtube.com/embed/9F1FcvO8h34?si=-mdtL3r7wqy4_aOh",
            "text": "The East Atlantic peacock wrasse (Symphodus tinca) is a species of Labridae family. It can reach 44 cm (17 in) in standard length, though most grow no larger than 25 cm (9.8 in). Body is oval and laterally flattened. Mouth is rather small, more or less protrusive, with rather strong canine-like teeth. There are a few cephalic pores on the snout; lips are with 6-9 folds. Head is generally longer than body depth. Dorsal fin is very long and reaches almost to the tail. Females and juveniles are grey-greenish or brownish, fading to a silvery color on the belly. Between immature males and mature females there are almost no differences in color. Adult males are more brightly colored. Pale green, green-bluish or green-yellowish, longitudinal rows of red spots, with upper part of head dark blue. Both ales and females have a small dark spot at base of caudal fin and a dark blotch just above pectoral fin.<br/> This gregarious littoral fish is found on rocky reefs covered by algae, on sea-grass meadows, around rocks surrounded by eelgrass and can also be found in brackish waters in lagoons. It occurs at depths from 1 to 50 m (3.3 to 164.0 ft). East Atlantic peacock wrasse feeds on bivalves, shrimps and crabs. Spawning takes place in spring, when a seaweed nest is built and guarded by the male, with one or more females laying their adhesive eggs in it."
        },
        {
            "id": 51,
            "class": "Ray-finned fishes",
            "name": "Ocellated wrasse",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F1.jpg?alt=media&token=a54d1926-a349-4464-b055-98df3c8228de",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F2.jpg?alt=media&token=e92e5d23-a192-4512-9ed5-64e9406f74de",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F3.jpg?alt=media&token=c6484ed1-2c20-4771-ace5-ed8457caa41e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F4.jpg?alt=media&token=97f456e2-5fde-4f00-84d4-d5a8ec4734e8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F5.jpeg?alt=media&token=e5a64d15-8aaf-4758-a3a0-62c82ff7ff2c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F6.jpg?alt=media&token=d8c423fe-c090-46fe-ad13-ca5df8df31a0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F7.jpg?alt=media&token=74606443-f41e-4d8a-83f1-44d277806936",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F8.jpg?alt=media&token=d41c1f81-b96a-4bca-8b70-34400806231d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F9.jpg?alt=media&token=27d5edae-79f0-476f-b34f-0f3ab8f99080",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/ocellated_wrasse_glaschataya_zelenushka%2F10.jpg?alt=media&token=916efc8c-3d00-44fb-9e94-6248831fd2ac"
            ],
            "video": "https://www.youtube.com/embed/xLGRL4WUIMg?si=gmJ_KAt6wv0nYIYl",
            "text": "The ocellated wrasse (Symphodus ocellatus) is a species of the family Labridae. This species can reach 12 cm (4.7 in) in standard length. Max. length: 14 cm (5.5 in). The body is shortened, oval-shaped, covered with large scales. The head, except for the snout and forehead, is also covered with scales. The snout is short, shorter than the postorbital distance. The mouth is small, with one row of small fang-like teeth on the jaws. The lateral line curves down behind the dorsal fin. The upper part of the gill cover is not covered with scales and is colored in different colors with a red or blue edging. There are seismosensory pores on the snout. Dorsal fin with 13-15 spiny and 8-11 soft rays. The anal fin has 3 spiny and 8-11 soft rays. In females and juveniles the body is brown or yellowish, the belly is white. Two longitudinal dark brown stripes run along the body under the dorsal fin and in the middle of the sides. Males are orange-brown or green with a bluish tint; they have red, blue and green stripes on their heads. There is a dark spot at the base of the caudal fin.<br/> The ocellated wrasse inhabits areas with rocks and eelgrass at depths from 1 to 30 m (3.3 to 98.4 ft). It feeds on various marine invertebrates. These fish live about two to three years."
        },
        {
            "id": 52,
            "class": "Ray-finned fishes",
            "name": "Pointed-snout wrasse",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F1.jpg?alt=media&token=94dd324a-9169-48dc-94ff-7701b417081f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F2.jpg?alt=media&token=3a2b8872-be90-4680-8571-42f245026a47",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F3.jpg?alt=media&token=8731899a-6ac4-4963-b827-23cd27ca4334",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F4.jpg?alt=media&token=e2dfca1e-59da-45c1-86f7-2e083d46fe8c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F5.jpg?alt=media&token=3811f2b2-42e8-4909-8dbe-1eacc5ae713c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F6.jpg?alt=media&token=51203d53-d3a2-4086-8b6e-369c8b8c21a8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F7.jpg?alt=media&token=8382ea98-93c9-4c34-acc9-8e5f2ae171be",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F8.jpg?alt=media&token=4f6e7b75-f9d3-4d88-9b5e-147bcaf1938c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/pointed-snout_wrasse_nosataya_zelenushka%2F9.jpg?alt=media&token=62d11d2b-226d-46e7-a4c0-dce259f0e643"
            ],
            "video": "https://www.youtube.com/embed/zQoI8DfPhPw?si=oeACi2dFASouSKMk",
            "text": "The pointed-snout wrasse (Symphodus rostratus), also known as the long-snout wrasse, is a species of marine ray-finned fish from the family Labridae. The maximum body length is 15.5 cm, usually 10-12 cm. It is a slender species of wrasse with a small head and an elongated and pointed snout. It has a long dorsal fin with 14-16 spines in the anterior portion and 9-12 branched rays in its posterior part. The anal fin is short with 3 spines and 9-11 branched rays. The body is covered in large scales and is an overall green or brownish colour with darker markings on the flanks and back. It also normally has a white stripe on the head running from the snout to the base of the dorsal fin.<br/> The pointed-snout wrasse occurs near rocks in beds of the eelgrass Zostera and Posidonia at depths of 1 to 30 meters (3.3 to 98.4 ft). it occurs in small groups. It feeds on small benthic organisms such as molluscs, crustaceans, and the distinctive shape of the snout suggests that it is specialised for picking prey out of crevices."
        },
        {
            "id": 53,
            "class": "Ray-finned fishes",
            "name": "Rusty blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F1.jpg?alt=media&token=ad27eb5a-56e9-476d-905c-7d29169e3d51",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F2.jpg?alt=media&token=2b5759ac-e932-4fff-bc07-a007d2377d8b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F3.jpg?alt=media&token=90d0e1a1-34ce-49a2-9888-77f3c65ead95",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F4.jpg?alt=media&token=81d70b90-096d-447e-b341-602f6249bfa0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F5.jpg?alt=media&token=f5ff06b2-0139-4ab3-8f34-87d9b9625b12",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F6.jpg?alt=media&token=f3eaf126-c1dc-42a5-932d-6a1bfde9bcb6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F7.jpg?alt=media&token=a04ddb63-ae5c-4e59-bb56-27052e2661b1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rusty_blenny_obyknovennaya_morskaya_sobachka%2F8.jpg?alt=media&token=66160dcd-a443-4858-820b-cb335f396db2"
            ],
            "video": "https://www.youtube.com/embed/Y_DqGlBDd-Q?si=2gEeASHVd8oXKz6w",
            "text": "The rusty blenny or Black Sea blenny (Parablennius sanguinolentus) is a species of percomorph marine fish of the family Blenniidae. This species reaches a length of 23 centimetres (9.1 in) but more common length is about 12.5 centimetres (4.7 in). Its back and sides are greenish, gray-yellowish or olive with black spots, its belly is yellowish. The dorsal fin has 11 spiny and 21 soft rays. The anal fin has 21 soft rays, no spiny ones. On the head above the eyes there are short filament-branched outgrowths or lobes.<br/> The rusty blenny is a bottom-dwelling non-migratory fish. It lives in coastal shallow littoral waters among rocks and stones overgrown with filamentous algae (cystoseira). It feeds almost exclusively on coastal red, brown and green algae. Occasionally, animal food (mollusks, young crabs and amphipods) is also found in their stomachs. Spawning occurs in April-June, sometimes continuing into July. Females lay sticky eggs on the underside of coastal stones, or in the empty valves of bivalves (mussels and oysters). The male guards the egg laying for 15-20 days."
        },
        {
            "id": 54,
            "class": "Ray-finned fishes",
            "name": "Zvonimir's blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F1.jpg?alt=media&token=f623c1fe-12a4-40be-adc3-79356c8d4426",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F2.jpg?alt=media&token=86bb8f3c-de08-4f18-acd9-7fbd68df8a18",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F3.jpg?alt=media&token=e7bb97b7-ba54-4bf4-92b5-af0e703dd399",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F4.jpg?alt=media&token=985d3a8d-f716-41bc-b606-f4f24c84321f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F5.jpg?alt=media&token=8146ebdc-3a2c-4d95-8b0d-4148194bc768",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F6.jpg?alt=media&token=0ee75614-7dfd-4b9b-aa24-3ea5fc3a83e7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/zvonimir's_blenny_morskaya_sobachka_zvonimira%2F7.jpg?alt=media&token=6c11cc6b-583f-4e80-9f07-563f07c97d61"
            ],
            "video": "https://www.youtube.com/embed/czJyH-mRoEE?si=eTGFUeNpWsg97W6h",
            "text": "Zvonimir's blenny (Parablennius zvonimiri) is a species of percomorph marine fish of the family Blenniidae. This species reaches a length of 7 centimetres (2.8 in). Body length up to 7 cm. The body is elongated, low, laterally compressed. The dorsal fin, in which there are no more than 19 branched rays, with a noticeable notch between the anterior and posterior parts, meets the caudal fin. There are often several tentacles in the center of the front of the head. The tentacles look like long lobes that almost reach the beginning of the dorsal fin. The tentacles also have up to 7 finger-like sprouts and become thinner towards the apex. Behind the front nostrils there is a long lobe that reaches the rear nostrils and branches in the upper part into 2-3 sprouts. There are 29-34 teeth on the upper jaw, and 28-30 teeth on the lower jaw, the last tooth of both jaws is enlarged. The general color background is chocolate brownish. On the back and sides there are small dark spots that sometimes merge into stripes. There are up to 7 whitish or yellowish spots at the base of the dorsal fin, and a dark brown spot at the base of the caudal fin. Dark spots appear on the septa of the anterior part of the dorsal fin, on the front of the body and on the back of the head. During breeding, the color of the males becomes brighter.<br/> Zvonimir's blenny is a bottom dwelling fish of coastal areas with a rocky bottom. It lives in small groups among rocks and large stones at depths of up to 5-6 m. Feeds on bottom fouling organisms."
        },
        {
            "id": 55,
            "class": "Ray-finned fishes",
            "name": "Tentacled blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F1.jpg?alt=media&token=536fe6f6-af15-4153-acbb-a2821a3de2e1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F2.jpg?alt=media&token=f162ee22-1c6a-4f30-857e-3c7d2a3350dc",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F3.jpg?alt=media&token=8e2aee0b-eed3-434c-bc96-87e99f74a2af",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F4.jpg?alt=media&token=196e7a4f-9000-492c-9068-a883511da609",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F5.jpg?alt=media&token=df016d14-ae91-404e-ae0e-870938e05d9a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F6.jpg?alt=media&token=5ba7fb1b-af17-489d-943c-cca529587f86",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/tentacled_blenny_dlinnoshupolcevaya_morskaya_sobachka%2F7.jpg?alt=media&token=5272af0f-b036-41af-8466-4093bd1d3c57"
            ],
            "video": "https://www.youtube.com/embed/hV6RgEGg4oM?si=FlPxUKYOo3cO9FnR",
            "text": "The tentacled blenny (Parablennius tentacularis) is a species of percomorph marine fish of the family Blenniidae. This species reaches a length of 15 centimetres (5.9 in) but more common length is about 7-10 centimetres (2.8-3.9 in). The body is elongated, low, slightly laterally compressed. The dorsal fin has at least 20 branched rays; there is no notch between the anterior and posterior parts of the fin. The tentacles above the eyes are quite long (often reaching the beginning of the dorsal fin), thick and have massive outgrowths and fringe along the posterior edge. There are 24-29 teeth on the upper jaw, 21-25 teeth on the lower jaw, the outer teeth of both jaws are enlarged in the form of fangs. The general color background is brownish, grayish-yellowish or reddish. There are 6-7 transverse stripes or large and small spots on the sides. The dorsal fin is yellowish or grayish-yellowish, with a black spot at its beginning, the pectoral fins are yellowish, and the anal fin is gray.<br/> The tentacled blenny is a demersal fish which can be found in the sand at the bottom of the water in light vegetation. It lives at a depth of 1-3 m, also occurring up to a depth of 25 m."
        },
        {
            "id": 56,
            "class": "Ray-finned fishes",
            "name": "Mystery blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F1.jpg?alt=media&token=e0bf7888-5dd3-4051-a895-393346026657",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F2.jpg?alt=media&token=ee0c4793-6405-499c-9885-0096efa5ec72",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F3.jpg?alt=media&token=d9e936c2-f1e3-4eec-b5e2-2232cbc0014c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F4.jpg?alt=media&token=0fcdc66a-b570-47c4-9ec4-3c59225ba341",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F5.jpg?alt=media&token=71cc5361-81b5-4c83-872f-86aebcb84260",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F6.jpg?alt=media&token=b1f10f40-0502-4d57-913e-c7c74243760b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mystery_blenny_zelenaya_morskaya_sobachka%2F7.jpg?alt=media&token=2ba5fa54-42ce-4ac6-9f26-423ae4f11205"
            ],
            "video": "https://www.youtube.com/embed/P5C--kJet90?si=8hdiF0GYmCGrLwhs",
            "text": "The mystery blenny (Parablennius incognitus) is a species of percomorph marine fish of the family Blenniidae. It can reach a length of 6.5 centimetres (2.6 in). The body is elongated, low, slightly laterally compressed. The dorsal fin, in which there are no more than 19 branched rays, with a noticeable notch between the anterior and posterior parts, almost meets the caudal fin. There are often tentacles on the front of the head. The general color background is grayish-greenish, with up to 7-9 yellowish-brownish or brownish transverse stripes on the sides. During breeding, males acquire yellow, red, brown, green, etc. colors.<br/> The mystery blenny is a bottom dwelling fish of coastal shallow rocky areas.It lives in small groups at depths of up to 0.5-2.5 m among rocks and large stones covered with algae, in which there are places to hide. It feeds on bottom invertebrates and partly algae."
        },
        {
            "id": 57,
            "class": "Ray-finned fishes",
            "name": "Peacock blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F1.jpg?alt=media&token=92a4fce2-a05f-41ab-a480-09f783ca4a6c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F2.jpg?alt=media&token=a794ac5f-1bb3-4583-8c4f-55e7a83b73c3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F3.jpg?alt=media&token=f08e7675-3328-4ec8-b1c0-bd8814193142",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F4.jpg?alt=media&token=9a535183-7305-4db2-9b2a-1c08cae46a79",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F5.jpg?alt=media&token=ed833c6d-edbc-48db-aec7-243481576141",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F6.jpg?alt=media&token=1ec3c475-b0b4-41fd-a80c-22b94fab6726",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F7.jpeg?alt=media&token=9b3633ce-5f5f-42b6-ada2-bcd4ff31e216",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/peacock_blenny_morskaya_sobachka-pavlin%2F8.jpeg?alt=media&token=16c8903e-dcc9-4c2a-94bc-281b4b419874"
            ],
            "video": "https://www.youtube.com/embed/FzrEbHG7ets?si=B-qOMlu7MAusa_Gn",
            "text": "The peacock blenny (Salaria pavo) is a species of percomorph marine fish of the family Blenniidae. It reaches a length of 13 centimetres (5.1 in). Males are usually larger than females. The body is without scales, spindle-shaped, covered with a layer of thick mucus. The supraorbital projections are short and almost invisible. The front profile of the head is rounded; males have a crest running from the dorsal fin to the eyes in the form of a convex arc. The teeth are weak, mostly located in one row in the form of a comb, 26-32 teeth on the upper jaw, and 19-24 teeth on the lower jaw. The lateral line in the front of the body is located above, then curves over the end of the pectoral fin, then passes through the middle of the body. The color of males is brighter than females. In general, the coloration on top of the body is yellow-greenish, with 6-7 vertical stripes of bluish color and light blue dots on the sides and lines on top. Behind the eye there is a blackish spot, which is surrounded by a bluish rim and a ring of the same color. The crest on the head is yellowish in color, with a transverse dark green stripe. The dorsal and anal fin are greenish in color, with a lighter, brownish or bluish border.<br/> The peacock blenny is found at shallow depths (mostly 30-50 cm) among stones and pebbles. It occurs near the coast almost all year round. It does not swim far from the chosen habitat. It moves like a snake, wriggling its entire body. It feeds on bottom invertebrates (preferring mollusks), crustaceans, eggs of other fish and algae."
        },
        {
            "id": 58,
            "class": "Ray-finned fishes",
            "name": "Sphinx blenny",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F1.jpeg?alt=media&token=16600aad-8234-43b4-9c56-7533a89366d0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F2.jpeg?alt=media&token=ba4a1c97-137d-4094-b54a-2f3dfdf58b93",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F3.jpg?alt=media&token=5531552a-c3db-4b67-a646-21e7bf70d41d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F4.jpg?alt=media&token=ad43dcdb-bc97-43aa-80a8-fb9a4248e8e0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F5.jpg?alt=media&token=6b9f2791-59f0-4052-a28e-711adb2fb336",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F6.jpg?alt=media&token=6ec1ef6b-9845-4853-b49a-32100a6ef7fe",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sphinx_blenny_morskaya_sobachka-sfinks%2F7.jpg?alt=media&token=a161a1ba-f9c8-4af4-937a-80ac396fd2ec"
            ],
            "video": "https://www.youtube.com/embed/WrYEGMvEEds?si=Zky24P6OfeO2w05N",
            "text": "The sphinx blenny (Aidablennius sphynx) is a species of percomorph marine fish of the family Blenniidae. It can measure up to 8 centimetres (3.1 in) long, common length is about 4 centimetres (1.6 in). The body is elongated, the caudal fin is rounded. The dorsal fin is long, starting just behind the head and ending at the caudal peduncle. Its spiny part is very high, and is separated from the soft part by a notch. The anal fin is similar to the soft part of the dorsal fin. The gill membranes on both sides are connected to each other, forming a fold above the interbranchial space. The head is small, the upper edge is rounded, the snout is blunt, the mouth is small with wide lips. The eyes are located in the upper part of the head, above each there is a small growth-tentacle. Females have weak teeth, arranged in one comb-like row. The color is beige-olive, grayish-green, the back is darker. The upper edge of the dorsal fin is smoky, the anal fin is yellow-brown with a dark edging, the pectoral fins are yellowish or gray-yellow with two transverse brown stripes and reddish rays. The caudal fin is reddish with two or three transverse dark stripes. Males' tentacles turn orange during spawning. On the sides there are 6-7 wide transverse greenish-brown stripes bordered by narrow blue stripes. The same narrow blue, but short stripes, and small spots are on the head.<br/> The sphinx blenny is a bottom-dwelling fish that is found in the littoral zone near the shore among stones and rocks overgrown with green algae. They feed primarily on benthic algae, weeds and invertebrates. "
        },
        {
            "id": 59,
            "class": "Ray-finned fishes",
            "name": "Red-black triplefin",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F1.jpg?alt=media&token=f622dbc3-3718-43f7-b696-1967527691c1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F2.jpg?alt=media&token=9db173e2-75ba-4e52-859a-feb817348362",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F3.jpg?alt=media&token=85d21c3d-ca42-404d-8b05-4529dcb9e5ab",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F4.jpg?alt=media&token=95ae6997-23fe-4890-a4ae-da4f12f26f7e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F5.jpg?alt=media&token=5c482125-3bff-4e70-8159-9edae50b031b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F6.jpg?alt=media&token=a8985342-9565-4f61-a4c4-45bf21193498",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F7.jpg?alt=media&token=f34dca31-c2dd-4b7d-84fe-eb3f20fc67c0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red-black_triplefin_chernogolovyj_troeper%2F8.jpg?alt=media&token=0f01b212-05ec-4b11-a7a3-8b85e2e65c8d"
            ],
            "video": "https://www.youtube.com/embed/mWQCIq8TDMA?si=v0iOKkks73JEr4Rl",
            "text": "The red-black triplefin (Tripterygion tripteronotum) is a species of fish in the family Tripterygiidae, the threefin blennies. The greatest body length is 6.7 cm, usually the length of females is up to 5.2 cm, males - up to 6.7 cm. Life expectancy is about 5 years. The body is elongated, low, laterally compressed, covered with ctenoid scales, small in the caudal part. Head, gill covers, bases of paired fins, ventral side to cloaca without scales. There are 3 dorsal fins, they are connected to each other by thin leathery membranes, the anal fin is very long. The head is small and convex. Above the large eyes, which are located on the upper edge of the head, there are short thread-like tentacles, and along the upper edge of the eyes there are short cilia. The color is very variable. The general background is red or gray with faint black or dark brown transverse stripes (up to 5 stripes) and spots. In males, the color is somewhat brighter: the head, belly, base of the paired fins are black, the pectoral, dorsal and anal fins are red, the dorsal fins have a bluish stripe and black dots. In females, the color of the body and head is usually brownish-pink, the belly, the rays of the paired fins are yellowish-white, the first dorsal fin is red, the other two are pinkish with four black stripes, and there are three dark transverse stripes on the caudal fin.<br/> The red-black triplefin is a bottom sedentary fish of the coastal zone. It usually lives in pairs among large stones and rocks, where it finds refuge in burrows and caves, protected from bright light and surf. Adults feed on small benthic creatures, mainly crustaceans and amphipods, and also consume eggs and larvae of fish, in particular blennies."
        },
        {
            "id": 60,
            "class": "Ray-finned fishes",
            "name": "Blunt-snouted mullet",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F1.jpg?alt=media&token=41f03eee-035d-47f5-b10a-8f1a70c108c4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F2.jpg?alt=media&token=d87063d6-690d-464f-b49d-058bb92027d5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F3.jpg?alt=media&token=71b81aee-75b6-450b-a74c-4e40b163f5ee",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F4.jpg?alt=media&token=9b40a348-0962-4991-aef0-0862b031869a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F5.jpg?alt=media&token=02f077f6-1019-416a-85de-37347e63464b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F6.jpg?alt=media&token=1070e0cb-1b57-4f34-bcda-5cdf50b5a8c8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F7.jpeg?alt=media&token=d87be101-b649-49bc-93b7-87587e873a0b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/blunt-snouted_mullet_sultanka_chernomorskaya%2F8.jpg?alt=media&token=2c84942d-c471-4ba6-b65a-cd481ecf8b3b"
            ],
            "video": "https://www.youtube.com/embed/cBAyLoFRyco?si=D9o8jjHg85siJikd",
             "text": "The blunt-snouted mullet (Mullus barbatus ponticus) is a species of the family Mullidae. It can grow to a length of 30 cm (12 in), but more common length is about half that. The body is somewhat laterally compressed. The head is large with a steeply sloping, almost vertical snout and high-set eyes. The small mouth is equipped with small bristle teeth. There are no spines on the operculum. It has two dorsal fins. A pair of moderately long barbels on the chin do not exceed the pectoral fins in length. They are sensory organs and are used to help locate prey. There are two types of coloring. First type: the back is pale pink with dark spots, at eye level there is an intermittent burgundy-brown longitudinal stripe, the sides are silver with large red spots, including on the head. Second type: the back is silver-gray, at eye level there is a burgundy-brown longitudinal stripe, the sides are white-gray with a yellow longitudinal stripe. The fins in both variants are light yellow or colorless.<br/> The blunt-snouted mullet is a demersal fish and occurs at depths ranging from 15 to 300 m (49 to 984 ft) over muddy, sandy or gravel bottoms. It is carnivorous, the diet consisting mainly of polychaete worms, bivalve molluscs and crustaceans. Both young and adult mullet are preyed on by various fish including the angler fish (Lophius piscatorius), the thornback ray (Raja clavata), the common stingray (Dasyatis pastinaca) and the European hake (Merluccius merluccius)."
        },
        {
            "id": 61,
            "class": "Ray-finned fishes",
            "name": "Sailfin dragonet",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F1.jpg?alt=media&token=96250e5c-1dd0-49cc-b2c1-68b625fef557",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F2.jpg?alt=media&token=f06316de-09a2-4644-ab1e-8e8994a246df",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F3.jpg?alt=media&token=1d98c127-6c03-464c-8f5a-9801822043a2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F4.jpg?alt=media&token=646b0ed0-f16e-453a-818e-c4b13ec9bc20",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F5.jpg?alt=media&token=a6d66f0b-7d4a-43b9-bd8f-23983cce0ad5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F6.jpg?alt=media&token=bfd85e37-2bb8-49c8-ad94-0ada3fe90fc9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F7.jpg?alt=media&token=0717f1a7-d859-44f2-8274-2221f7884b9c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/sailfin_dragonet_buraya_peskarka%2F8.jpg?alt=media&token=fde51cda-5d56-4ac1-be6e-fb35e930b6b8"
            ],
            "video": "https://www.youtube.com/embed/dLFFNF7Dr64?si=yslIOKZdMDSEMYwe",
            "text": "The sailfin dragonet (Callionymus pusillus) is a species of the family Callionymidae. This species grows to a length of 14 centimetres (5.5 in) while females reach a length of 10 centimetres (3.9 in). The body is elongated, low, without scales, the head and front part of the body are flattened, the back part is laterally compressed. The sailfin dragonet has three upwardly directed spines on the preoperculum and differs from other species of dragonet by having a first dorsal fin which is lower than the second dorsal fin. The second dorsal fin has long rays which extend into long filaments. These filaments extend beyond the caudal fin. The male is brightly coloured with 14 to 16 silvery transverse lines fringed with black on its body and with blue streaks on the fins. The female is beige with small whitish spots.<br/> It is a benthic species which occurs in shallow waters and prefers sandy bottoms down to 100 metres (330 ft). The males are territorial, aggressively defend their territories from other males. This species feeds mainly on small benthic invertebrates such as worms and small crustaceans."
        },
        {
            "id": 62,
            "class": "Ray-finned fishes",
            "name": "Mediterranean horse mackerel",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_horse_mackerel_stavrida%2F1.jpg?alt=media&token=bb7ca024-dec1-4c55-bbe0-75b2411d90f5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_horse_mackerel_stavrida%2F2.jpg?alt=media&token=028c9fec-e8ac-4b36-a8db-1aba7c87cd0c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_horse_mackerel_stavrida%2F3.jpg?alt=media&token=3abf5286-77b3-4a65-a60a-dffd710ddb41",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_horse_mackerel_stavrida%2F4.jpeg?alt=media&token=17c1962b-cadb-45aa-aa43-52f6340c56c9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_horse_mackerel_stavrida%2F5.jpg?alt=media&token=a69c2001-df04-41ab-92a7-a0cc9eaae147"
            ],
            "video": "https://www.youtube.com/embed/aG1tlE13PM0?si=UZmdwY_Ugat-FWwV",
            "text": "The Mediterranean horse mackerel (Trachurus mediterraneus), also known as the Black Sea horse mackerel, Mediterranean scad or common scad, is a species of mackerel in the family Carangidae. It has an elongated, compressed body (up to 60 cm (24 in) in length, common length 30 cm (12 in)) with a large head and projected lower jaw. The nostrils are small and close-set and the eyes are protected by a well-developed adipose eyelid. Its upper jaw, or maxilla, is also large and wide. Its body is a dusky color, blue to grey to black in color dorsally and on top of the head, while the lower two-thirds of the body is white to silver in color. Its caudal fin is yellow and it has a distinct black mark just posterior to the operculum. It has 36-41 gillrakers and the anal fin is preceded by two separate spines.<br/> Mediterranean horse mackerel is a marine species that prefers brackish water. Its typical depth range is 5-250 m (16-820 ft), though it can be found as deep as 500 m (1,600 ft). It lives near the bottom, though it sometimes schools near the surface. It feeds primarily on sardines, anchovies, and small crustaceans."
        },
        {
            "id": 63,
            "class": "Ray-finned fishes",
            "name": "European angler",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F1.jpg?alt=media&token=821e52ba-37c0-4461-bca4-d548f2ac774c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F2.jpg?alt=media&token=488612b2-e0ec-486b-98df-8fb588b3a75d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F3.jpg?alt=media&token=d92daf25-46c2-4928-b2d2-97b81a1aa61d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F4.jpg?alt=media&token=5fa25bd8-58c7-489b-9af1-fa5e90aecf96",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F5.webp?alt=media&token=5001c627-522c-4658-ad8b-9cdb77af221e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F6.webp?alt=media&token=47d2883e-c1b3-4bdb-b21c-c785cc5a6a50",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_angler_evropejskij_udilshik%2F7.jpg?alt=media&token=9f60f8b6-ce79-4679-8097-b97646e6aba9"
            ],
            "video": "https://www.youtube.com/embed/xFzMeZVRmas?si=c802BYGESZNqFzbm",
            "text": "The European angler (Lophius piscatorius), commonly known as the common monkfish, is a monkfish in the family Lophiidae. Body length - up to 2 m, more often about 1 m. Maximum weight 57.7 kg. It has a very large head which is broad, flat, and depressed; the rest of the body appears to be a mere appendage. The wide mouth extends all the way around the anterior circumference of the head, and both jaws are armed with bands of long, pointed teeth. These are inclined inwards and can be closed so as to offer no impediment to an object gliding towards the stomach, but to prevent its escape from the mouth. The pectoral and pelvic fins are articulated as to perform the functions of feet, so the fish is able to walk along the bottom of the sea, where it generally hides in the sand or amongst seaweed. Around its head and also along the body, the skin bears fringed appendages resembling short fronds of seaweed, a structure which, combined with the ability to match the colour of the body to its surroundings, assists this fish in camouflaging itself in the places which it selects on account of the abundance of prey. It has no scales.<br/> The fish has long filaments along the middle of its head, which are, in fact, the detached and modified three first spines of the anterior dorsal fin. The filament most important to the angler is the first, which is the longest, terminates in a lappet, and is movable in every direction. The angler is believed to attract other fish by means of its lure, and then to seize them with its enormous jaws. While it is considered probable that smaller fish are attracted in this way experiments have shown that the actions of the jaw is automatic and depends on the contact of the prey with the tentacle. Its stomach is expandable and it is not unknown for these fish to swallow prey of their own size.<br/> The European angler inhabits muddy and sandy bottoms up to depths of 1,000 metres (3,300 ft). It is occasionally found on rocky bottoms as well. Adult anglers feed primarily on fish, while juveniles prey mainly on marine invertebrates."
        },
        {
            "id": 64,
            "class": "Ray-finned fishes",
            "name": "Painted comber",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F1.jpg?alt=media&token=fa15c0bb-69f3-4a65-a1b9-b38475d1b0f4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F2.jpg?alt=media&token=293001bf-ac1e-49c6-898f-c1d5bb018e69",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F3.jpg?alt=media&token=a33aaef8-fa6b-4201-8e17-5d9ca611ba6e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F4.jpg?alt=media&token=8f539d18-92ea-4c10-bcb0-053d366c5c4d",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F5.jpg?alt=media&token=428444aa-d638-456b-845b-835cc353c31a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F6.jpg?alt=media&token=c56c0c76-ce9c-400d-a99e-929f0684ebfc",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/painted_comber_kamennyj_okun-zebra%2F7.jpg?alt=media&token=3241f258-2ad9-478c-9cda-e610e223402e"
            ],
            "video": "https://www.youtube.com/embed/ZI9A8eyvigI?si=kecg2viDWgPLYYsh",
            "text": "The painted comber (Serranus scriba) is a species of marine ray-finned fish, a sea bass from the subfamily Serraninae, classified as part of the family Serranidae. The maximum recorded fish measurement is 36 centimetres (14 in), although 25 centimetres (9.8 in) is more typical. It has a laterally compressed, elongate body with a pointed snout. The dorsal fin has 10 spines and 4-16 soft rays and the anal fin has 3 spines and 7-8 soft rays. The caudal fin is truncate. It has a very large mouth for its size, which has many sharp teeth, and is protractile. The overall colour may be grey, purplish or reddish with 5-7 dark brown bars on the flanks. The head is marked with many narrow, wavy blue lines and red blotches. The dorsal, anal and caudal fins are marked with red dots. There is a diffuse, purplish-blue blotch in the middle of the body. The pelvic and pectoral fins are normally uniform pale yellow.<br/> The painted comber occurs over rocky bottom and among beds of Posidonia at depths of 5 to 150 metres (16 to 492 ft). It normally spends the day sheltering in rocky caves and is normally either solitary or found in small groups. It emerges at dusk to hunt. It is a carnivorous species which is a territorial ambush hunter and has a diet made up of cephalopods, bivalves, crustaceans, fishes, and worms."
        },
        {
            "id": 65,
            "class": "Ray-finned fishes",
            "name": "Greater weever",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F1.jpg?alt=media&token=75263b0e-5337-4091-a4e0-8456f919360c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F2.jpg?alt=media&token=f783540e-8769-4f37-91e3-e1e5873b8ba1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F3.jpg?alt=media&token=eebdb726-b3b5-4e91-9c63-e437aefc47da",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F4.jpg?alt=media&token=eafad7ca-063e-4d42-a172-512e89a3312c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F5.jpg?alt=media&token=0c50b1f8-bf16-4e56-8e91-62d369079570",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F6.jpg?alt=media&token=48ea3a96-7ee7-4fce-a7a8-92f57633cafe",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/greater_weever_morskoj_drakonchik%2F7.jpg?alt=media&token=330e5277-944d-42d4-bea4-9f5ecfc882dd"
            ],
            "video": "https://www.youtube.com/embed/oqRZ0XeM5Ig?si=GfITovGm2HUxysG-",
            "text": "The greater weever (Trachinus draco) is a benthic and demersal venomous marine fish of the family Trachinidae. The body dimensions are described very differently by different authors and seem to differ based on the geographical location were the study has been carried out. In the Eastern Black Sea, the length distribution of mature fishes ranges from 10 cm up to a maximum of 25.8 cm for females and from 9.5 cm to 22.5 cm for males. The weight ranges from 6.96 g to 131.76 g for females and from 5.34 g to 75.84 g for males.<br/> The greater weever is an elongated and laterally flattened fish with upstanding eyes and a distinct superior mouth that is inclined upwards. The lower jaw is longer than the upper jaw. The head is compact flat and relatively big and the eyes sit almost on top of it. The upper rim of the eye has two to three small spines, in front of each eye. The five to seven spiny fin rays on its first dorsal fin and the thorns on each of the gill covers have venom glands at their basis. This spines can inflict serious injuries on humans through accidental stinging. On the dorsal side it is coloured in an greenish brown with a varying count of dark marks on the upper side of the head. The flank is hued in a yellowish brown with bright blue and yellow discontinuous stripes that run crooked to the front of the fish. Additionally oblique black stripes can be found laterally.<br/> This fish has been shown to occur in depths ranging from shallow water where it inhabits mostly muddy or sandy grounds. It is a so-called ambush predator that digs itself into fine sand during daytime only with its eyes and the tip of the dorsal fin exposed. There it lurks until prey emerges which is then attacked. It is a carnivore that mainly feeds on Decapods and Mysids. To a lower extent their diet contains also Isopoda, Amphipoda, Cephalopoda and Shells (Bivalvia). The most common prey that could be identified to the rank of species, were decapods namely Sandy swimming crab (Liocarcinus depurator) and mysids."
        },
        {
            "id": 66,
            "class": "Ray-finned fishes",
            "name": "Black Sea salmon",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_salmon_chernomorskaya_kumja%2F1.jpg?alt=media&token=b24f4d63-7404-4f60-90ab-57c5dc5b2009",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_salmon_chernomorskaya_kumja%2F2.jpg?alt=media&token=7edbdee8-7cb2-42f6-b624-4425ee642139",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_salmon_chernomorskaya_kumja%2F3.webp?alt=media&token=12bdcd7f-f10c-45ea-8839-4f260cdfd109",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_salmon_chernomorskaya_kumja%2F4.jpg?alt=media&token=b2aee361-ef9f-4223-acac-0579010f48fe",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_salmon_chernomorskaya_kumja%2F5.jpg?alt=media&token=cc027537-9dd4-42d7-9f2c-43a802dbb43e"
            ],
            "video": "https://www.youtube.com/embed/gJl-F5gOBr8?si=-CAUq2qzzXF-Aqgg",
            "text": "The Black Sea salmon (Salmo trutta labrax) or Black Sea trout is a fairly small species of the family Salmonidae, at about 51 cm (20 in) long on average and rarely reaching over 76 cm (30 in). Life expectancy is 10 years or more. The body is elongated and thick. There is an adipose fin on top of the caudal peduncle. The caudal fin has a barely noticeable notch. The head is not large, wedge-shaped. The mouth is large, the upper jaw reaches the posterior edge of the eye. The dorsal surface is dark gray, the sides and belly are silvery. Small dark spots are located above and below the lateral line, as well as on the gill covers. The dorsal and caudal fins are dark, the anal and paired fins are grayish.<br/> The Black Sea salmon goes into rivers to spawn. Spawning is usually in the fall, but sometimes occurs in January-March. In the second or third year of life, the juveniles migrate to the sea. At sea, it feeds on fish and invertebrates."
        },
        {
            "id": 67,
            "class": "Ray-finned fishes",
            "name": "Bluefish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bluefish_lufar%2F1.jpg?alt=media&token=bb0d9e0f-e2ca-4ede-bf3e-cb433edb2949",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bluefish_lufar%2F2.jpg?alt=media&token=59c9f306-3e8c-4e1d-a346-05c97f2fcd22",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bluefish_lufar%2F3.jpeg?alt=media&token=bee0dbee-5d41-4a0e-8f1b-91c006a2d3f7",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bluefish_lufar%2F4.jpeg?alt=media&token=501bb92d-4961-4693-851b-d8338abde6c2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/bluefish_lufar%2F5.jpeg?alt=media&token=2dc0bdb4-d82e-42bb-a020-465da5b93793"
            ],
            "video": "https://www.youtube.com/embed/bPvbhCF9lok?si=3TmwUthCcjC_1i3h",
            "text": "The bluefish (Pomatomus saltatrix) is the only extant species of the family Pomatomidae. Adult bluefish are typically between 20 and 60 cm (8 in. to 2 ft.) long, with a maximum reported size of 120 cm (4 ft.) and 14 kg (31 lb). It is a moderately proportioned fish, with a broad, forked tail. The spiny first dorsal fin is normally folded back in a groove, as are its pectoral fins. Its single row of teeth in each jaw is uniform in size, knife-edged, and sharp. Coloration is a grayish blue-green dorsally, fading to white on the lower sides and belly.<br/> The bluefish is found in pelagic waters on much of the continental shelves. Adult bluefish are strong and aggressive, and live in loose groups. They are fast swimmers that prey on schools of forage fish, and continue attacking them in feeding frenzies even after they appear to have eaten their fill. Depending on area and season, they favor sardine-like fish, mackerel, anchovies and shrimp. They are cannibalistic and can destroy their own young."
        },
        {
            "id": 68,
            "class": "Ray-finned fishes",
            "name": "Black Sea turbot",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_turbot_chernomorskij_kalkan%2F1.jpg?alt=media&token=5aacad3b-2763-4cc3-82a0-a4899229b1e3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_turbot_chernomorskij_kalkan%2F2.jpg?alt=media&token=4dc8ceb6-bfff-49b8-aee9-72b46e7119e4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_turbot_chernomorskij_kalkan%2F3.jpg?alt=media&token=95f4c74a-32c7-4171-94f3-80f04bc45744",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_turbot_chernomorskij_kalkan%2F4.jpg?alt=media&token=b6cc9b08-8816-4f6c-a267-3973c69877a6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/black_sea_turbot_chernomorskij_kalkan%2F5.jpg?alt=media&token=0f8a8e47-5702-4d2a-bbfd-94f315fad01a"
            ],
            "video": "https://www.youtube.com/embed/umUFkdZN3w0?si=GA-IUUw-Q2zZ8Z1N",
            "text": "The Black Sea turbot or kalkan (Scophthalmus maeoticus) is a fish species in the family Scophthalmidae. The maximum body length is 85 cm, and the weight is 12 kg. The width of the body is almost equal to the length or even greater. The body is covered with bony conical tubercles. The fish's eyes are on its left (upper) side. The lower part (right side) is white, the eye side is brownish, with reddish spots. The fish has no scales. It also has the ability to change color for camouflage depending on the color of the bottom. The jaws are armed with smooth, bristle-like teeth arranged in the form of ribbons.<br/> The Black Sea turbot prefers sandy (shell) and silty soils and inhabits them to depths of over 100 m. In winter and summer it stays in deeper water, in spring and autumn it moves to shallow water. The adult kalkan feeds mainly on small fish (blunt-snouted mullet, european anchovy, horse mackerel, Black Sea sprat) and crabs, while juveniles feed mainly on crustaceans."
        },
        {
            "id": 69,
            "class": "Ray-finned fishes",
            "name": "Scaldback",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/scaldback_arnogloss_kesslera%2F1.jpg?alt=media&token=31cb16b4-1ae2-45bb-b1b5-c4bbb3ee08ce",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/scaldback_arnogloss_kesslera%2F2.jpg?alt=media&token=c6b21fe4-dd16-4113-a85d-4fe60971a887",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/scaldback_arnogloss_kesslera%2F3.jpg?alt=media&token=de4e51bc-3d1b-4340-aed4-b0957453f413",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/scaldback_arnogloss_kesslera%2F4.jpg?alt=media&token=79f30d7e-f5ee-42e0-9904-05e8f9a64b9d"
            ],
            "video": "https://www.youtube.com/embed/uDmqTSVRz8k?si=xmivl_6KZctZK27m",
            "text": "Scaldback (Arnoglossus kessleri) is a species of flatfish belonging to the family Bothidae. Maximum body length 10 cm. The body is oval-oblong, relatively high, strongly compressed laterally. The entire body is covered with rather large, easily falling scales, which extend to the head, with the exception of the jaws and areas around the nostrils. Both eyes are on the left side of the head. The teeth on the jaws are small in size, without fangs. The dorsal fin begins before eye level, its anterior rays are not elongated. The 10 anterior rays are folded in a calm state on the blind (right) side of the body. The paired fins on the left side are longer than those on the right side. The pelvic fins are located at the very end of the promontory. The color of the eye side is grayish-yellowish with small black dots and spots on the head, body and rays of unpaired fins. The blind side is light.<br/> Scaldback lives in the bottom layers of the shelf zone near the sea coast at the bottom. It is found at depths from 3 to 65 m (usually about 20 m). Prefers sandy and sandy-pebble soils. Winters at depth. Spawning lasts from June to mid-September in the coastal zone at a depth of 3-7 m. Females lay eggs on the bottom. The eggs float into the water column, where they develop. As the fry grow and develop, their body transforms from the usual shape for fish to a form in which the left side becomes upper and both eyes move to the left side of the head. This is accompanied by a transition from pelagic to benthic lifestyle and nutrition from planktonic to benthic."
        },
        {
            "id": 70,
            "class": "Ray-finned fishes",
            "name": "Common sole",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F1.jpg?alt=media&token=689be8a1-0c0a-47c7-980c-8e94e1a6b1c8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F2.jpg?alt=media&token=99a2fb4c-07d0-41ac-9ed9-d9c885a214b2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F3.jpg?alt=media&token=2914292d-f5fa-46e8-8449-554c1c9d4ef3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F4.jpg?alt=media&token=ce91fcb2-1f36-4075-925e-1ceb4c1b9f91",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F5.jpg?alt=media&token=fe58480e-f16b-4918-93f6-0454fe2a9530",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F6.jpg?alt=media&token=596208f2-f171-444d-a0b4-fa111e95c5d5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F7.jpg?alt=media&token=71a257b2-a744-49e0-a34b-57539df8224c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_sole_evropejskaya_soleya%2F8.jpg?alt=media&token=502c7e99-74ab-43fd-b8b0-27ecd0943929"
            ],
            "video": "https://www.youtube.com/embed/TOQO1fo-fbU?si=6JjLWDSzUC5TJ4L-",
            "text": "The common sole or black sole (Solea solea) is a species of flatfish in the family Soleidae. It is one of the largest fish in the Solea genus. It grows to a maximum length of about 70 cm (28 in). The small eyes are close to each other on the right side of the body. This gives the fish the possibility of lurking half-buried in the sand for passing prey. The common sole, just like all other flatfishes, hatches as an 'ordinary' fish with one eye on each side of the body. The young metamorphose to flatfish when they are about one centimeter long. The upper side is greyish-brown and the underside is white.<br/> The common sole has a preference for relatively shallow water (10-60 m) with sand or mud covering the bottom. They also can be found at depths up to 200 m. Their preferred temperature range is from 8-24 °C. It feeds at night. Its diet consists of worms, molluscs and crustaceans."
        },
        {
            "id": 71,
            "class": "Ray-finned fishes",
            "name": "Atlantic bonito",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_bonito_atlanticheskaya_pelamida%2F1.jpg?alt=media&token=e4c7cb7e-c4cf-4415-b0aa-46a8da605596",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_bonito_atlanticheskaya_pelamida%2F2.jpg?alt=media&token=dbfb8a8e-7116-48e9-bb50-e6ddf44541bd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_bonito_atlanticheskaya_pelamida%2F3.jpg?alt=media&token=75eeff2b-5bc3-4c1b-ac11-f9b1e5fff1fb",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_bonito_atlanticheskaya_pelamida%2F4.jpg?alt=media&token=0d7241a2-e986-4382-adf8-b92643af4739",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/atlantic_bonito_atlanticheskaya_pelamida%2F5.jpg?alt=media&token=d5e5f0d2-ea45-4c4b-96d8-77b0afc6efe1"
            ],
            "video": "https://www.youtube.com/embed/TDOap-sTBrs?si=Gys6focVMPUcZ7LQ",
            "text": "The Atlantic bonito (Sarda sarda) is a large mackerel-like fish of the family Scombridae. Atlantic bonito grow up to 85 centimetres (33.5 in) and weigh 5-6 kilograms (11-13 lb) at this size. It belongs to a group in which the dorsal fins are very close together or separated by a narrow gap. Its body is completely scaled, with those scales in the pectoral fin area and the lateral line usually larger in size. The mouth is quite large and wide. The upper jaw reaches the posterior edge of the eye. The teeth are small, conical, arranged in one row. The palatine bones have strong conical single-row teeth. There are 16-26 teeth on the upper jaw, and 12-24 teeth on the lower jaw. The first dorsal fin has 20-23 spiny rays, and the second has 14-17 soft rays. The edge of the first dorsal fin is almost straight. Behind the second dorsal fin there is a row of 8 small fins. The pectoral fins are short, formed by 23-26 rays. The anal fin has 13-16 soft rays. Behind the anal fin there is a row of 7 small fins. The caudal peduncle is narrow. Atlantic bonito can be distinguished from its relatives by its dark oblique stripes on the back and with a maxillary only about half as long as the head. The back is blue-green, the sides and belly are silvery, the upper half of the body is covered with 5-12 narrow dark longitudinal stripes.<br/> The Atlantic bonito is a strong swimmer. Normally, it travels in fairly large schools. The diet is based on small schooling pelagic fish. These fish are capable of swallowing quite large prey. Cannibalism is common."
        },
        {
            "id": 72,
            "class": "Ray-finned fishes",
            "name": "Red gurnard",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red_gurnard_krasnaya_trigla%2F1.jpg?alt=media&token=e97f0548-d5a6-4d7f-8a80-315209728524",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red_gurnard_krasnaya_trigla%2F2.jpg?alt=media&token=ca5ac1f1-8ec8-461a-b28f-4e236c375b8e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red_gurnard_krasnaya_trigla%2F3.jpg?alt=media&token=9c702960-e54f-4672-93b5-feaded9c2cbd",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red_gurnard_krasnaya_trigla%2F4.jpg?alt=media&token=43a8bb34-7ddb-49da-9400-26a156e0b9d6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/red_gurnard_krasnaya_trigla%2F5.jpg?alt=media&token=f15c1327-eba0-4834-a573-32f7b74e6fd0"
            ],
            "video": "https://www.youtube.com/embed/EavdUtymNr0",
            "text": "The red gurnard (Chelidonichthys cuculus), also known as the East Atlantic red gurnard or soldier, is a benthic species of ray-finned fish belonging to the family Triglidae. This fish has a maximum published total length of 70 cm (28 in), although a fork length of 27.6 cm (10.9 in) in males and 20.4 cm (8.0 in) in females is more typical. It has a large angular head which does not have a deep occipital groove but has a steep snout, which is elongated forward with a flattened, two lobed rostrum covered in denticles. The first dorsal fin contains 9 or 10 spines, the first of which is serrated to the front and the second spine is not elongated. the second dorsal fin has 17 or 19 soft rays while the anal fin contains between 16 and 18 soft rays. The pectoral fins have 2 or 3 enlarged, separate rays. The scales in the lateral line resemble plates having been lengthened vertically. There are no scales on the breast and the front part of the belly. The colour is bright red on the upper body, pale on the lower body with pink pelvic fins. The anal fin is white at its base while the pectoral and dorsal fins are yellowish.<br/> The red gurnard is a demersal species which has been recorded from depths between 15 and 400 m (49 and 1,312 ft), although the usual range is 30 and 250 m (98 and 820 ft). It is typically recorded on habitats dominated by sand or gravel, although it has also been found in rocky and muddy habitats. It  feeds almost entirely on malacostracan crustaceans with fishes, molluscs and sea cucumbers taken in much smaller amounts. Prey is detected using the enlarged, separated rays of the pectoral fins. This species produces sounds, being noted to croak like a frog. It sometimes aggregates in schools, and it is known to spawn in the summer."
        },
        {
            "id": 73,
            "class": "Ray-finned fishes",
            "name": "European seabass",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F1.jpg?alt=media&token=138fcbc2-5c9d-4571-86e7-26f8f2a7abc9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F2.jpg?alt=media&token=315ac371-d2b1-43d9-a390-d656de345ed2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F3.jpg?alt=media&token=41679a86-dace-4380-ab52-17e7444e70b6",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F4.jpg?alt=media&token=de7082d2-c6a3-4170-82b8-d3433face812",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F5.jpg?alt=media&token=254444ef-098d-4858-b8a7-0d14ed31a520",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F6.jpg?alt=media&token=5895e432-b0c0-46c5-a34e-b19854430cd8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/european_seabass_obyknovennyj_lavrak%2F7.jpg?alt=media&token=9964a206-5ab4-4899-abd0-0e26fc104767"
            ],
            "video": "https://www.youtube.com/embed/8aZcVVvsoOo?si=9JlK3t_-tbm9Lncx",
            "text": "The European seabass (Dicentrarchus labrax), also known as the European bass, sea bass, common bass, white bass, capemouth, white salmon, sea perch or white mullet is a fish of the family Moronidae. It is a slow-growing species that takes several years to reach adulthood. An adult European seabass usually weighs around 2.5 kg (5.5 lb). It can reach measurements of up to 1 m (3 ft 3 in) in length and 12 kg (26 lb) in weight, though the most common size is only about half of that at 0.5 m (1 ft 8 in). The body is elongated, somewhat laterally compressed, covered with large scales. There are two dorsal fins, the first dorsal fin has 8-9 spiny rays, and the second has one spiny ray and 12-14 soft rays. The anal fin has 3 spiny and 10-13 soft rays. Caudal fin with a small notch. Individuals are silvery grey and sometimes a dark-bluish color on the back.<br/> The European seabass is a marine pelagic fish. It lives in coastal waters at a depth of 10-100 m. Spawns from February to June in open waters far from the shore. It hunts as much during the day as it does at night, feeding on small fish, polychaetes, and crustaceans. The big fish weighing more than 4 kg (8.8 lb) are mostly night hunters."
        },
        {
            "id": 74,
            "class": "Ray-finned fishes",
            "name": "Grass goby",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F1.jpg?alt=media&token=3ddd7525-e0e9-4af0-a676-861483e03a44",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F2.jpg?alt=media&token=bf49c34d-0173-4803-8737-91fa8ab6b335",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F3.jpg?alt=media&token=2282a7a8-f9e1-49e3-875c-d034323c77ba",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F4.jpg?alt=media&token=02c12154-a461-499b-8174-c92fb51f7d0e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F5.jpg?alt=media&token=fd359ec8-99e2-4e95-a242-28929e6f4bc2",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F6.jpg?alt=media&token=5a364d0e-a35d-41dc-87c4-df3e23e95448",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/grass_goby_bychok-travianik%2F7.jpg?alt=media&token=2b0075be-0171-48e5-b58e-12d9505e615b"
            ],
            "video": "https://www.youtube.com/embed/T5ia_rOwNkA?si=xLehpgzHXR0yesKY",
            "text": "The grass goby (Zosterisessor ophiocephalus) is a species of the family Gobiidae. It can grow up to 25 cm (9.8 in) long. Top of the head, throat, belly, and bases of the pectoral fins are covered by cycloid scales and the gill covers are naked. The lower jaw protrudes forward. The skin is soft, with mucus. Their coloration is green-brown, patterned with merging brown spots. The cheeks have round light spots. The dorsal, caudal, and pectoral fins have longitudinal brown stripes on a light background; the anal and abdominal suckers are dark.<br/> The grass goby lives in coastal waters with a high salinity range. Until it reaches two years of age, it eats only small crustaceans (like gammarids). After this it starts to eat fish and shrimps. Some predatory fish, including the large knout goby, feed on grass goby, and the Black Sea bottlenose dolphin also feeds on it."
        },
        {
            "id": 75,
            "class": "Ray-finned fishes",
            "name": "Round goby",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F1.jpg?alt=media&token=93ff1104-3b8f-4870-8278-b18254012fef",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F2.jpg?alt=media&token=31a915d1-e808-4023-91d2-0cc6abe8e656",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F3.jpg?alt=media&token=fb65e69a-0186-4469-a089-8f064b541031",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F4.jpg?alt=media&token=4368a2d3-2b2f-4d74-9a0d-a727ad253561",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F5.jpg?alt=media&token=4724bf1a-3ec5-4f6c-973a-52ad76bfb8e9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F6.jpg?alt=media&token=031c85a1-07e6-4ff9-8c1a-f90042e9ba30",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F7.jpg?alt=media&token=d4634e19-0390-4151-8341-ae6c2111df0b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F8.jpg?alt=media&token=1332a464-1fbe-4408-85e1-724b9962933b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/round_goby_bychok-krugliak%2F9.jpg?alt=media&token=7c565d3d-a976-4f66-9f0e-041f5ca1b01e"
            ],
            "video": "https://www.youtube.com/embed/s2jDKhVVIR8?si=4gPuLeI7uUepQVhF",
            "text": "The round goby (Neogobius melanostomus) is a species of fish of the family Gobiidae. It ranges in length from 10 to 25 centimetres (4 to 10 inches), with a maximum size of 24.6 cm (9.7 in). It weighs between 5.0 and 79.8 grams (0.176 and 2.816 ounces), its weight increasing with age. Males are larger than females. Round goby is a soft-bodied fish characterized by a distinctive black spot on the first dorsal fin. The eyes are large and protrude slightly from the top of the head and, like most gobies, the pelvic fins are fused to form a single disc (shaped like a suction cup) on the belly. Juvenile round gobies (less than one year old) are grey. Upon maturation, round gobies become mottled with grey, black, brown, and olive green markings. Adult male round gobies turn inky black during the spawning season and develop swollen cheeks.<br/> The round goby is a euryhaline bottom-dwelling species. It is commonly found on continental shelves with sandy and rocky bottoms with low silting at depths from 1-2 m (3.3-6.6 ft) to 10-17 m (33-56 ft). It actively feeds both nocturnally and diurnally and is believed to detect prey only while stationary. The primary diet of round gobies includes mollusks, crustaceans, worms, fish eggs, small fish, insect larvae, and other small invertebrates (insects and amphipods) living on the bottom."
        },
        {
            "id": 76,
            "class": "Ray-finned fishes",
            "name": "Transparent goby",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/transparent_goby_afiya%2F1.jpg?alt=media&token=df0cec0a-2400-4bf7-85f1-a2711f8b364f",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/transparent_goby_afiya%2F2.jpg?alt=media&token=942b688d-4ab8-4d58-9473-e06d6347b2de",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/transparent_goby_afiya%2F3.jpg?alt=media&token=d529a796-c3a0-4746-bafd-e8ec675772c1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/transparent_goby_afiya%2F4.jpeg?alt=media&token=0aca189b-d651-47d2-a535-1bcbc89a015c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/transparent_goby_afiya%2F5.jpg?alt=media&token=813f5dc2-9ea6-4042-a26d-9589444378ca"
            ],
            "video": "https://www.youtube.com/embed/g_GRKBR_fjE?si=6JZvK2s_Cc3h-7UL",
            "text": "The transparent goby (Aphia minuta) is a species of the goby of the family Gobiidae. Maximum body length 7.9 centimetres (3.1 in). Life expectancy 1 year. The body is elongated, rather low, noticeably laterally compressed. The head, back to the beginning of the dorsal fin, flanks and caudal peduncle are covered with cycloid scales, which easily fall off the body when touched. The mouth is large, the teeth on the jaws are small, conical, arranged in one row. During life, almost the entire body is transparent, light, sometimes somewhat reddish. Adults have small black dots on the lips, on the top of the middle of the head, on the chin and in front of the ventral fins below, and at the base of the dorsal fins there are black-green spots; along the middle of the body there are yellow-greenish-reddish dots, along the anal fin there are red-brownish dots, along the rays of the caudal fin there are red dots.<br/> The transparent goby inhabits inshore waters. It can be found at depths of from the surface to 97 metres (318 ft), though it is usually found at 5 to 80 metres (16 to 262 ft), over sandy and muddy bottoms and also in eelgrass beds. It feeds on zooplankton, preferring crustaceans."
        },
        {
            "id": 77,
            "class": "Ray-finned fishes",
            "name": "Giant goby",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F1.jpg?alt=media&token=45cd4b13-22bc-46c5-8f9b-c75d731e14aa",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F2.jpg?alt=media&token=db253e21-6cd7-4273-bd66-79c380ac2b49",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F3.jpg?alt=media&token=2cc9b932-d354-4cd7-8790-b9a2ea7ce3ec",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F4.jpg?alt=media&token=8cdbf2cc-e883-48cb-9a42-f01aac8e6591",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F5.jpg?alt=media&token=180fef3b-9885-4dc2-a1e1-2b85468ea5d8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F6.jpg?alt=media&token=164360db-0674-4511-b55e-f9fe74dae561",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F7.jpg?alt=media&token=17956cb7-19cb-4131-bcb9-eba0508ffca5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F8.jpg?alt=media&token=001dc747-72da-40fa-bb34-875aaf14750c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/giant_goby_bolshoj_morskoj_bychok%2F9.jpg?alt=media&token=30f032d2-0532-4d99-90ef-a5f730c95fcc"
            ],
            "video": "https://www.youtube.com/embed/WWuf6ieZPas?si=SSaJMtreD3KJDEvP",
            "text": "The giant goby (Gobius cobitis) is a species of goby of the family Gobiidae. It grows to 27 centimetres (11 in) in length. It is greyish to olive brown with 'pepper and salt' markings. These are especially notable in smaller specimens. Dark blotches appear along and below the lateral midline. The edges of the dorsal, tail and anal fins are light greyish in colour. The body is covered in small scales. Scales on top of the head do not extend to the level of the eyes. Upper rays of pectoral fin free of membrane. The tail stalk is short. The eyes are small.<br/> The giant goby lives in coastal marine and brackish waters at depths of from 10 to 35 metres (33 to 115 ft). It prefers rock pools high up in the intertidal zone of sheltered shores. Occupied pools typically contain boulders under which the giant goby can take shelter, and have inputs of freshwater, so the water in the pools is usually brackish. This species has been recorded to feed upon polychaete worms, green algae, amphipods, crabs and insects."
        },
        {
            "id": 78,
            "class": "Ray-finned fishes",
            "name": "Rock goby",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F1.jpg?alt=media&token=5cfcefe0-bfa6-46ec-8893-6975590835e4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F2.jpg?alt=media&token=6212b67c-7bbd-44d0-8548-a8c43f52ce33",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F3.jpg?alt=media&token=2133791a-a3b0-4608-b1a9-0c46cfb1f040",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F4.jpg?alt=media&token=59c4af5f-4c2c-4839-a8ef-cc37a4d50db3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F5.jpg?alt=media&token=a914832c-11ae-4b74-bd19-ea4af48298bc",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F6.jpg?alt=media&token=f03eacd6-a3d8-4d9d-900c-7c659b09c240",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F7.jpg?alt=media&token=743d999e-3946-4fdf-9dd3-8edfdf7d97b4",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F8.jpg?alt=media&token=fd4d62d1-3858-47e9-87ec-771904c0c227",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/rock_goby_bychok-paganel%2F9.jpg?alt=media&token=f87e3fd2-765a-4055-b905-0681f762049d"
            ],
            "video": "https://www.youtube.com/embed/Y25_4dQ6edA?si=lS1ZeX6R_tAEKfxC",
            "text": "The rock goby (Gobius paganellus) is a small coastal goby of the family Gobiidae. It can reach a length of 12 centimetres (4.7 in) and has been known to live for ten years. It is usually black with white blotches, but they can change color, and males are much more black when guarding the eggs. The neck area lacks scales and there is a pale band on the top of the first dorsal fin. Both dorsal fins lack black spots on their leading edges.<br/> The rock goby prefers rocky sea floors below the low tidemark, although it can be found in larger rock pools in Summer. It may also live in fresh or brackish water. It can be found at depths of from 0 to 15 metres (0 to 49 ft). It eats small crabs and amphipods, polychaetes, larva, small fish, copepods and mites.<br/> The rock goby reproduces in spring. It nests in rocky areas. Up to 7000 eggs are laid in a single layer under rocks and shells. The eggs are laid in a single layer (2.5 mm in height) and guarded aggressively by the male. The eggs hatch in about 19 days."
        },
        {
            "id": 79,
            "class": "Bivalvia",
            "name": "Soft-shell clam",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/soft-shell_clam_peschanaya_miya%2F1.jpg?alt=media&token=a005bb39-535f-480d-8e02-ea4e3f66147b",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/soft-shell_clam_peschanaya_miya%2F2.jpg?alt=media&token=8aaf2994-ca58-4257-8de1-f55c610d09ea",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/soft-shell_clam_peschanaya_miya%2F3.jpg?alt=media&token=e89213a4-ba3f-441a-86d4-0232bddb322c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/soft-shell_clam_peschanaya_miya%2F4.jpg?alt=media&token=351f8b92-f320-4aaf-a945-ce394ea69dc2"
            ],
            "video": "https://www.youtube.com/embed/hsBVvlJjNtc?si=V7xFxmrNgXdM9tlJ",
            "text": "Soft-shell clams or sand gaper (Mya arenaria) are a species of edible saltwater clam, a marine bivalve mollusk in the family Myidae. It has a calcium carbonate shell that is thin and easily broken, hence the name 'soft-shells'. Shell length up to 13 cm. The shape of the shell is usually oval, somewhat elongated at the back, moderately convex. The color of the shell varies from off-white to yellowish.<br/> This clam is found living approximately 7.6-20.3 cm (3-8 in) under the surface of the mud. They live buried in the sediment on tidal flats. It extends its paired siphons up to the surface; these draw in seawater, filter it for food, and expel it. The holes in the mud through which the water is drawn in and out can often be seen at low tide. Life expectancy is 10-12 years, maximum up to 28 years."
        },
        {
            "id": 80,
            "class": "Bivalvia",
            "name": "Mediterranean mussel",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F1.jpg?alt=media&token=d0c6dc5e-55aa-4788-9a70-f58c5dd5e0e0",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F2.jpg?alt=media&token=30c61fc0-4c5f-4a59-83a3-90ceb9f035d5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F3.jpg?alt=media&token=dd6d9b13-3d25-4c6e-8741-8009c72ebed8",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F4.jpg?alt=media&token=1cbefd1f-0e50-4502-b9a2-12b714ea9c9c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F5.jpg?alt=media&token=72c177ef-bbf5-492f-9dfd-2ec5706a009a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F6.jpg?alt=media&token=5ca763b2-b6a1-4d08-838d-7eb704f21693",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/mediterranean_mussel_sredizemnomorskaya_midiya%2F7.jpg?alt=media&token=9293a075-9322-4f03-a9c9-ef1d9d651507"
            ],
            "video": "https://www.youtube.com/embed/S-mwhEzAeDg?si=iZQ00jQkXg6qmrMt",
            "text": "The mediterranean mussel (Mytilus galloprovincialis) is a species of bivalve, a marine mollusc in the family Mytilidae. This animal grows up to 140 mm in length. It is a smooth-shelled mussel with quite broad base. Its shell is blue-violet or black, but may shade to light brown.<br/> The mediterranean mussel is a filter feeder. It is rare subtidally. They are generally considered as a bioindicators of the whole ecosystem in which they live. The immune system of bivalve molluscs is often chosen as a target parameter to evaluate the welfare of the species and of their surrounding environment. The immune systems of the mediterranean mussels are influenced by changing environmental parameters such as water acidification, temperature increases and variations in seawater salinity. Mussel colonies have a positive impact on the ecological state of the area. They not only destroy “marine debris” and clean the bottom, but also filter sea water, passing it through themselves. They are also one of the food sources for the local marine fauna."
        },
        {
            "id": 81,
            "class": "Gastropoda",
            "name": "Veined rapa whelk",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/veined_rapa_whelk_venoznaya_rapana%2F1.jpg?alt=media&token=54f51f25-3dfa-4b4a-b6f7-160b31640a5a",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/veined_rapa_whelk_venoznaya_rapana%2F2.jpg?alt=media&token=fada8a22-97e6-4345-9d83-9852f7e94581",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/veined_rapa_whelk_venoznaya_rapana%2F3.jpg?alt=media&token=6d6c027f-a485-48fe-9c86-05dfc6fe62ee",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/veined_rapa_whelk_venoznaya_rapana%2F4.jpg?alt=media&token=b1ac768b-d398-4809-a96a-6ad80bae1789",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/veined_rapa_whelk_venoznaya_rapana%2F5.jpg?alt=media&token=85b3e5c1-64cb-4e91-8279-48f9e1694a39"
            ],
            "video": "https://www.youtube.com/embed/IS_Mfd_6Fok?si=vTi7oYmENIarp1Mh",
            "text": "Veined rapa whelk (Rapana venosa), also known as asian rapa whelk, is a species of large predatory sea snail, a marine gastropod mollusc or whelk, in the family Muricidae, the rock shells. The shell of veined rapa whelk is globose (rounded) and heavy, possessing a very short spire, a large body whorl, a strong columella and a deep umbilicus. The aperture is large and roughly ovate. Ornamentation is present externally as axial ribs, smooth spiral ribs ending in blunt knobs at both the shoulder and body whorl, and internally as small elongated teeth disposed along the outer lip margin. The external color varies from gray to reddish-brown, with dark brown dashes on the spiral ribs. Some specimens may have distinctive black/dark blue vein-like coloration patterns throughout the inner portions of the shell, usually originating from each individual tooth at the outer lip. A diagnostic feature for this species is the deep orange color found in the aperture and on the columella. The height of the shell can reach up to 180  mm (about 7 in).<br/> Veined rapa whelks favor compact sandy bottoms, in which they can burrow almost completely. The native habitat of this species is a region of wide annual temperature ranges, comparable to other localities. Fleeing cold waters in the winter, this species may migrate to warmer, deeper waters, thereby evading cool surface waters. This fertile sea snail is extremely versatile, tolerating low salinities, water pollution and oxygen deficient waters. Large specimens may be over ten years old.<br/> Veined rapa whelks are carnivorous selective predatory gastropods whose main diet consists of a variety of other mollusk species, mainly epifaunal bivalves such as oysters and mussels, but also clams. Prey are chosen by the whelk according to their species and size. Most snails feed by drilling a hole into their bivalve prey, but rapa whelks usually smother their prey by wrapping around the hinged region of the shell and feed by introducing their proboscis between the opened valves. The whelk can also secrete a thick mucus that may or may not contain biotoxins to weaken the prey."
        },
        {
            "id": 82,
            "class": "Gastropoda",
            "name": "Netted dog-whelk",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F1.jpg?alt=media&token=48053891-6eec-4132-a07f-833e8ee66ec1",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F2.jpg?alt=media&token=11cbf41d-5181-40ac-af2f-718b8e07edda",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F3.jpg?alt=media&token=43ac4545-c9cb-4a9b-b720-344c16f57a86",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F4.jpg?alt=media&token=85ef6e26-2620-478e-86a8-666ccc77959c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F5.jpg?alt=media&token=5bdde263-e6fe-4d24-b043-1fec9f156e1e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F6.jpg?alt=media&token=4d62cd60-c072-451b-b30a-477d5f3a8cf3",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/netted_dog-whelk_tritiya_setchataya%2F7.jpg?alt=media&token=adb9fbf0-d268-41c4-9ec1-d77ff28a2651"
            ],
            "video": "https://www.youtube.com/embed/VESY2tc9IMU?si=kDEJpbGab9jCjSQp",
            "text": "The netted dog-whelk (Tritia reticulata) or netted nassa is a species of small European sea snail, a marine gastropod mollusc in the family Nassariidae. The length of the shell varies between 20 mm and 35 mm. The egg-shaped shell is elongated, rounded, obtuse at its lower extremity, and pointed at the upper extremity. It is moderately thick. The conical spire is composed of eight or nine whorls, almost flat, or slightly swollen, but distant from each other. Their surface is deeply chequered by longitudinal folds, crossed by numerous striae. The aperture is moderate, white and ovate. The outer lip is thick, ornamented within with seven or eight striae, of which those of the middle are generally the largest. The columella is slightly arcuated, covered with a thin, brilliant plate. The color of this shell is of a yellowish white, reddish or chestnut-color, with a blackish blue band, passing beneath the suture.<br/> The netted dog-whelk is a widespread species that lives mainly on rocks, but is also found on sandy and silty soils. This species is characterized by a high degree of adaptability to environmental conditions. It easily tolerates both increases and decreases in water temperature and salinity ranging from 10 to 37 ppm. It is a scavenger, less often a predator, drilling through the thin-walled shells of bivalve mollusks. It also feeds on plants and detritus."
        },
        {
            "id": 83,
            "class": "Scyphozoa",
            "name": "Barrel jellyfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F1.jpg?alt=media&token=68021b7c-65e5-4620-8e5c-27e1e84ec36c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F2.jpg?alt=media&token=853c1b13-5a02-430d-8fff-5cbb8fa8e8b5",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F3.jpg?alt=media&token=8c49e714-d0e2-4b94-99dd-2a05bb75c7ca",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F4.jpg?alt=media&token=0d555f28-beea-4890-b30f-d0f0d4a54d89",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F5.jpg?alt=media&token=3a74571f-6514-490a-b349-0e229a69cbee",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F6.jpg?alt=media&token=66d069b1-9a6f-4d0d-b7a6-1728ae51af68",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/barrel_jellyfish_kornerot%2F7.jpg?alt=media&token=377f42fb-d269-4c7a-8867-4ec3f4fa1421"
            ],
            "video": "https://www.youtube.com/embed/G11ZnnMQ3sk?si=t8jJJNDYdXJmPonX",
            "text": "The barrel jellyfish (Rhizostoma pulmo) or the dustbin-lid jellyfish, or the frilly-mouthed jellyfish, is a scyphomedusa in the family Rhizostomatidae. It typically is up to 40 cm (16 in) in diameter, but can exceptionally reach 150 cm (59 in) or larger. They have neither tentacles nor other structures at the bell's edges. Instead, they have eight highly branched oral arms, along which there are suctorial minimouth orifices. These oral arms become fused as they approach the central part of the jellyfish. The mouth of the animal is also subdivided into minute pores that are linked to coelenteron. The main source of food is planktonic organisms, which the jellyfish catch from the jet stream generated by the contraction of the bell and swallow through secondary oral openings on the oral lobes.<br/> The barrel jellyfish is moderately venomous but not as deadly as other species. Effects include a burning sensation on the skin, dermatitis, and ulcers which confirms it is toxic to humans. However, it does not pose a serious threat to humans."
        },
        {
            "id": 84,
            "class": "Scyphozoa",
            "name": "Common jellyfish",
            "photo": [
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F1.jpg?alt=media&token=f2d03b75-fbe9-4225-96fd-5a11db348dd9",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F2.jpg?alt=media&token=e461e58c-5bfe-47ee-b280-57b0633ca262",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F3.jpg?alt=media&token=2f152b4b-8c4b-4c45-9e4b-cb739494137c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F4.jpg?alt=media&token=af905521-6351-43a8-89e1-738a966a7b99",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F5.jpg?alt=media&token=7b4759b5-efdc-478d-8b2e-5c8fdfa88a3e",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F6.jpg?alt=media&token=0dac5614-4145-4a2b-b96a-e0d1267ab28c",
                "https://firebasestorage.googleapis.com/v0/b/r-b-s-89bc3.appspot.com/o/common_jellyfish_ushastaya_aureliya%2F7.jpg?alt=media&token=28ea7b65-1914-44e9-bcab-2778abf8f066"
            ],
            "video": "https://www.youtube.com/embed/P9a21SUXO7E?si=948RRbvFnK6boQpW",
            "text": "Common jellyfish (Aurelia aurita) or moon jellyfish is a species of the family Ulmaridae. It is almost entirely translucent, usually about 25-40 cm (10-16 in) in diameter. The dome of a jellyfish is in the form of a round flat umbrella, along the edge of which there are numerous thin tentacles hanging down. The tentacles are studded with stinging cells that kill and paralyze small animals. When looking at the dome from above, you can see the stomach, consisting of four pockets and digestive canals radiating from it. Along the edge of the umbrella there are small cutouts with thickenings - marginal bodies (ropalia). They contain the main sensory organs of the jellyfish - the eyes and balance organs (statocysts). In the center of the lower concave part of the umbrella there is a quadrangular mouth, surrounded by four large oral lobes, shaped like donkey ears. The jellyfish respires by diffusing oxygen from water through the thin membrane covering its body. The large surface area membrane to volume ratio helps Aurelia diffuse more oxygen and nutrients into the cells.<br/> Common jellyfish feeds by collecting medusae, plankton, and mollusks with its tentacles, and bringing them into its body for digestion. It is capable of only limited motion, and drifts with the current, even when swimming."
        }
    ]
}